{"meta":{"title":"超 - 光","subtitle":null,"description":"Optics is the study of light 分享光学知识","author":"Sterncat","url":"https://faster-than-light.net","root":"/"},"pages":[{"title":"404","date":"2021-12-04T11:32:05.717Z","updated":"2021-12-04T11:32:05.717Z","comments":true,"path":"/404.html","permalink":"https://faster-than-light.net/404.html","excerpt":"","text":"页面未找到，可能是更换了链接所致，请回到首页，或归档页，或使用右侧的搜索功能。"},{"title":"About","date":"2021-04-29T02:56:38.000Z","updated":"2021-12-04T11:32:05.730Z","comments":true,"path":"about/index.html","permalink":"https://faster-than-light.net/about/index.html","excerpt":"","text":"Email联系我们：&#x66;&#x61;&#x73;&#116;&#101;&#114;&#x74;&#x68;&#97;&#110;&#x6c;&#105;&#x67;&#104;&#116;&#50;&#x30;&#50;&#49;&#x40;&#103;&#109;&#97;&#x69;&#108;&#x2e;&#99;&#111;&#x6d;微信联系我们： 网站名：“超光”，faster-than-light即为超光速，”超光”这个名字的中文来自于美国作家丹·西蒙斯的1989年科幻小說《海伯利安》里构建的一种通信方式fatline: faster than light。"},{"title":"categories","date":"2021-12-04T11:32:05.731Z","updated":"2021-12-04T11:32:05.731Z","comments":true,"path":"categories/index.html","permalink":"https://faster-than-light.net/categories/index.html","excerpt":"","text":""},{"title":"tags","date":"2021-04-29T02:47:40.000Z","updated":"2021-12-04T11:32:05.797Z","comments":true,"path":"tags/index.html","permalink":"https://faster-than-light.net/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"光学新闻 20230514","slug":"OpticsNews20230514","date":"2023-05-13T17:00:00.000Z","updated":"2023-05-13T16:51:46.379Z","comments":true,"path":"OpticsNews20230514/","link":"","permalink":"https://faster-than-light.net/OpticsNews20230514/","excerpt":"近几周的五篇光学新闻： 小米13 Ultra发布 — “激光相对论卫星2号”（LARES-2）— 超透镜开发商 Imagia 完成450万美元种子轮融资— 丹麦政府阻止向滨松出售NKT Photonics— 美国雷声公司新推出“雷文”（RAIVEN）新一代光电智能传感系统—","text":"近几周的五篇光学新闻： 小米13 Ultra发布 — “激光相对论卫星2号”（LARES-2）— 超透镜开发商 Imagia 完成450万美元种子轮融资— 丹麦政府阻止向滨松出售NKT Photonics— 美国雷声公司新推出“雷文”（RAIVEN）新一代光电智能传感系统— 小米13 Ultra发布评论：小米和Leica的合作直接就是最大化Leica的品牌价值，然后就是搞市场的有点儿东西，广告做的真不错。13 Ultra提供四摄六焦段的强大影像系统，拥有四颗高素质徕卡光学镜头，分别是12mm超广，23mm广角，75mm长焦，120mm超长焦。同时，还有两个隐藏的焦段：46mm的2X变焦，240mm的10X变焦，这两个焦段，都是硬件直出。整体搭配非常合理，效果也特别优秀。小米还单独为 13 Ultra 推出了一套摄影套装，包含一个采用科技纳米皮的保护壳，以及一个无线摄影手柄，能够实现更为舒适的握持体验，以及物理快门按键的独特体验。 个人觉得硬件其实还是那些硬件，硬件当然做的是非常不错，但最终加持的还是Leica的风格调教和品牌效应。 雷军：小米13 Ultra重磅发布 “激光相对论卫星2号”（LARES-2）评论：一颗新发射的卫星将测量地球自转如何拉拽了周围时空的结构——这是爱因斯坦广义相对论中提出的一种效应——并将此前的测量精度提高十倍。这颗“激光相对论卫星2号”（LARES-2）2022年从法属圭亚那库鲁的欧洲空间局（ESA）太空港升空。LARES-2的结构非常简单：它是个有303块反射镜覆盖的金属球，不带任何电子设备或是导航控制系统。这种类似迪斯科球的设计和它的前代——2012年发射的广义相对论实验卫星LARES，以及NASA于1970年代发射的用来研究地球重力的探测器LAGEOS都很像。（Lares读法是LAY-reez，是古罗马的异教神。）下图展示了“灯球”的样子，以及LARES-1的反射镜以及LARES-2的反射镜 Information 超透镜开发商 Imagia 完成450万美元种子轮融资评论：新一代透镜技术开发商 Imagia最近宣布完成 450 万美元（约合人民币3107万元）种子轮融资。本轮融资由 Gates Frontier 领投，MetaVC Partners 和其他战略投资者参投，这笔资金将用于帮助 Imagia 加速公司第一代平面硅基光学透镜的开发和初始商业部署。Imagia 由斯坦福大学博士工程师 Greg Kress 创立，由光学物理学家和材料科学工程师团队领导，旨在通过其正在申请专利的超透镜技术，以及使用专有的硅基光学材料和最先进的光刻工具，重塑下一代高性能光电子器件。 Imagia 表示，其超透镜技术可以将整个光学组件缩小为平面的晶圆薄器件，从而大幅降低光学组件的尺寸和复杂性。根据 Imagia 的说法，通过使用正在申请专利的方法，该公司的技术可以直接在各种基板上精确地图案化纳米级结构，从而创建完全扁平的超透镜，通过设计引导光波，而无需传统的曲面透镜。这些透镜可以是方形或圆形，并且可以做得像数字显示器上的单个像素那么小。 Imagia 指出，由于传统体光学器件的限制和局限性，AR/VR头显等复杂光电产品的制造商一直不得不在人体工程学形式和光学功能之间做出权衡。根据 Imagia 的说法，这些限制不再适用于超透镜，这为制造商提供了更大的光学设计灵活性，以实现更高性能的产品，同时减小尺寸、重量和复杂性。该公司还声称其方法允许全新的设备架构，其超透镜可以在同一制造流程中直接构建在 CMOS 器件（如 LED 和图像传感器）的顶部，从而消除了光学机械对准的几个关键步骤。Imagia 公司首席执行官 Greg Kress 表示：“超材料是我们操纵光线方式的真正范式转变，类似于从模拟到数字计算的转变，传统的玻璃镜片已经存在了数百年。使用这些类型透镜的固有限制导致复杂、笨重的光学组件，并且需要精确的机械对准。Imagia 通过制造集成电路等透镜改变了这种方法，这直到最近才成为可能。” 我的评价就是：Another one 官网 丹麦政府阻止向滨松出售NKT Photonics评论：去年6月24日，日本滨松光子（Hamamatsu Photonics）宣布将以2.05亿欧元（折合人民币17.62亿元）的价格战略收购丹麦光纤激光器制造商NKT Photonics，事件一度成为焦点。当时，滨松表示将通过其位于比利时的全资子公司Photonics Management Europe SRL完成此次收购，预计最迟在2023年第一季度末完成全部收购。最新消息显示，根据丹麦投资审查法案，将NKT Photonics出售给滨松全资子公司Photonics Management Europe SRL的交易已被拒绝，收购就此搁浅。根据《丹麦投资审查法案》（Danish Investment Screening Act），外企对丹麦投资交易中（比如像此次收购NKT Photonics），如若对国家安全或公共秩序构成威胁的，丹麦工业、商业和金融部长可以拒绝批准。 成立于1953年的日本滨松光子学株式会社，是世界上科技水平最高、市场占有率最大的光科学、光产业公司，目前在全球拥有5300多名员工，年收入近12亿欧元。NKT Photonics公司成立于2009年，主要产品包括超连续介质白光激光器、单频光纤激光器、超快光纤激光器等。其2023年第一季度的初步财务数据显示，公司今年开局强劲，收入大幅增长达到了4.22亿欧元（去年同期3.19亿欧元）。 此前交易如果顺利完成，NKT Photonics将成为滨松的子公司。去年的收购声明中曾提到，滨松光子专注于基于复合半导体制造技术的激光二极管业务，并与NKT Photonics在光纤激光器方面长的专之间形成紧密互补，双方期待在应用领域实现进一步拓展。随着未来激光应用业务的拓展，NKT Photonics的产品阵容将占据重要地位，特别是光纤激光器——其体积小、重量轻，是目前最具吸引力的激光技术。 各国都开始护着自己的高技术公司了。 NKT Photonics官网 美国雷声公司新推出“雷文”（RAIVEN）新一代光电智能传感系统评论：2023年4月，美国雷声公司新推出“雷文”（RAIVEN）新一代光电智能传感系统。该系统采用高光谱、激光雷达和人工智能等先进技术，使部队能够在复杂多域作战环境中更有效地实施目标定位、战场空间感知，作用距离更远，反应速度更快，将大幅提升美军遂行多域作战的能力。 与多光谱瞄准系统等光电综合系统相比，“雷文”光电智能传感系统具有以下5个显著的技战术优势： 一是首次在类似系统增加超光谱传感器，大幅提升反伪装、反隐蔽、反欺骗能力。“雷文”系统首次集成了超光谱传感器和激光雷达，因此不仅能够利用传统的辐射探测手段，还可以利用光谱含量进行探测。据称这是首次在单个光电综合系统中实现这种能力。 二是探测、识别和辨认距离等关键性能指标大幅提升，大幅提升平台战场生存能力。除传统的各种光电探测手段和超光谱成像技术外，“雷文”光电智能传感系统还集成了激光雷达，能够在超远距离快速探测目标，其对目标的探测、识别和确认范围是现有光学成像能力的5倍，有效提升平台和作战人员的战场生存能力。 三是采用人工智能赋能，提升作战的自动化水平。“雷文”光电智能传感系统还采用了人工智能技术，可以将大量数据整合成分辨率更高的图像，更好地实现战场态势感知。特别是人工智能技术可以自动检测和识别威胁，在一定程度实现自动化，减少操作员认知负担的同时，提升决策和行动的效率。 四是采用开放式架构，适装性强。“雷文”光电智能传感系统采用了开放式架构、通用标准和通用部件，可实现组件的无缝更换、升级和更新。该系统具备集成至转塔、电子侦察吊舱和其他嵌入式系统的能力，适用于机载、地面和海上等多种作战平台。 五是多任务能力强，可满足多域作战的需求。“雷文”光电智能传感系统可用于遂行近距离“点对点”作战、人道主义/搜索和救援、巡逻侦察、护航、强干扰、地面防空引导等任务，提升美军多域作战能力。 很会起名字（RAVEN加了个AI，变成RAIVEN），很会做广告。 产品页 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"光学新闻 20230401","slug":"OpticsNews20230401","date":"2023-04-01T14:00:00.000Z","updated":"2023-04-01T13:31:20.414Z","comments":true,"path":"OpticsNews20230401/","link":"","permalink":"https://faster-than-light.net/OpticsNews20230401/","excerpt":"近几周的五篇光学新闻： 索尼发布dToF SPAD深度传感器IMX611，提供高光子检测效率 — 华为发布P60系列— 蔡司宣布收购tooz全部股份— Avicena宣布与ams OSRAM达成合作— 苹果新专利：用户佩戴太阳镜也可看清 iPhone 屏幕内容—","text":"近几周的五篇光学新闻： 索尼发布dToF SPAD深度传感器IMX611，提供高光子检测效率 — 华为发布P60系列— 蔡司宣布收购tooz全部股份— Avicena宣布与ams OSRAM达成合作— 苹果新专利：用户佩戴太阳镜也可看清 iPhone 屏幕内容— 索尼发布dToF SPAD深度传感器IMX611，提供高光子检测效率评论：索尼日前发布了一款用于智能手机的直接飞行时间（dToF）SPAD深度传感器IMX611。这家公司宣称，它可提供业界最高的光子检测效率，达到28%。据介绍，这主要得益于其专有的SPAD像素结构，不仅降低了整个系统的功耗，同时实现了对象距离的高精度测量。 这款传感器的相比Sony之前的dTOF传感器并没有增加pixel，可以参考的是iPhone 14 Pro/Max 使用的LiDAR 是 0.3MP, 10 µm pixel size。这款IMX611主打的更多是芯片尺寸的小型化，和功耗优势。 IMX611 Sony官网 华为发布P60系列评论：华为3月发布了P60系列，宣传词是“万境生辉”，这次真的主打影像部分。首先所有三颗镜头上了RYYB芯片，主摄继续用了去年Mate 50用的可变光圈。长焦主打夜视长焦，F2.1，再加上传感器位移防抖。对比起几年前的n多颗镜头，有一个收的感觉，而且P系列以前感觉不会上这么好的物料，这次也是诚意满满。今年手机市场本来就是个小年，而且摄像头方面的变化是越来越慢，各家终于坚持自己的品味，开始根据自己思路去做影像，这更回归了摄影的本来面貌。OPPO三月也发布了FIND X6 Pro，网文有写“忘掉「主摄」，隐去「算法」，让三颗镜头给出不同涵盖的 15-144mm 的焦段，每一个焦段都可用，且有着几乎一致的色彩表达与光影呈现。” Huawei P60 官网页 蔡司宣布收购tooz全部股份评论：3月8日，德国蔡司集团宣布收购AR眼镜公司tooz的全部股份，收购完成后tooz将加入蔡司，成为该公司的AR/VR开发中心，独立推动AR和光学产品的开发和集成。据悉，tooz本身就为蔡司与德国电信合资组建，原本蔡司和德国电信的股份各占50%，现在蔡司收购了德国电信的股份，因此成为tooz唯一所有者(100%股份)。蔡司称收购tooz的原因，是因为看到了AR/VR眼镜市场的巨大增长潜力。tooz拥有AR光学设计、工程和制造等方面的能力和技术，这很好的补充了蔡司现有的能力。 tooz现在的主要方案是一个侧面发射的折返式的光波导，通过注塑成型和胶合实现。可以很接近眼镜的形态，但是FOV比较小。 官网 Avicena宣布与ams OSRAM达成合作评论：Avicena宣布与ams OSRAM达成合作，以量产应用于LightBundle™通信架构技术的GaN Micro LED阵列。Avicena表示，由于ChatGPT、DALL-E、自动驾驶汽车训练等人工智能、高性能计算软件与应用需求不断提升，带动对下一代计算能力的需求也在持续提高。而Avicena的LightBundle™链路架构技术，能够释放xPU、内存和传感器的性能，提高电脑性能，从而满足人工智能等高算力软件与应用场景的需求。具体来看，Avicena的LightBundle™链路架构是基于密集排列的GaN基Micro LED所创建的高度平行光学互连技术，可集成在所有高性能的CMOS集成电路上，具备高带宽密度和能源效率。LightBundle™链路技术方案消除了传统铜链路存在的问题，包括高功耗、延迟，底覆盖范围和带宽密度等，加速了计算内存芯片间的互连，从而显着提高了现有系统性能，是新网络和计算架构发展的关键组成。LightBundle™链路技术应用场景涵盖高性能计算系统（HPC）、人工智能（AI）/机器学习（ML）和分离式内存芯片间的互连、传感器、5G无线及航空航天等下一代链路领域。对于本次合作的达成， ams OSRAM表示，Avicena的LightBundle架构技术为GaN Micro LED提供了更多应用机会，包括高性能计算系统（HPC）、人工智能（AI）/机器学习（ML）、传感器、汽车和航空航天领域，公司将与Avicena共同改变这些庞大且重要的市场。Avicena则表示，尽管此前公司完成了对Nanosys的GaN Micro LED工厂的收购，以加快LightBundle™链路架构开发工作并支持小批量样品制造，但公司所面对的庞大市场，对相关产品有着大批量制造的需求。因此Avicena与ams OSRAM达成合作，以满足来自超大规模数据中心运营商和世界领先的IC公司等客户的高产量需求。据悉，为应对市场对LightBundle™链路架构技术的需求，Avicena正在持续提高Micro LED阵列的批量生产能力。除了本次与ams OSRAM达成合作外，在2022年，Avicena就已与LED企业Lumileds合作提高Micro LED阵列的产量。在同年10月，Avicena完成了对量子点发光材料和技术供应商Nanosys的GaN基Micro LED制造工厂及相关工程团队的收购，提升在Micro LED外延、器件生产工艺及转移技术，进而满足市场对LightBundle™链路架构技术的需求。 LightBundle™工作原理如下图所示，这么看这就是“光纤入户”啊。 Avicena官网 苹果新专利：用户佩戴太阳镜也可看清 iPhone 屏幕内容评论：根据美国商标和专利局（USPTO）公示的清单，苹果获得了编号为 US 11611058 B2、名为“使用屏下图像传感器的设备和系统”专利。这项专利最值得关注的一点就是，允许用户在佩戴太阳镜的情况下，也能清晰地看清 iPhone 屏幕显示内容。并没有找到专利全文，看起来应该是在屏幕上再有一个可控的偏振元件可以去动态调整显示屏出光的偏振态。 新闻 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"光学新闻 20230305","slug":"OpticsNews20230305","date":"2023-03-05T15:00:00.000Z","updated":"2023-03-05T14:09:16.383Z","comments":true,"path":"OpticsNews20230305/","link":"","permalink":"https://faster-than-light.net/OpticsNews20230305/","excerpt":"近几周的五篇光学新闻： 全息显示Light Field Lab完成5000万美元B轮融资 — MIT发明垂直堆叠MicroLEDs，像素密度高达5千PPI— 小米无线AR眼镜— 我国科学家研制出“微型化三光子显微镜”并首次实现“深脑成像”— 突破光学超构表面偏振复用容量极限—","text":"近几周的五篇光学新闻： 全息显示Light Field Lab完成5000万美元B轮融资 — MIT发明垂直堆叠MicroLEDs，像素密度高达5千PPI— 小米无线AR眼镜— 我国科学家研制出“微型化三光子显微镜”并首次实现“深脑成像”— 突破光学超构表面偏振复用容量极限— 全息显示Light Field Lab完成5000万美元B轮融资评论：SolidLight全息显示平台背后的开发商Light Field Lab日前宣布，已完成由NCSOFT领投的5000万美元B轮融资。同时，新投资者康宁、比尔·盖茨旗下风投机构Gates Frontier、LG Tech Ventures和OTOY，以及原有投资者Khosla Ventures、三星、Verizon、博世、Forvia、Liberty Global、以及台杉投资等同样有份参投。 Light Field Lab宣称，SolidLight是有史以来最高分辨率的全息显示平台，可以实现无需头显的裸眼3D全息效果。这个硬件具有自发光无边框面板，可组装成模块化全息视频墙，并为广泛的下一代体验提供了交钥匙系统解决方案。 看该公司提供的原理介绍，整个显示平台分为三个模块，High Performance Proprietary FPGA, Electronics, Wall &amp; Display Controllers; Photonics Array &amp; Nanoparticle Polymer Fused Surface Energy Relay; Complex Phaseguide Modulation Surface. 虽然名字很花哨，但可能系统的基本原理依然是柱镜光栅的某种变体。未来可以观察一下网上的测评或者实际产品后再最终判断。 该公司获得这么不错的投资的主要原因可能还是因为系统做的好，有比较好的整体解决方案可以很快推向市场。 Light Field Lab官网 MIT发明垂直堆叠MicroLEDs，像素密度高达5千PPI评论：MIT的研究人员通过一种新颖的超薄薄膜制造工艺制作了一种垂直堆叠的红色、蓝色和绿色像素显示器，而这可能会令像素密度提高一个数量级，从而帮助虚拟现实实现与现实世界别无二致的视觉效果。 之前有相关论文实现了垂直层叠LED，从上到下进行制造，但是很难缩小其横向距离。该研究使用新的方法，实现了最高5100pixel/inch的像素密度，最小像素点大小4um的层叠全彩MicroLED显示，最高叠合厚度9um。在Jeehwan Kim教授的领导下，科学家们开发了一种技术，首先将超薄的红色、绿色和蓝色LED膜一个一个地堆叠在一起，形成一个类似于慕斯蛋糕的排列。然后，这个“蛋糕”被精细地切成网格状，将其分割成许多独立的像素–每个像素只有4微米宽。在实验室测试中，通过改变应用于一个这样的像素中的每个微型LED的电压，研究人员能够产生彩虹般的颜色，就像OLED像素所能产生的那样。然而，人们可能会问，难道堆栈顶部的蓝色微型LED不总是显示得最多，而底部的红色微型LED总是显示得最少？研究报告的共同作者Jiho Shin解释说：“LED发出的光的颜色（能量）取决于LED的带隙–蓝色LED的带隙最宽（因此蓝光的能量最高），红色LED的带隙最小（能量最低）。”一种材料不会吸收能量小于带隙的光（光子），因此红光和绿光将穿透蓝色LED层而不被吸收，这就是为什么我们按照R（底部）、G（中部）、B（顶部）的顺序垂直堆叠这些层。目前该研究团队正在研究可同时控制数百万个 Micro LED 像素的方法，研究人员透露“有源矩阵”（active matrix）将是需进一步开发的东西。 论文 小米无线AR眼镜评论：小米在 MWC 2023 世界移动通信大会上正式发布了小米无线 AR 眼镜探索版。小米无线 AR 眼镜探索版配有一对 Micro-OLED 屏幕，支持 1200 尼特亮度，提供全高清 FHD 视觉效果。光学显示方案上是自由曲面Bird Bath方案，还配备了一个电致变色镜片，来自于伯宇科技。眼镜前面有三个前向摄像头，用于绘制佩戴者正前方的环境和手势识别。眼镜搭载高通骁龙 XR2 Gen 1 芯片，没有板载存储，因此必须连接到主机设备（测试使用小米 13）。眼镜是完全无线的，通过小米的“专有低延迟通信链路”（WiFi 和蓝牙的组合）连接到智能手机，小米宣传的延迟仅为 50 毫秒，XDA 测试体验确实延迟非常低，包括刷了 20 分钟视频，延迟几乎感觉不到，画质也没有下降。 新闻稿 我国科学家研制出“微型化三光子显微镜”并首次实现“深脑成像”评论：我国科学家研制出一款重量仅为2.17克的“微型化三光子显微镜”，首次实现了小鼠的“深脑成像”。该技术可以在室内温度条件下以四分之一的照明条件和极低的照明强度，实现对活着小鼠的细胞结构和生物机制活动的实时监测和定量分析。这项技术可以实现立体化图像，可以清晰地观测到小鼠大脑内不同层次的活动，并且可以在不进行其他技术干预（包括作侵入处理）的情况下持续观察。同时，微型化三光子显微镜也可以采集小脑活动数据，实现对单个神经元的运动模式、网络构建及其变化过程的定量分析，帮助研究者深入认识大脑神经网络构建及其动态变化特征。未来，这项技术也可以用于帮助研究新药物调节神经电发放的调控作用。由于可以对小鼠大脑的活动有精细的观察，及时发现大脑疾病的发生，所以这种微型化三光子显微镜对于脑科学等研究有重要意义。此外，它还可以在病理学、药物研发、基因检测以及神经网络的应用方面发挥积极作用。它的出现可以使脑科学的研究有了很大的提升，也可以促进脑病的研究和治疗。此外，这种微型化三光子显微镜技术还可以被应用到神经调节技术方面，比如用于精准外科等领域。它可以用来监测活体动物情绪变化，以及运动和行为学分析，这种诊断精度比传统技术更高。此外，它还可以用来监测细胞结构及其中的生物化学变化，这对于研究的精准诊断和治疗有重要的指导意见。 论文 突破光学超构表面偏振复用容量极限评论：南京大学物理学院彭茹雯教授、王牧教授研究组联合美国东北大学刘咏民教授研究组，创新性地引入光学响应噪声调控，成功突破光学超构表面偏振复用的容量极限，为发展高容量光学显示、信息加密、数据存储提供新范式。他们的研究论文”Breaking the limitation of polarization multiplexing in optical metasurfaces with engineered noise” 近日发表于国际学术期刊《Science》上。偏振是光的基本性质，在信号传输、传感探测等方面起着重要的作用，被广泛应用于光子学和信息技术的多个领域。比如光的偏振可应用于大容量的复用技术，将信息通过多个独立通道传递到预定目标。随着光学器件的小型化，人们发现在诸如光学超构表面的二维平面系统中，二阶琼斯矩阵能够完整刻画偏振光与其相互作用，从而该体系最多只有3个独立偏振通道，造成偏振复用存在内禀的容量极限。近年来尽管基于机器学习和迭代优化等逆向设计方案很好地优化了偏振复用技术，但是，3个独立偏振通道的容量极限始终存在。打破该物理上限对于发展高容量的光学显示、信息加密、数据存储等应用至关重要。最近，南京大学彭茹雯和王牧研究组与美国东北大学刘咏民研究组联合，创新性地将精心设计的光学响应噪声引入琼斯矩阵方案中，突破超构表面偏振复用容量的物理极限，理论演绎并实验证实利用单一超构表面成功获得高达11个独立偏振通道，该超构表面在不同偏振的单色可见光照射下可观测到11种独立的全息图像。该研究结果为目前光学超构表面偏振复用的最高容量。基于该理论策略，研究团队又进一步证实这种新型的偏振复用技术能够与其它复用技术（比如空间复用，角动量复用等）相融合，并实验展示单一超构表面（样品大小仅 0.33mm × 0.33mm）能够产生36种独立的全息图像，形成包含26个英文字母和10个数字的全息键盘图案。该研究为发展亚波长尺度下高容量光学显示、信息加密、数据存储提供新思路，在光通信和互联、光计算、光传感与探测、增强现实和虚拟现实（AR/VR）技术等领域具有广阔的应用前景。 论文 新闻 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"光学新闻 20230201","slug":"OpticsNews20230201","date":"2023-02-01T15:00:00.000Z","updated":"2023-02-01T15:05:08.196Z","comments":true,"path":"OpticsNews20230201/","link":"","permalink":"https://faster-than-light.net/OpticsNews20230201/","excerpt":"近几周的六篇光学新闻： Meta Materials的透明微波炉门 — Mojo Vision重大危机，裁员75％— Apple Pencil 3将搭载色彩识取相机— 洛克希德·马丁公司成功演示50kW级激光武器，将交付美国陆军— 308nm光纤紫外激光器已交付美国宇航局 将用于大气测量— TRUMPF和RSP System共同开发腕戴式无创血糖监测设备","text":"近几周的六篇光学新闻： Meta Materials的透明微波炉门 — Mojo Vision重大危机，裁员75％— Apple Pencil 3将搭载色彩识取相机— 洛克希德·马丁公司成功演示50kW级激光武器，将交付美国陆军— 308nm光纤紫外激光器已交付美国宇航局 将用于大气测量— TRUMPF和RSP System共同开发腕戴式无创血糖监测设备 Meta Materials的透明微波炉门评论：CES 2023上Meta Material Inc.公司展示了其开发的透明微波炉门，这种透明微波炉门使用了一种可以反射微波，但同时可以通过可见光波的超材料结构。同样的基本技术可以在窗户中用作EMI屏蔽，以防止电子窃听。使用不同的超材料薄膜，窗户可以将无线电波引入建筑物。Meta Materials同时展示了在眼镜镜片中放置透明天线。超材料的另一个用途是室外摄像头、汽车前照灯、汽车尾灯和刹车灯的透明加热器。本质上，通过对超材料进行编程，它们可以将其调谐到电磁频谱的不同波长。Meta Materials声称，与当前的细导线和基于ITO的电极阵列相比，他们“可调谐”的导电超材料具有对比优势。它将PPG Aerospace的电致变色凝胶与Meta Materials的AR Fusion透镜和超材料相结合，从而控制和增强响应。值得一提的是，对于PPG的电致变色凝胶，其最著名的应用是波音787电动调光窗。 Meta Material Inc Mojo Vision重大危机，裁员75％评论：Mojo日前宣布，由于全球经济放缓，资本市场极度紧张，以及先进AR产品尚未证明市场潜力，公司在融资方面遭遇了困难。所以，团队无法继续研发Mojo Lens，并决定裁员75%。接下来，Mojo将专注于研发Micro-LED技术。 这个blog里写过三次Mojo Vision的新闻：2021年8月该公司展示微显示器原型Mojo Lens，2022年4月发布了全新的Mojo Lens原型，并表示这是“世界首款真正的智能隐形眼镜”，2022年7月宣布Mojo Lens隐形眼镜首次成功入眼试戴，其中每次都有疑点。没想到该公司凉的这么快，该公司之前的故事是进行AR隐形眼镜的系统开发，如果如其所说转入专注开发Micro-LED，其又没什么Micro-LED的独门技术。最后的结局要么是破产要么是被哪家公司收购。 官网通告 Apple Pencil 3将搭载色彩识取相机评论：据传apple 将在下一代pencil的笔尖上集成一个微型相机，用来在任何物体表面提取颜色。原理上如下图所示，使用一个可调谐波长的发射器和一个接收器或者接收器本身有多颜色通道。同时有一个惯性传感器来辅助测量apple pencil相对被测平面的角度，同时该设备可能还可以测量被测表面的纹理。专利号US 20220413636 A1. 还没有具体看专利，看原理图如果用两个导光柱的话，效果图肯定不会是前面这个图的样子，基本上就是两个小孔就好了，可能会非常隐蔽。我更倾向于认为测量光谱的部分交个一个hyperspectral的传感器，现阶段这种传感器的发展已经有了长足的进展，不过以apple对于产品性能的把控，可能发射端会放几个发射端，可能是窄带的三色VCSEL用来进行校准。 Patently Apple对该专利的介绍 洛克希德·马丁公司成功演示50kW级激光武器，将交付美国陆军评论：本周，美国军防巨头——洛克希德·马丁公司宣布，其机动近程防空系统定向能拦截器（Directed Energy Interceptor for Maneuver Short-Range Air Defense System, DEIMOS）系统成功试射，此次被称之为“第一束光”（first light）的里程碑验证了该高能武器的激光光学性能参数与系统设计参数一致。据介绍，50千瓦级的DEIMOS系统是一种加固强化型的战术激光武器系统，可以集成到美国陆军的Stryker战斗车辆中，为美国陆军具有挑战性的机动－近程防空（M－SHORAD）任务提供强大的定向能能力。 该系统使用Spectral Beam Combination (SBC)架构，如下图所示，洛马的SBC系统的功率可以持续增强并保证很好的光纤激光器的光束质量。 有趣的是该系统的名字：得摩斯（Δειμος / Deimos，“恐怖”）是希腊神话中象征恐怖的神，战神阿瑞斯和阿芙罗狄忒之子，火卫二。50kW的激光，是很恐怖了。 新闻 308nm光纤紫外激光器已交付美国宇航局 将用于大气测量评论：1月9日，美国光纤激光器领先制造商AdValue Photonics宣布向美国宇航局（NASA）旗下的戈达德太空飞行中心交付了单频308纳米光纤的高功率紫外（UV）激光器，用于大气测量。 据介绍，该波长可实现快速吸收和精确效果，在医疗、工业和科学领域获得了广泛的应用。公开声明中称，AdValue Photonics 308 nm单频激光器是首个能够发射3W平均功率与衍射限制光束的全固态版本激光器，这些特性使全球各地的大气传感系统以及皮肤科诊所和电子工厂能够可靠、高性能地运行。AdValue Photonics首席执行官Michael Mielke博士表示：“基于光纤的308纳米激光器是激光大气测量应用场景中的一个拐点，之前的技术通常需要借助有毒化学激光器，才能在该波长产生高功率的效果。而新的激光器设计提供了这种高效的光形式，且不存在之前准分子激光器固有的安全性、耗材和高拥有成本等方面的挑战。” 308纳米激光通常由氙－氯（XeCl）准分子激光器产生。在过去的几十年中，准分子激光技术的进步提高了其可靠性，但由于其有毒气体（卤素）组成、运行所需的高压电源以及高昂的拥有成本（气体消耗和组件磨损），这类激光器本身仍然存在着非常大的缺陷。相比之下，光纤激光器结构则充分实现了全固态（无气体）、工作电压低、电光转化效率／功率转换效率高等优势特点。 从全光纤激光器系统中获得足够高的单脉冲能量和峰值功率是非常关键的一点。最近，该公司已成功展示了采用类似技术的深紫外（DUV）光谱257 nm激光器。另外，AdValue Photonics正在进一步开发更高功率的308 nm激光器，其外形尺寸专门用于医疗和遥感应用。AdValue Photonics专注于光纤激光器技术组合，包括红外、可见光和此次的紫外激光器，其峰值性能超出了传统限制。 AdValue Photonics AdValue Photonics公司成立于2007年，位于美国亚利桑那州图森市，以提供基于创新技术的开创性产品而闻名，并致力于成为高质量、创新、高性价比的光纤激光器、光纤放大器、光纤宽带光源和器件的领先开发商和制造商。作为全球知名的光纤激光器制造商，其2μm光纤激光器利用掺Tm光纤实现了多脉冲宽度和多光谱宽度的高输出功率，产品广泛应用于科学、材料加工和医疗市场。AdValue Photonics创新技术的核心是其定制玻璃和光纤的设计和生产能力，能够通过调整玻璃成分、掺杂浓度和光纤几何形状来优化激光器的性能和可靠性，并且能够快速定制激光解决方案以满足客户的严格要求。 AdValue Photonics TRUMPF和RSP System共同开发腕戴式无创血糖监测设备德国激光公司 Trumpf和丹麦医疗设备公司RSP Systems 共同合作进行可穿戴血糖仪的研究，希望基于RSP公司的非接触血液监测技术开发可穿戴平台。Trumpf公司负责提供可以满足需求的小型化激光光源。近些年有非常多的研究致力于进行血糖的光学测量，RSP公司的非接触式设备GlucoBeam的核心是一个共焦拉曼光谱仪，使用830nm光源，并使用AI进行数据处理。该设备还有一本书的大小，两公司致力于使用VCSEL光源和其他努力将其集成到可穿戴系统上。下图展示了GlucoBeam设备和一个共焦拉曼光谱系统。 新闻 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"光学新闻 20230108","slug":"OpticsNews20230108","date":"2023-01-08T07:00:00.000Z","updated":"2023-01-08T05:44:41.780Z","comments":true,"path":"OpticsNews20230108/","link":"","permalink":"https://faster-than-light.net/OpticsNews20230108/","excerpt":"近几周的五篇光学新闻： OPPO Air Glass 2 双目智能眼镜发布 — 鲲游光电2022年度产品发布— Lumus发布第二代Z-Lens 2D波导架构— 长春光机所研制的“夸父一号”（ASO-S）卫星太阳莱曼阿尔法望远镜全日面首图发布— 哥伦比亚大学开发“指尖大小”UV-IR激光器","text":"近几周的五篇光学新闻： OPPO Air Glass 2 双目智能眼镜发布 — 鲲游光电2022年度产品发布— Lumus发布第二代Z-Lens 2D波导架构— 长春光机所研制的“夸父一号”（ASO-S）卫星太阳莱曼阿尔法望远镜全日面首图发布— 哥伦比亚大学开发“指尖大小”UV-IR激光器 OPPO Air Glass 2 双目智能眼镜发布评论：2021年末的时候，OPPO发布了Air Glass 1，当时文章有写，当时我的评论是“OPPO三年搞了三款AR眼镜，2019年做一体式双目，2020年做了birdbath方案的分体式，这次2021年直接搞了个光波导单色单眼分体式，可能OPPO就是想市场上占据一个生态位，熟悉一下光波导方案的开发，支持一下光波导制造商，培养自己的供应商，保证自己的这个team有活干。”。 今年OPPO发布了Air Glass 2，双目智能眼镜，可以说往前又走了一步，单目变双目，使用的是树脂衍射光波导镜片，重量 38g，搭载的 Spark 微型光机体积比上一代减小了 40%，可定制平光、近视和墨镜三种款式，能进行提词/语音翻译、导航/提醒和语音转文字功能，可以帮助听障人士更高效地进行日常交流。 首先，这还是智能眼镜，OPPO自己也没好意思说自己是AR眼镜，其实现今的条件下，要塞下AR眼镜需要的基础硬件，需要的成本和重量还是不符合OPPO自己的产品理念。第二，OPPO Air Glass 2所采用的近眼显示系统是由新锐创业公司莫界科技提供。有些新闻稿里写的：“相较于行业普遍使用的玻璃晶圆基衍射光波导镜片，莫界突破性地解决了树脂晶圆技术难题，使得光波导减重50%以上，助力OPPO Air Glass 2 顺利突破行业重量天花板。”掩饰了一些问题，就是光波导的FOV和基底材料的折射率强相关，如果使用树脂材料，FOV会受到一定限制。反而莫界科技自己接受采访的时候讲的比较中肯：在莫界看来，业界在用半导体领域的标准来要求波导片，但实际上AR眼镜要求并不需要这么高的标准。而对于影响 FOV 参数的折射率，目前树脂材质普遍折射率约1.74，玻璃材质最高可实现 2.0，仍有一定差距。“目前基于树脂的折射率，眼镜可以实现 40 度 FOV 。事实上，我们也在和原材料厂商进行探讨，从设计和材料出发，将树脂的折射率提升，从而实现更高的FOV。”对于OPPO这款产品来说，FOV小一些，价格便宜一些没什么问题。 现在我反而有点儿期待明年OPPO这个team会做出什么产品了，每次前进一步，挺好的。 OPPO未来科技大会2022 鲲游光电2022年度产品发布评论：鲲游光电发布2022产品，产品矩阵覆盖多种应用场景和价格区间，下面展示了产品矩阵和具体产品列表。根据公司介绍：“鲲游AR光波导序列目前已建成了完备的闭环，接受以上系列的全面定制，并且可以基于公司自有打造的国际一流的晶圆级光学IDM闭环，按照客户要求，对特定指标、成本等进行针对性、高速的全端到端的优化。目前鲲游的AR光波导序列已成功导入包括美国前三大互联网公司之一、多家中国一线终端、一线互联网公司、AR领域整机独角兽等众多知名客户。” 官网 Lumus发布第二代Z-Lens 2D波导架构评论：波导厂商Lumus日前在CES 2023大会发布了第二代Z-Lens 2D波导架构。这个架构基于2D Maximus，可帮助开发出更小、更轻、高分辨率图像质量、室外兼容亮度的AR眼镜。Lumus的新型Z-Lens波导架构保持了Maximus的卓越图像质量和高亮度效率优势，但其光学引擎的体积要小50%。新的结构同时为眼镜厂商提供了更多的灵活性，可以令眼镜形态的AR光学系统更加紧凑，减轻了重量和体积。Z-Lens的新型轻质光学引擎具有2K x 2K分辨率，以及饱满和鲜艳的色彩，可提供卓越的图像质量。在3000尼特/瓦的亮度下，消费者将能够在日光下享受增强现实。Lumus的Z-Lens架构同时允许Rx镜片直接粘合。这允许消费者根据自己的视力参数定制AR眼镜，无需采用笨重的插入配件。以所述方式，用户可以将其用作普通眼镜。 看起来更多的是光机和系统的优化，光波导部分依然基于Maximus的架构，看起来阵列式光波导部分的进一步提升有难度。 从现阶段各种光波导的发展来看和近期的一些新闻来看，头部公司中，基本的问题已经得到了回答，各家公司更多的在进行一些系统优化和产品优化，而且这种优化时非常有必要的，而且花费的时间也会非常长。举一个例子，杂散光的优化，经常需要多代的产品优化。 对于中国的公司来说，基础理解和技术上还要继续追赶。 新闻稿 长春光机所研制的“夸父一号”（ASO-S）卫星太阳莱曼阿尔法望远镜全日面首图发布评论：2022年10月9日，我国第一台莱曼阿尔法太阳望远镜（LST）随“夸父一号”卫星发射入轨。完成了初步在轨调试，获取了我国首幅莱曼阿尔法波段全日面图像和空间360nm波段全日面图像。两幅首图的获得，标志着我国空间莱曼阿尔法和360nm波段全日面观测零的突破，使得我国该波段太阳观测具有自主数据来源，还将向全球科学家开放数据，用于科学研究。 “夸父一号”卫星的科学目标为：观测太阳磁场、耀斑和日冕物质抛射，即“一磁两暴”。LST将为实现“一磁两暴”科学目标中的两暴研究提供重要科学数据，监测太阳耀斑和日珥，特别是日冕物质抛射的形成和近日面的传播，探索它们之间的内在联系和物理机制。中科院长春光机所牵头，联合紫金山天文台和西安光机所，历经四年半时间，攻克多项关键技术，研制出LST。它由莱曼阿尔法日冕仪（SCI）、日面成像仪（SDI）和白光望远镜(WST)组成，具有自主高精度稳像能力，可同时在121.6nm和700nm两个波段对日冕做高分辨率成像观测，监测1.1至2.5个太阳半径之间日冕变化；在121.6nm和360nm两个波段，对太阳做高精度全日面成像，观测耀斑和日珥等结构变化，观测太阳黑子的分布和演化过程。 查了下为什么要在极紫外做观测：“不同于较为恒定的太阳可见光辐射，太阳极紫外（EUV）辐射在高低年有可观变化，而后者正是影响地球热层大气和电离层状态的主要能量源。” 下图为莱曼阿尔法日面成像仪2022年10月29日拍到的121.6nm全日面首图，图中可以清晰看到耀斑和日珥分布。耀斑是太阳上两类最重要爆发现象之一，是太阳表面局部区域突然和大规模能量释放过程。日珥是日面边缘外的亮结构，日珥爆发通常与CME有内在关联，可以作为CME爆发的重要标识。面向地球传播的CME是造成空间天气事件和地磁暴的主要因素，严重影响近地空间环境，需要及时准确的预报和预警。长春光机所供图 下图展示了白光太阳望远镜2022年11月9日拍摄到我国第一幅空间360nm全日面图像，图像中的太阳黑子是太阳光球表面出现的暗区域，它是磁场聚集的地方。黑子往往成群出现，黑子群的结构和大小是太阳活动和爆发的关键因素，其观测可以研究和预报太阳爆发和活动。 新闻 哥伦比亚大学开发“指尖大小”UV-IR激光器评论：可调谐并且窄带的可见光激光光源有很多应用，包括量子光学，光学钟，原子/分子物理等。现阶段，这种激光都是台式的系统，很难在实验室外使用。哥伦比亚大学 Columbia Engineering’s Lipson Nanophotonics Group 实验室的研究者们，展示了一种片上大小的可见光激光平台，可调谐范围从近紫外到近红外，窄带。使用微米大小的SiN谐振腔和商业化的Fabry–Pérot激光器，该团队实现了最高12.5nm的调谐步长，最高33.9GHz的无跳频调谐。调谐速度最高可达267GHz每微秒，输入功率最高10mW，信噪比35dB。这些参数以前只能在大型的台式激光系统上实现。 “作为激光生产制造商，我们意识到集成光子学会对我们的工业产生巨大的影响，会催生出一系列现阶段无法实现的下一代应用。”Toptica的激光技术总监Chris Haimberger说道。“该工作代表着紧凑型可调谐可见光波段激光器的一步重大发展，将会极大退工未来在计算，医疗和工业的应用。”该研究团队已经针对该技术申请了专利，现阶段在研究如何对该系统进行光电封装以实现独立系统，然后使用它作为量子光学或者光学钟应用的光源模块。 论文 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"光学新闻 20221211","slug":"OpticsNews20221211","date":"2022-12-11T07:00:00.000Z","updated":"2023-01-08T03:12:50.373Z","comments":true,"path":"OpticsNews20221211/","link":"","permalink":"https://faster-than-light.net/OpticsNews20221211/","excerpt":"近几周的五篇光学新闻： 坚果N1 Pro投影仪 — HUAWEI Vision Glass发布— Ganvix和BlueGlass联合开发绿光VCSEL— 中国第一台空间太阳X射线-极紫外双波段成像仪— 用光调节心跳","text":"近几周的五篇光学新闻： 坚果N1 Pro投影仪 — HUAWEI Vision Glass发布— Ganvix和BlueGlass联合开发绿光VCSEL— 中国第一台空间太阳X射线-极紫外双波段成像仪— 用光调节心跳 坚果N1 Pro投影仪评论：12月9日，坚果发布了N1 Pro投影仪，首发6499元。坚果N1 Pro首创一体式云台投影外形，具有一体化支架，摆放自由，支持左右360°水平调节，135°仰角无极悬停。硬件上，其搭载了自研的MALC目氪三色激光光机，采用微结构动态激光控制技术，具有3200ANSI流明，10.7亿色彩，Delta E&lt;1。同时，坚果基于目氪三色激光机与徕卡展开及合作，该投影仪具有徕卡标准、徕卡鲜艳、徕卡炫彩三重色彩模式。配合LSR动态消散斑技术，大幅消除激光干涉所致的散斑问题。 作为投影仪，比较重要的部件上，光源是自研的MALC目氪三色激光光机，用了模组化激光堆叠技术，看宣传视频和宣传图，一共两组激光，每组配了4个红色激光器，2个蓝色，2个绿色。这个需要再看看专利确认，猜测可能的原因是为了提升光强和均匀性。为了匀光，该光机使用了400分区四层复眼匀光系统，采用微纳米级复眼器，画面均匀度超过95%，远超行业85%的平均水准。为了消散斑，目氪™光机搭载业内首创LSR动态自适应消散斑模组，可消除96%散斑，远超行业水平，堪称散斑消除“杀手级武器”。使用了四层DMD显示芯片选择了0.47”一套硬核技术组合拳下来，搭载目氪™光机的N1 系列画质迎来前所未有的大提升，对比度达到1600:1，均匀度达到95%，色域等效面积达到110% BT.2020。亮度上，N1 Pro为 3200 ANSI 流明，N1 Ultra为 4000 ANSI 流明。 在色彩调教上，坚果投影与徕卡光学色彩团队联手，为N1 系列量身打造三重色彩模型：徕卡炫彩、徕卡鲜艳和徕卡标准，用户可根据喜好自由选择，专业定制个性观影体验。 产品官网 HUAWEI Vision Glass发布评论：12月11日，华为在冬季全场景新品发布会上，华为首款智能观影眼镜HUAWEI Vision Glass正式发布。配置方面，这款眼镜采用BirdBath光学技术，视场角41°，Micro OLED 显示屏，等效 120 英寸虚拟巨幕，支持双目 1080p 全高清分辨率，480nit 的入眼亮度，可实现 90% 的 DCI-P3 色域，同时配备超薄大智慧扬声器、支持 0-500 度近视调节（500 屈光度可调），还通过了德国莱茵低蓝光认证。支持手机、平板、电脑数据线直连，即插即用。 搞个观影眼镜，不知道这个产品线会不会持续下去，还是会逐渐变成AR。 官网 Ganvix和BlueGlass联合开发绿光VCSEL评论：澳大利亚公司BlueGlas宣布和美国初创公司Ganvix合作进行GaN VCSEL的开发和商业化，目标是开发515nm~525nm的绿光VCSEL。Ganvix使用“Nanoporous”（纳米多孔）技术开发了可见光到UV波段的GaN VCSEL，该技术是由公司的联合创始人Jung Han在耶鲁大学开发的，而且只授权给了Ganvix。该技术可以生产高质量的无晶格缺陷和晶格失配的外延GaN VCSEL。该种技术降低了生成高反射，高质量的布拉格反射器（DBRs）的难度，尤其是成本上。对于绿光VCSEL，Ganvix的CEO John Fijol认为绿色VCSEL有高增长的市场，包括AR、VR头显，微投影和5G通信。基于合作条款，BlueGlass会提供外延服务，包括专利的远程离子化学气相沉积技术（RPCVD）来生长VCSEL的绿色量子阱。根据BlueGlass的信息，该技术是生成高性能绿色VCSEL的关键，包括功率和亮度。与此同时，Ganvix的Nanoporous技术用来生成VCSEL的DBRs。 在前期开发阶段，Ganvix会针对服务付款给BlueGlass，但是不需要对于原材料付款。BluGlass期待可以在商用化成功后，在订单上获得更多的销售。十月底，Ganvix和台湾工业技术研究院宣布合作。该公司也曾宣布成功证明了基于Napporous技术的蓝色VCSEL。该公司最终目标是大规模量产红绿蓝VCSEL的微阵列用于扩展现实，激光扫描，通信以及其他领域。 下图可以看到Ganvix的Nanoporous技术形成的DBR和传统红外VCSEL多层致密材料组成的DBR的不同。 新闻 中国第一台空间太阳X射线-极紫外双波段成像仪评论：太阳作为距离地球最近的恒星，其释放出的能量是地球能源的主要来源，对空间天气和高层大气变化有巨大的影响。太阳极紫外辐射覆盖约200万度以下的温度范围，该波段成像不仅对观测暗条爆发等低日冕现象有优势，而且对观测非耀斑产生的CME也具有独特优势。太阳X射线辐射覆盖约200万度以上的温度范围，其成像可观测活动区上方大尺度的冕环结构、耀斑及其前兆等高温等离子体活动。两个波段有效结合，可以更好的认识太阳爆发过程，为科学研究和空间天气预报提供准确的数据。 自上个世纪九十年代起，国际上先后发射了6台X射线望远镜和6台极紫外望远镜，分别在0.2nm-6.0nm的X射线波段和9.4nm-30.4nm的极紫外波段对太阳进行成像监测。原有的太阳望远镜都只有单一波段，要想在较大的波段范围监测太阳，监测太阳大范围温度变化，需要几台望远镜联合观测，开展科学研究和预报工作。 中科院长春光机所X射线和极紫外光学研究团队，首次采用了X射线和极紫外波段结合的设计方案，利用X射线掠入射光学系统中部空闲部分，安装一套EUV波段正入射成像光学系统。两套光学系统共光轴、共用同一个探测器，在几乎不增加X射线掠入射光学系统体积和重量基础上，由一台仪器实现对太阳X射线和极紫外两个波段高灵敏度成像，具体光学结构下图所示。 天文领域一个著名的X射线天文台是美国的钱德拉X射线天文台（Chandra X-ray Observatory，缩写为CXO），是美国宇航局（NASA）于1999年发射的一颗X射线天文卫星。下右图可以看到其X-ray的光路。钱德拉X射线天文台属于4颗大型轨道天文台计划中的一颗，其他3颗为哈勃空间望远镜，康普顿伽玛射线天文台和斯皮策空间望远镜。 新闻 用光调节心跳评论：人的心脏每天跳动约100000次，心脏将血液输送到全身。它跳动着一种规律的节奏，这种节奏会随着身体的活动而变化。每次心跳都始于电脉冲，异常的电信号会导致异常的心跳，称为心律失常。据估计，世界上多达 5% 的人患有心律失常。心律失常可以通过药物治疗，但在更严重的情况下，需要使用心脏起搏器等设备来控制心率。传统的心脏起搏器是一种植入于体内的电子治疗仪器，脉冲发生器发放由电池提供能量的电脉冲，通过导线电极的传导，刺激电极所接触的心肌，使心脏舒张和收缩，从而达到治疗由于某些心律失常所致的心脏功能障碍的目的。然而，电刺激方式一方面由于需要的能量十分大才可以有效地实现心脏的刺激，十分容易造成刺激部位受损从而引起二次手术；另一方面这种刺激方式细胞特异性是十分低的，也就是说没有办法精准地只对需要电刺激的心肌细胞作用，而是会辐射到疼痛感受等其他区域，导致患者的极度不适。因此需要使用新的技术工程手段来替代这种对于患者而言痛苦的电刺激。 利用光遗传学实现光学起搏器是电子起搏器一种有效的替代方案。光遗传学技术可以治疗对光敏感的细胞（通常是神经元），它利用光来影响这些细胞的行为。针对于起搏器来说，需要利用光来触发心肌细胞的收缩并构成心脏的跳动，这种方式是无感的；同时比较高的特异性可以让起搏器根据不同的疾病类型产生不同的反应，具有很高的灵活度与疾病适应性。亚利桑那大学，乔治华盛顿大学以及西北大学的工程师们提出了新型的无线、完全植入式的光遗传心脏起搏器，用于检测并无痛纠正不规则心跳。它通过用发光的“花瓣”包裹心脏来实现。不同于传统的起搏器，因为使用9个LED组成光遗传调控阵列的方法，可以使用不同的控制策略来提供特定和精心设计的光脉冲来治疗各种心律失常。如在房颤期间，心脏的上下腔室不同步跳动，起搏器可使这两个部分重新对齐。同时在花瓣上的电极可以搜集电生理信息，这不同于电刺激起搏器来自除颤的电信号会干扰电生理信号的记录，使医生无法完整地了解心脏事件。 论文 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"光学新闻 20221113","slug":"OpticsNews20221113","date":"2022-11-13T05:00:00.000Z","updated":"2022-11-13T06:16:46.589Z","comments":true,"path":"OpticsNews20221113/","link":"","permalink":"https://faster-than-light.net/OpticsNews20221113/","excerpt":"近几周的五篇光学新闻： Ouster和Velodyne计划合并 — 小米12S Ultra 概念机：手机装上徕卡相机镜头— 京东方加码VR新技术— 科沃斯首款割草机器人GOAT G1— 集成3D打印编码滤波器的超导单光子光谱仪","text":"近几周的五篇光学新闻： Ouster和Velodyne计划合并 — 小米12S Ultra 概念机：手机装上徕卡相机镜头— 京东方加码VR新技术— 科沃斯首款割草机器人GOAT G1— 集成3D打印编码滤波器的超导单光子光谱仪 Ouster和Velodyne计划合并评论：近日，Ouster和Velodyne对外宣布进行全股合并。根据协议，双方将组建一家总市值为4亿美金的新公司，Ouster和 Velodyne各自持有新公司50%的股份。Ouster的CEO Angus Pacala将成为新公司的首席执行官，而Velodyne的CEO Ted Tewksbury 将成为执行董事长。合并预计将于2023年上半年完成，在交易完成之前，Ouster和 Velodyne将继续独立经营业务。不过这两家公司都不是省油的灯，Velodyne之前几年公司内斗不断，Ouster好一些，不过股价跌到不到高点的10%。一年前， Ouster收购了Sense Photonics。两家最近都跌得太惨了，全自动驾驶的未来看起来依然遥远，使用多摄像头的ADAS也称为一个流派，各家激光雷达公司需要抱团取暖。按照 Gartner曲线，激光雷达的技术正在经历过热期，回归理性，逐渐到达谷底的阶段。 新闻 小米12S Ultra 概念机：手机装上徕卡相机镜头评论：小米发布了12S Ultra 概念机，将徕卡的M系列相机镜头，装在小米12S Ultra上。取下镜头时，外观和功能都和小米12S Ultra基本一模一样，可以正常使用。当它拧上徕卡镜头的那一瞬间，手机内置的第二颗直取光传感器开始工作，配合 ƒ/1.4 镜头，进光量相比小米12S Ultra提升了1倍，极大提升了手机拍摄能力，实现之前无法拍出的超高画质大片。 对于小米：这是手机厂商对于自己边界的探索，尝试定义自己新的边界以及影像风格。 徕卡：完了，我自己成做镜头的替身了。Leica的主要能力是整机和Leica的味道，这把徕卡味道放到小米手机里了，把镜头外置了，感觉小米这两年要把这个徕卡合作最大化。 新闻 京东方加码VR新技术评论：10月30日晚间，半导体显示行业龙头京东方抛出290亿元的项目投资计划，拟加码布局VR显示产品市场。公告称，公司下属控股子公司创元科技拟在北京经济技术开发区投建应用LTPO技术的第6代新型半导体显示器件生产线项目，着力布局VR显示产品市场，巩固公司半导体显示行业龙头地位。根据公告，项目主要产品为VR显示面板、MiniLED直显背板等高端显示产品；设计产能为50千片/月；项目建设周期为2023年—2025 年，2025年量产，2026年满产。 LTPO（Low Temperature Polycrystalline Oxide） 技术相比目前主要应用的LTPS（Low Temperature PolySilicon） 技术，能够在增加有限成本的基础上满足VR 产品对于像素密度进一步提升的要求。因此，LTPO 技术有望成为未来VR产品中的主流显示技术。 京东方进一步表示，通过布局LTPO技术，有助于积累超高分辨率半导体显示技术，巩固公司的核心竞争力；通过提前布局MiniLED尖端驱动架构，能够有效提升MiniLED 产品综合竞争力。同时，项目的建设有助于提升公司高端显示器件产量和实现产业化，扩大规模优势，构筑更高竞争壁垒。 公告全文 科沃斯首款割草机器人GOAT G1评论：11月1日，服务机器人龙头科沃斯发布了其首款割草机器人GOAT G1。全球的私人草坪和花园共计2亿5千万个，但割草工具的机器人化率仅有10%，2021年全球草坪护理工具市场规模达到57.5亿美元，而割草机器人仅有7亿美元。 光学相关方案上，科沃斯割草机器人GOAT G1搭载了TrueMapping四重融合定位系统，其核心就是科沃斯首创的360度全景摄像头和鱼眼摄像头的机器人双目视觉解决方案。有这两颗摄像头的加持，割草机器人就可以无死角观测周围情况。它顶部的360度全景摄像头，有效视野达到100米，一般情况下这一覆盖面积足以满足庭院内的观测需求了。正前方的鱼眼摄像头拥有150度的视角和100米的有效视距，能让割草机器人看得远的同时，看得清视觉前方和地面视野。双目视觉定位系统能够以每秒25帧的频率实时扫描整个庭院环境，每帧可检测到至少500个地面和立体空间位置特征点，能够实现庭院内的“厘米级”精准定位。为了避免割草机器人破坏或伤害到庭院内常见的水管、秋千、小动物等，G1配备了适应庭院环境的、由视觉传感器和ToF传感器组成的AIVI 3D解决方案，使得该割草机器人可以避开障碍物，提高安全性。 对于一个空旷的草坪来说，不需要像家用吸尘器一样准确找到边角，进入各个房间，而是需要在预设边界内，正常工作，避开障碍物即可。 目前，在室内场景，科沃斯已经形成了扫地机器人、擦窗机器人、空气净化机器人在内的产品体系。除草机器人这个产品变革也意味着，科沃斯正在从室内场景一步步外延，依托于自己的技术护城河，写出新故事。最终变成一家服务机器人公司。 产品官网 集成3D打印编码滤波器的超导单光子光谱仪评论：中国科学院上海微系统与信息技术研究所尤立星/李浩团队、陶虎团队，联合上海交通大学王增琦团队，结合超导纳米线单光子探测技术、双光子3D打印编码滤波技术、计算重构技术等实现单光子计数型光谱分析仪。 记录这片论文的想法是，这里面提高了超导纳米线单光子探测器（SNSPD）。超导纳米线单光子探测器（SNSPD）是一种量子极限灵敏度的光探测器。它的基本原理是利用光子能量实现超导纳米线库珀对的拆对，从而在超导纳米线局域发生超导-非超导相变。和传统半导体单光子探测器相比，它具有探测效率高（&gt;90%）、暗计数低（&lt;0.1cps）、时间抖动小（~3ps ）、死时间短、宽谱响应（可见～红外）以及自由运行等优势。高性能SNSPD已经在量子信息、激光通信、激光雷达等领域得到了广泛应用。将SNSPD集成到光谱分析仪中，不仅能够实现极弱光的光谱测量，而且具备非常宽的工作范围，在量子信息技术、天文光谱、分子光谱等领域具有重要的应用价值。 该工作中，合作团队利用超导单光子探测器的高效、宽谱等性能优势，设计制备4*4阵列型偏振不敏感超导单光子探测器，借助双光子3D打印技术的灵活性在每个探测器像元上制备光子晶体编码滤波器，通过分析探测像元光谱响应特性等建立了计算光谱重构问题的数学模型，最终实现光子计数型光谱分析仪。该光谱分析仪工作范围覆盖12001700nm，灵敏度达到-108.2dBm，分辨率为5nm。与当前商业光谱仪的灵敏度（一般灵敏度在-60~90dBm）相比，有两个数量级以上的提升，为单光子源表征、前沿天文光谱学、荧光成像、遥感、波分复用量子通信等微弱光谱分析领域的研究提供了有效的解决方案。 论文 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"光学新闻 20221017","slug":"OpticsNews20221017","date":"2022-10-17T15:00:00.000Z","updated":"2022-10-17T14:26:03.926Z","comments":true,"path":"OpticsNews20221017/","link":"","permalink":"https://faster-than-light.net/OpticsNews20221017/","excerpt":"近几周的五篇光学新闻： 全球首款“像素一体化”全彩MicroLED屏 — 热传感器开发商Calumino完成1030万美元A轮融资— 光场技术开发商Brelyon获1500万美元A轮融资— ST新TOF传感器使用Metalens— 全球最大数码相机","text":"近几周的五篇光学新闻： 全球首款“像素一体化”全彩MicroLED屏 — 热传感器开发商Calumino完成1030万美元A轮融资— 光场技术开发商Brelyon获1500万美元A轮融资— ST新TOF传感器使用Metalens— 全球最大数码相机 全球首款“像素一体化”全彩MicroLED屏评论：Porotech 今天宣布全球首次公开展示 microLED 像素“一体化”全彩显示屏。Porotech 实现了单个microLED可全光谱调色，摆脱了支撑所有当前商业显示技术的 RGB（红-绿-蓝）子像素模型的限制。Porotech 的创新在于其改变游戏规则的 Dynamic Pixel Tuning™ (DPT™) 技术。通过使用新型多孔氮化镓材料，DPT™使单个 microLED 芯片能够产生任何可见颜色。支撑DPT™的材料 PoroGaN™允许利用调制电流在单个 microLED 芯片上发射覆盖整个色谱的可见光。在它可以发射的颜色中，DPT™ microLED 能够通过从单个像素发射纯白色来实现世界首创。DPT™ 的潜力正在改变整个显示行业的游戏规则。通过消除对 RGB 子像素的需求，DPT™允许 microLED 驱动的显示器将整体像素密度提高四倍。因此，DPT™ 可以为每种类型的显示器带来分辨率、亮度和效率方面的显着提升。这一突破对于需要高分辨率的小型显示器（如 AR 和 VR 显示器）以及可穿戴技术来说尤其重要。 优劣势的分析优势肯定是像素密度，劣势现在还不知道对于显示各种颜色的效率等问题，以及大规模生产的可行性。 官网 热传感器开发商Calumino完成1030万美元A轮融资评论：下一代热传感器及人工智能（AI）技术开发商和制造商Calumino近日宣布完成1030万美元A轮融资。此轮融资由Celesta Capital和Taronga Ventures领投，Egis Technology等公司参投。Calumino的创新技术提供了有史以来第一款汇集了关于人体存在、活动、威胁和环境等高价值数据集的智能传感平台。Calumino开发的热传感器是全球首次将AI与高性能图像传感、隐私保护和经济性相结合，其平台可以为广泛的应用提供新优势，包括智能建筑管理、虫害控制、安全保障、医疗保健等。Calumino热传感器的原生设计，使分辨率低到足以保护个人隐私，填补了当前监控摄像头和低性能运动传感器之间的市场空白。 该公司主打的sensor称为Calumino Thermal Sensor (CTS)，特点是隐私性，高性能和可扩展性。该公司宣称使用红外传感器可以相对于传统相机型运动传感器保护隐私。使用AI技术可以更好的提升传感器的功能，同时简易的开发者Kit可以很好地完成各种应用场景的开发。 Calumino热传感器能够感应温度，对周围环境、资产和个体进行测绘，能够检测人体的存在、活动和姿态。它还可以识别人类和动物，并检测有风险的热点、火灾、漏水和其他异常情况。这些独特的数据对于节约能源、提高业务运营效率、提高安全性、改善生活质量以及挽救生命都至关重要。随着Calumino在商业建筑管理以及虫害防治领域的成功商业化，此轮融资可谓水到渠成。最近，Calumino与三菱电机的一家子公司建立战略合作伙伴关系，从而进入日本市场，推出了基于“Calumino+AI”热传感器的创新虫害防治产品“Pescle”。 Calumino创始人、首席执行官Marek Steffanson表示：“我们对这一合作伙伴关系感到非常兴奋，计划与他们一起在全球推广该产品。除了我们，目前还没有其他技术可以在黑暗、数据带宽极低的情况下，经济、智能且可靠地将人类与啮齿动物区分开来，这项应用还仅仅是一个开始。我们的技术将打开全新的市场空间，我们非常感谢投资者的支持。我们将继续扩大产能，用下一代智能传感解决行业痛点。” 这个sensor的前表面可能是一个filter，但是这样应该会损失一些光效率，不知道会不会有改进。有些时候，感觉有意思的是，地球的某处，某些人在关注着如何发现啮齿类动物。 官网 光场技术开发商Brelyon获1500万美元A轮融资评论：Brelyon是一家麻省理工学院的衍生公司，此前它基于其专利的光场技术Ultra Reality™开发了一款虚拟现实产品，该产品造型类似于传统的电脑显示屏，不过它可生成带有深度的3D内容，此外也可以显示传统的2D内容画面。 个人觉得这东西类似于一个介于VR头盔到全包裹的航空模拟器中间的东西，看演示视频，一个使用者玩儿一款赛车游戏说“我觉得我坐在车里”。技术上并没有看到很crazy的东西，更多的是产品。 该公司官网上的链接指向的论文提到了”multi-focal 3D display design”, “The results indicate that on average 1731 stereoscopic and 7 monocular depth levels (distributed optimally from 25 cm to infinity) “，基本说明这是一种Multi focal 3D display设计。 官网 ST新TOF传感器使用Metalens评论：ST新一代的TOF sensor开始使用由Metalenz公司设计的Metalens作为接收端的receiver光学组件。新款的TOF传感器实现了2倍的传感距离，室内达到4m，或者以VL53系列前一代的产品的一半功率运行。对于如何具体设计Metalens作为接收端实现的收集到更多的光，这里可能需要进一步研究一下。 新闻文章 全球最大数码相机评论：美国能源部SLAC国家加速器实验室研发完成了世界上最大的用于天文工作的数码相机Large Synoptic Survey Telescope(LSST)。这台相机有32亿像素，传感器是由189个传感器单元组成的，整个相机长3.73米，高1.65米，重2.8吨，有五个可自动切换的滤光片，可观测波长320nm到1050nm。 这台相机将部署在智利，天文台正式命名为Vera C. Rubin Observatory，为了纪念研究星系自转速度的先驱天文学家Vera C. Rubin。该相机会在开始运行的十年间，每几个晚上就照出一张完整的夜空图像。该项目会帮助天文学家们更好地了解暗物质，暗能量，太阳系，银河系，夜空的变化等。 这是人类的浪漫。 官网 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"光学新闻 20220918","slug":"OpticsNews20220918","date":"2022-09-18T15:30:00.000Z","updated":"2022-09-18T15:04:24.471Z","comments":true,"path":"OpticsNews20220918/","link":"","permalink":"https://faster-than-light.net/OpticsNews20220918/","excerpt":"近几周的五篇光学新闻： 华为Mate 50 Pro超光变镜头 — 堆叠式Micro LED— Trumpf为量子陀螺仪研发高功率单模VCSEL，用于2027年太空任务— 豪威集团发布用于 AR/VR/MR 和 Metaverse 的超小尺寸全局快门图像传感器— 高灵敏度、可大规模生产的有机光电探测器","text":"近几周的五篇光学新闻： 华为Mate 50 Pro超光变镜头 — 堆叠式Micro LED— Trumpf为量子陀螺仪研发高功率单模VCSEL，用于2027年太空任务— 豪威集团发布用于 AR/VR/MR 和 Metaverse 的超小尺寸全局快门图像传感器— 高灵敏度、可大规模生产的有机光电探测器 华为Mate 50 Pro超光变镜头评论：9月6日，华为发布了Mate 50，影像部分后置摄像头： 5000 万像素超光变摄像头（F1.4-F4 光圈，OIS 光学防抖） 1300 万像素超广角摄像头（F2.2 光圈） 6400 万像素潜望式长焦摄像头（F3.5 光圈，OIS 光学防抖） 其中比较有意思的是其中的可变光圈。自动模式拥有四档光圈，可根据不同场景智能识别匹配光圈大小。在专业模式下，则拥有十档可调物理光圈，更进一步调节景深范围和虚化程度。其他方面，华为 Mate 50 系列支持 100 倍变焦，Mate 50 Pro 则支持 200 倍变焦范围。全新的广角微距摄像头，支持 2.5cm 超级微距拍摄。 官网 堆叠式Micro LED评论：首尔伟傲世在9月2日开幕的2022德国电子展会（IFA）上展示了可实现高分辨率显示的 Real One Pixel 叠层结构 microLED 技术以及相关的Micro LED显示应用产品。首尔伟傲世开发的堆叠式Micro LED具有独特的创新结构，红、绿和蓝光(R/G/B) 芯片采用垂直排列取代常规的水平排列结构。与传统Micro LED最大的不同点在于，堆叠结构的R/G/B Micro LED发出的光色，类似通过色彩混合构成的单个像素所发出。 公司官网 Trumpf为量子陀螺仪研发高功率单模VCSEL，用于2027年太空任务评论：Trumpf（通快）旗下子公司Trumpf Photonic Components正在开发一种高功率单模VCSEL——它被用于在太空任务中检测姿态的量子陀螺仪。预计在2027年，搭载量子陀螺仪的卫星将发射升空。该量子陀螺仪的核心部件是VCSEL光源。由于小型化和稳健性对于太空应用至关重要，因此非常小且耐用的VCSEL适合此任务。与现有的激光器解决方案相比，VCSEL尺寸可以小几个数量级，并且成本显著降低。 下面两张图为任务概念图和现阶段的环式激光陀螺仪照片。环式激光陀螺仪（RLG）包括一个环式激光仪，在同一光路中反向传播同一光源输出的激光，通过萨格纳克效应（Sagnac effect）来检测外界环形的旋转角速度。萨格纳克效应（ Sagnac Effect）是1913年萨格纳克发明的一种可以旋转的环形干涉仪。将同一光源发出的一束光分解为两束，让它们在同一个环路内沿相反方向循行一周后会合，然后在屏幕上产生干涉，当在环路平面内有旋转角速度时，屏幕上的干涉条纹将会发生移动，这就是萨格纳克效应。 新闻页 OV发布用于 AR/VR/MR 和 Metaverse 的超小尺寸全局快门图像传感器评论： 8月24日Omnivision发布业界首款也是唯一一款三层堆叠式 BSI 全局快门（GS）图像传感器 OG0TB。这款超小尺寸图像传感器用于 AR/VR/MR 和 Metaverse 消费设备中的眼球和面部跟踪，封装尺寸仅为 1.64 毫米 x1.64 毫米，采用 2.2 微米像素尺寸和 1/14.46 英寸光学格式（OF）。这款 CMOS 图像传感器具有 400x400 分辨率和超低功耗，30fps时小于7.2mW。是眼罩、眼镜等电池供电的小尺寸轻型可穿戴设备的理想选择。而且现在的头盔传感器增多，控制功率是一个非常重要的工作。 对比起之前的OV7251(640x480)和OV9282(1280x800)很有意思的是，这款新的OG0TB像素往少了走了，去使用更小的尺寸。对于machine vision应用，其方案和发展不会像photographic传感器一样，一路增加pixel，反而会往前走走，往后走走。算法变强了，就可以去减少pixel。 OG0TB产品页面 高灵敏度、可大规模生产的有机光电探测器评论：研究人员们开发并实验证明了一种新的绿光吸收型透明有机光电传感器，其生产方法适用于现今的CMOS生产工艺，该种传感器有很高的灵敏度。该种传感器融合进普通传感器可以有许多应用，包括基于光的心率监测、指纹识别及临近传感器。 CMOS这种传感器是把光信号转换成电信号，有机传感器的灵敏度更好，但是生产高性能可以通过信赖性测试的有机光电传感器一直是个难题。研究人员在《Optica》期刊上描述了新的有机光电探测器。他们还通过将透明的绿色吸收有机光电探测器叠加到带有红色和蓝色过滤器的硅光电二极管上创造了一个混合的RGB成像传感器。研究人员表明，新的光电探测器表现出跟传统硅光电二极管相当的检测率。探测器在150 °C以上的温度下稳定运行2小时，并在85 °C下显示出30天的长期运行稳定性。这些光电探测器还表现出良好的色彩表现力。 个人理解是这种sensor可以在第一层的有机光电传感器层很大程度的吸收绿光，输出信号，在下面的红蓝pixel中，再次去除其他光谱干扰，整体的sensor结构增强了对于绿光的传感灵敏度。以下两图分别是概念图和论文中的配图。 论文 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"光学新闻 20220820","slug":"OpticsNews20220820","date":"2022-08-20T16:10:00.000Z","updated":"2022-08-20T16:04:07.043Z","comments":true,"path":"OpticsNews20220820/","link":"","permalink":"https://faster-than-light.net/OpticsNews20220820/","excerpt":"近几周的五篇光学新闻： 豪威集团发布世界首款产品级 CIS/EVS 融合视觉芯片 OV60B10 — 中芯小米红杉中金等投资，思坦科技连续完成数笔融资— 腾讯投资AR光学显示波导厂商深圳光舟半导体— 光粒AR智能泳镜 Holoswim 2开启海外众筹— 超快光场断层扫描","text":"近几周的五篇光学新闻： 豪威集团发布世界首款产品级 CIS/EVS 融合视觉芯片 OV60B10 — 中芯小米红杉中金等投资，思坦科技连续完成数笔融资— 腾讯投资AR光学显示波导厂商深圳光舟半导体— 光粒AR智能泳镜 Holoswim 2开启海外众筹— 超快光场断层扫描 豪威集团发布世界首款产品级 CIS/EVS 融合视觉芯片 OV60B10评论：豪威集团近日发布了世界首款产品级 CIS/EVS 融合视觉芯片 OV60B10。通过对两者的融合，在一颗芯片上集合两类传感器的特性。EVS (Event-Based Vision Sensors) 是一种生物启发的新型视觉传感器，具备基于事件的视觉、可实现高动态范围、保持高速、低延迟、无运动模糊，且同时满足低数据率、低功耗的技术特点。与广泛应用的 CIS (CMOS Image Sensor) 相比，事件相机的输出在空间和时间上具有连续性，其响应速度不受传统的曝光时间和帧率限制，可以检测到快如子弹的超高速运动，而使用 CIS 相机则需要以几千或几万帧/秒的速率才能捕捉得到；不受白平衡、感光度、曝光时间等统一成像参数影响，在图像过暗、过曝或急剧变化等情况下，依然可以触发事件来获取视觉信息。OV使用了3D stack工艺，像素级融合，独有的 in-pixel timestamp 及相关的高速读出技术，达到了小芯片尺寸和最高10000FPS帧率。 下图1是Event camera的原理示意，图2是Event base camera公司Prophesee公司的应用示例。近一年多能看到OV和Sony都在该领域有所动作。 CVPR 2021 Workshop on Event-based Vision 中芯小米红杉中金等投资，思坦科技连续完成数笔融资评论：近期，Micro-LED全套解决方案技术提供商思坦科技顺利完成了数笔融资，中芯聚源、小米产投、舜宇产投、华润微等多家产投基金战略投资，红杉中国、中金资本、厦门创投、七匹狼创投、启诚等财务投资方集聚加持。2020年，思坦科技完成由中芯聚源领投、七匹狼晟联和启诚资本跟投的Pre-A轮融资，同年建成中试线二期并投入使用，研发平台得到进一步完善；2021年思坦科技完成小米产投独家A轮战略投资，加强双方在消费电子领域的产业协同；2022年3月，思坦科技完成由红杉中国领投、舜宇产投和厦门创投跟投的A+轮融资，进一步加强思坦科技在XR领域的产业布局；2022年7月，思坦科技新增完成华润集团旗下润科微电子产业基金领投，中金资本旗下中金传合基金和厦门高新投跟投轮融资。本轮融资将进一步助力公司的量产落地，在上游的硅基CMOS驱动领域与中芯国际、华润上华等龙头晶圆厂形成更为有效的产业协同。深圳市思坦科技有限公司成立于2018年10月，由刘召军等三位国家级人才及南方科技大学联合创立。思坦科技核心团队对硅基微显示驱动芯片的自主研发可追溯至2000年，积累了丰富的Micro-LED发光芯片和驱动芯片前沿创新经验。 第三代半导体氮化镓被认为是高效且稳定的发光器件材料，由氮化镓制成的Micro-LED发光阵列，在亮度、寿命、能耗和响应速度等方面有明显优势。思坦科技的Micro-LED发光芯片采用的是氮化镓材料，团队现已成功开发出了可定制化的1-50微米的Micro-LED发光芯片，目前可满足企业与机构的研发与小批量生产需求。 现在官网上的产品参数还只有蓝色和绿色，红色的部分看起来还没有解决。 Micro LED的规模化应用必定要基于高良率和高光效的红绿蓝三基色Micro LED芯片。当前绿光和蓝光氮化镓材料体系已经成熟，并可满足Micro LED制程开发需求。但红光方面，传统的红光磷化铝铟镓（AlInGaP）体系由于材料较脆且侧壁非辐射复合严重，因而在良率和光效方面仍面临重大技术瓶颈。因此，开发基于大尺寸硅衬底的高效红光氮化镓芯片，就成为当前破解Micro LED规模量产的首要问题。 正因如此，近年来，许多公司相继加大了在红光氮化镓领域的研发投入，并陆续有相关研发成果问世。譬如，2021年9月，晶能光电宣布已成功制备红、绿、蓝三基色硅衬底氮化镓基Micro LED阵列，像素点间距为25微米，像素密度为1000PPI，在10A/cm2电流密度下的峰值波长分别为650nm、531nm、和445nm。InGaN红光芯片的外量子效率（36mil，650nm峰值波长）为3.5%，EL的半高宽为70nm。 同年10月，多孔氮化镓材料平台开发商Porotech公司（由剑桥大学拆分出来）宣布，开发出全球首款基于原生红光氮化镓（InGaN）LED的Micro LED微型显示器。其具有0.55英寸对角线面板，分辨率为960×540。Porotech表示，其能够提供比目前使用的磷化铝铟镓（AlInGaP）红光LED更高的效率。用氮化镓芯片开发RGB微型显示器还将提供更容易的驱动和工艺设计。就在日前，Porotech再度宣布在A轮融资中筹集了2000万美元，用于旗下Micro LED产品的大规模生产及品牌全球影响力的提升。 国内方面，同样在2021年，AET阿尔泰在9月举办的2022新品发布会期间透露，公司自主研发的100微米RGB 3D LED芯片即将实现量产，同样是自研的氮化镓红光芯片也已成功点亮。同时，公司在标准控制架构、全新光电材料研发、标准架构下控制IC和驱动IC研发与传输协议的标准化、新封装技术的开发等诸多层面，为Micro LED的商业化应用同步推进。 结合下面的腾讯投资光舟半导体的新闻，可以看到，这是国内AR终端厂的进一步军备竞赛，全面布局。 官网 腾讯投资AR光学显示波导厂商深圳光舟半导体评论：腾讯投资了专注于光引擎、显示模组和波导镜片的深圳市光舟半导体持股约3%。光舟半导体在成立两年多时间内，已经完成了多轮融资。2020年获得来自晶华光电、红杉中国种子基金与中科创星的融资，去年获包括字节跳动战略投资部在内多方的融资。从腾讯入股时间来看，光舟半导体或已完成新一轮股权融资。深圳市光舟半导体技术有限公司（简称“光舟半导体”）成立于2020年1月，公司由AR光学专家朱以胜（之前在华为9年）联合业界科学家共同创办，致力于光波导（衍射光学芯片）、光引擎（微投影模组）、光学模组、微纳半导体材料与工艺等高端先进技术开发与制造，矢志成为光波导行业的领航者。 官网 光粒AR智能泳镜 Holoswim 2开启海外众筹评论：2022年8月5日，AR眼镜厂商光粒宣布光粒Holoswim2 AR全息智能泳镜正式在kickstarter上开启众筹，众筹价为99美元起（约人民币668元）。Holoswim2是一款专为泳者而设计的AR智能泳镜，可以在用户游泳时实时感知多项运动指标，并在水下近眼全息显示。利用AR近眼显示模组的优势，Holoswi能够以最直接的方式将运动数据反馈在眼前，游泳者可以实时了解自己的游泳时长、距离、配速等各项数据，从而及时调整当下游泳状态。据悉，Holoswim2采用了OLED发光源+全息树脂光波导，分辨率为128*64，具有50%的透光率和25度视场角，配备了70mAh电池，支持IPX8级防水，整机重量为70g。 Holoswim 1看起来卖的还可以，继续出了更新的2代。光粒科技和FORM是两家做游泳AR眼镜的，有时候，如果好好去做一款小应用场景的极致产品，也是好产品。下图1是Holoswim 2，图2是FORM的AR泳镜。 Kickstarter页面 超快光场断层扫描评论：UCLA的科学家们开发了一种可以以1000亿帧每秒的速率记录3D信息的成像方法，对于2D影像来说，这个速度并不稀奇，但是对于3D成像来说，以前并没有如此快的速度。该相机可以摄下光在光纤中运动的3维成像。该方法类似于CT扫描，但是使用AI和机器学习去重建3D图像。本质上有一定猜的成分。 论文 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"光学新闻 20220731","slug":"OpticsNews20220731","date":"2022-07-31T09:00:00.000Z","updated":"2022-07-31T08:37:50.842Z","comments":true,"path":"OpticsNews20220731/","link":"","permalink":"https://faster-than-light.net/OpticsNews20220731/","excerpt":"近几周的五篇光学新闻： 小米12S Ultra发布 — 华为Nova 10 Pro前置变焦— Mojo Lens隐形眼镜首次成功入眼试戴— 衍射光学全息技术厂商Swave完成700万欧元种子轮融资— 巡天空间望远镜预计2024年投入科学运行","text":"近几周的五篇光学新闻： 小米12S Ultra发布 — 华为Nova 10 Pro前置变焦— Mojo Lens隐形眼镜首次成功入眼试戴— 衍射光学全息技术厂商Swave完成700万欧元种子轮融资— 巡天空间望远镜预计2024年投入科学运行 小米12S Ultra发布评论：7月4日，小米正式发布小米12 Pro天玑版、小米12S、小米12S Pro和小米12S Ultra四台手机，以及小米手环7 Pro、小米笔记本Pro 2022（14和16寸版本）、小米Home WiFi路由器，一共8款新品。其中最引人瞩目的是“新安卓之光”小米12S Ultra。这一代核心升级是1英寸主摄、骁龙8+和徕卡联名，其余双IMX586副摄。主摄首发真·卡片机级别的1英寸CMOS——索尼IMX989，5030万像素，1.6μm，支持Octa-PD对焦，传感器面积是iPhone 13 Pro Max（1/1.65”）的2.72倍。徕卡的8P非球面镜头，逐片涂墨的环烯烃镜片，F1.9，等效23mm，能覆盖整个传感器，不像索尼那样有公摊面积。前置升级成3200W RGBW，而两颗IMX586副摄和小米11 Ultra维持一致，分别是等效13mm的超广角和等效120mm F4.1的5倍潜望长焦。配备4个徕卡滤镜。 华为和徕卡合作结束，小米开始合作，从宣传片里可以看到，主要徕卡团队协助了图像的风格调教。手机的影像之战在摄像头的军备竞赛达到顶峰之后，不知后面迎来的是什么。可能是终于回归照相这最朴素的需求。 小米影像 华为Nova 10 Pro前置变焦评论：华为夏季发布会发布了一系列新品，影像方面值得一提的是其Nova 10的前摄，nova 10 Pro 搭载了前置双摄像头，药丸形状挖孔。两颗前摄像头分别是 6000 万像素超广角追焦镜头和 800 万像素人像特写镜头，一个取景范围更广，一个可以人像虚化。但 nova 10 Pro 的前置不仅支持人像虚化，它甚至还支持 5 倍变焦。这个前置变焦根据宣传可以在化妆或者直播展示一些细节的时候派上用场。感觉照这么下去，手机可能真的从分久必合的状态向着合久必分走去，可能以后就出现了专门用于一些场景的特定手机。 官网 Mojo Lens隐形眼镜首次成功入眼试戴评论：美国新创Mojo Vision 宣布，执行长Drew Perkins 已经对公司开发的AR 隐形眼镜进行第一次入眼测试。Perkins 表示，发现自己可以与指南针互动、找到方位，以及查看图片，并使用屏幕上的提词器来阅读熟悉的引言，“我亲身体验了隐形运算的未来，戴上这个镜头很鼓舞人心，亲眼看到未来简直惊讶到说不出话来”。 不过看这个大小，感觉戴着应该不是很舒服。 新闻稿 衍射光学全息技术厂商Swave完成700万欧元种子轮融资评论：专注于全息扩展现实（HXR）技术并志在实现元宇宙的Swave Photonics日前宣布，已完成由imec.xpand和Flanders Future Techfund领投，以及QBIC等参投的700万欧元种子轮融资。据介绍，Swave的全息扩展现实技术技术利用了基于衍射光学的光子学和全息技术进步，从而提供亚½波长像素和超高分辨率技术。他们表示能够从片上2D全息图中完全重建3D光波，在所有方向代表所有场景，而且在空间中的任何点都具有完美的焦点。 官网上并没有看到具体的技术描述，可以继续关注。 官网 巡天空间望远镜预计2024年投入科学运行评论：伴随着中国空间站的建造，与其共轨飞行的巡天空间望远镜的研制也正在紧张有序推进。中科院长春光学精密机械与物理研究所巡天光学设施初样研制取得新进展。望远镜预计在中国空间站建成后发射升空，将成为探索星辰大海的旗舰级空间天文设施。作为中国空间站的光学舱，巡天空间望远镜将架设一套口径2米的光学系统，并配备一系列最先进的探测器。望远镜的大小相当于一辆大客车，立起来有三层楼高，重达十几吨。 巡天空间望远镜主要分成两部分，一个是巡天光学设施，还有一个是巡天平台。巡天光学设施就是一台望远镜，它实际上有很多的子系统。在巡天空间望远镜上，第一代仪器共包含5台观测设备，包括巡天模块、太赫兹模块、多通道成像仪、积分视场光谱仪和系外行星成像星冕仪。其中，占据最主要观测时间的就是巡天模块，这是一个视野极为宽阔的相机。这是一个视野极为宽阔的相机，视场达到1.1x1.2平方度。在成像质量和哈勃望远镜相当的情况下，巡天空间望远镜的视场达到了哈勃望远镜的300倍。为了能够接收广阔视场的信息，巡天空间望远镜在巡天相机上安置了30块探测器，总像素达到25亿。其中18块探测器上设置有不同的滤光片，这使得它可以获得宇宙天体在不同波段的图像，带给我们彩色的宇宙样貌；另外12块探测器则用于无缝光谱观测，每次曝光可以获得至少1000个天体的光谱信息。巡天空间望远镜在巡天模式下的观测每次曝光约为150秒，对于巡天中的每个观测天区会进行两次曝光。天文上一般以星等表示天体的明暗，星等越大表示天体越暗，每相差5个星等，天体之间的亮度相差100倍。天上的织女星大约是0星等左右，人眼能够看到最暗的恒星是6星等。巡天空间望远镜在总共短短300秒的曝光时间，就可以获得低至26星等左右（不同波段具体数值有差别）的天体图像，这要比人眼能够看到的最暗的恒星还要暗上1亿倍。在这样的观测深度上，研究者可以在每个平方角分看到30个左右的星系。在整个巡天周期里，巡天模块将会覆盖17500平方度的天区，是整个天空面积的40%，积累近20亿星系的高质量数据。 我们的巡天望远镜有一个特点是伴飞中国的天宫空间站，优点就是共轨飞行带来的维护和升级上的便利性，由于维护和升级上的便利性，望远镜可以造的性能十分优异。缺点是空间站的轨道却限制了这个性能的上限，望远镜会受到低高度大气层、月光、地表漫反射甚至其他卫星等带来的干扰。 官网 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"光学新闻 20220703","slug":"OpticsNews20220703","date":"2022-07-03T14:00:00.000Z","updated":"2022-07-03T13:34:52.800Z","comments":true,"path":"OpticsNews20220703/","link":"","permalink":"https://faster-than-light.net/OpticsNews20220703/","excerpt":"近两周的五篇光学新闻： ADI发布3D景深测量高分辨率iToF模块ADTF3175 — 超表面的拜耳型分光滤色器— II-VI收购Coherent获得最终批准— Intel集成光子学研究最新进展— 生产自太空的光学KDP晶体获得第一笔销售","text":"近两周的五篇光学新闻： ADI发布3D景深测量高分辨率iToF模块ADTF3175 — 超表面的拜耳型分光滤色器— II-VI收购Coherent获得最终批准— Intel集成光子学研究最新进展— 生产自太空的光学KDP晶体获得第一笔销售 ADI发布3D景深测量高分辨率iToF模块ADTF3175评论：ADI日前发布了首款用于3D景深测量和视觉系统的高分辨率、工业品质、间接飞行时间（iToF）模块：ADTF3175。参数如下： 1024 × 1024 TOF 传感器， 3.5 μm × 3.5 μm 像素大小 75 × 75 FOV 940nm 工作波段 深度探测工作范围0.4m to 4m (深度噪音最大15mm, 最小15%反射, &lt;5 klux 等效阳光) 深度分辨准确度: ± 3 mm 值得一提的是，为了支持各种照明条件，这款高分辨率模块采用了Lumentum先进的三结垂直腔面发射激光器（VCSEL）技术，三结VCSEL可以增强发射端的发射强度。 官网产品页 超表面的拜耳型分光滤色器评论：南京大学和华为技术有限公司共同开发了一种基于超构表面的像素级拜耳型分光滤色器（metasurface-based Bayer-type colour router，MBCR），该分光滤色器对红光、绿光和蓝光的峰值颜色收集效率分别为58%、59%和49%，并且在可见光区域（400nm-700nm）的平均能量利用效率高达84%，是商用拜耳彩色滤光片的两倍。此外，通过200µm × 200µm的基于超构表面的分光滤色器和单色成像传感器的一起工作，进一步实现了彩色成像，获得的图像强度是商用拜耳彩色滤光片的两倍。这项研究开创性地提出了一种高效的光谱信息获取机制，有望在下一代成像系统的开发中显示其广阔的应用前景。 下图展示了BCR和MBCR的概念图 下图展示了研究人员通过任意初始化生成的设计，其是垂直方向上超构表面的一个单位单元，对应于四个像素。MBCR的单元周期为2µm × 2µm，与商用CMOS图像传感器的常用像素大小（1µm × 1µm）相匹配。由于RGGB图案具有对角对称性，且MBCR必须与偏振无关，因此在设计中必须将单元设置为对角对称。 为了对MBCR的分光滤色性能进行可视化，研究人员使用彩色苹果的图片演示了彩色成像，并将成像结果与商用BCF的成像结果进行了比较。MBCR和单色成像传感器均直接捕获带有马赛克图案的原始灰度图片。之后，MBCR的光谱响应被施加到每个像素上，使用转换矩阵方法获得带有马赛克图案的彩色图片。转换矩阵将检测到的光谱强度直接转换为三通道RGB值。最后将带有马赛克图案的彩色图片还原。即根据上述RGGB信息，进行像素插值算法（例如，去马赛克插值）以获得每个RGGB单元的RGB值。通过将RGGB像素值转换为一个三通道像素值，模拟实际彩色成像传感器中的三通道成像，最终重建彩色图像。结果同时表明，与商用BCF相比，通过MBCR获得的图像具有更高的亮度。 论文 II-VI收购Coherent获得最终批准评论：II-VI和Coherent终于要完成合并了，中国国家市场监督管理总局发布公告称，决定附加限制性条件批准II-VI收购Coherent。去年3月份，II-VI在和MKS及Lumentum的竞标中获胜，计划2021年收购Coherent。根据合并协议中的条款，在交易完成后，Coherent的每股普通股将兑换为220美元现金和0.91股II-VI普通股, 收购总价大约为70亿美元。此前，II-VI预计其对Coherent的并购将于2022年7月1日左右完成。根据官方介绍，本次并购完成后，II-VI和Coherent将共同创建一个全球领先的光子解决方案、化合物半导体、激光技术和系统公司，II-VI和Coherent在子系统和系统层面的激光光学和电子技术互补，将提供引人注目的解决方案，以加速航空航天和国防、生命科学和激光增材制造领域的增长。 新闻稿 Intel集成光子学研究最新进展评论：Intel Labs发布了“集成光子学研究的重要成果-增加计算芯片的通信带宽的下一代技术”。Intel最新的研究包括开发集成在硅片中的多波长分布反馈激光阵列，可以提供+/- 0.25 dB的输出功率均一性和±6.5%波长间距均一性。这个研究证明了，实现均一的输出功率和均一的间隔波长是可能的。更重要的是，这可以使用现阶段的制程实现，因此保证了下一代的光学传输和计算整体封装的可能性。Intel相信该成就可以用于未来的高速通信应用。市场分析机构Gartner预测2025年硅光子学技术会使用在20%的高带宽数据中心中（2020年&lt;5%），总计26亿美元的市场。硅光子技术可以提供数据中心需要低能耗，高带宽，快速传输数据能力。下图展示了8通道的激光阵列 新闻稿 生产自太空的光学KDP晶体获得第一笔销售评论：Redwire公司宣称其完成了一笔销售，将在太空中生产的2克potassium dihydrogen phosphate (KDP)晶体卖给了俄亥俄州立大学的电子显微镜和分析实验室。根据成交价格，该批物质达到了200万美元每公斤的价格。该批物质是由Redwire公司的Industrial Crystallization Facility生产的，该设备被放置在国际空间站。这笔交易是第一次太空中生产的材料在地球上被销售，这是太空商业化的一个重要里程碑。Redwire声称太空生产的光学晶体可以极大地提升高能激光的表现，现阶段在地球上生产的光学晶体由于受到重力影响，会产生杂质或缺陷，最终限制了高能激光的输出功率，而太空中生产的晶体不会。俄亥俄州立大学的研究者们会比较地球和太空中生产的晶体的区别。 考虑到只卖了2克，其实只有$4000，:p.不过太空生产，可能会越来越多吧。 新闻稿 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"光学新闻 20220615","slug":"OpticsNews20220615","date":"2022-06-15T14:30:00.000Z","updated":"2022-06-15T14:20:18.097Z","comments":true,"path":"OpticsNews20220615/","link":"","permalink":"https://faster-than-light.net/OpticsNews20220615/","excerpt":"近两周的五篇光学新闻： 会360°旋转的新镜头 —— 老蛙24mm 2X PERIPROBE 转角 — 全球首款用于3D传感及激光雷达的超透镜实现批量出货— 基于深度神经网络的高感知双共振全介电超表面比色传感器— 新型光学芯片：每秒可处理近20亿张图像— 可以处理新信号的光控二极管问世","text":"近两周的五篇光学新闻： 会360°旋转的新镜头 —— 老蛙24mm 2X PERIPROBE 转角 — 全球首款用于3D传感及激光雷达的超透镜实现批量出货— 基于深度神经网络的高感知双共振全介电超表面比色传感器— 新型光学芯片：每秒可处理近20亿张图像— 可以处理新信号的光控二极管问世 会360°旋转的新镜头 —— 老蛙24mm 2X PERIPROBE 转角评论：老蛙推出了一支独特的新款微距镜头：老蛙24mm T14 2X PERIPROBE，和之前的老蛙探针镜头有很多相同之处，它们可以在狭窄的空间里拍摄，拍到传统镜头无法记录的独特视角。在此基础之上，新款PERIPROBE镜头又增加了新功能 —— 转角视角。这个可以360°旋转的转角镜头能拍摄到特殊的细节图片，或运动视频镜头。作为一支2倍放大的广角微距镜头，它能以特殊的“虫眼”视角拍摄，畸变也比较小。顶端配有1/4螺纹口，可附加魔术手臂和补光灯，为微观视角下的微小物体进行补光。镜头适用于多种卡口，包括PL，佳能 EF，佳能R，尼康F，尼康Z，索尼E，L。下图1展示了这款Periprobe镜头，图2展示了老蛙的探针镜头和这款转角镜头的比较，图3展示了探针镜头的光学设计，主要由27个element，19个group组成。 官网产品页 全球首款用于3D传感及激光雷达的超透镜实现批量出货评论：全球首家实现超表面光学商业化的公司Metalenz宣布，全球领先的半导体芯片制造商意法半导体（STMicroelectronics）的新款飞行时间（ToF）传感器产品采用了其光学超表面技术，并实现了批量出货。这项技术将平面超透镜取代传统折射透镜，应用于智能手机、笔记本电脑、智能家居设备甚至汽车等大众消费产品。Metalenz拥有美国哈佛大学Capasso实验室开发的与超表面相关的知识产权（IP）组合的全球独家授权，并拥有20多项创新专利，旨在变革面向众多领域的传统光学元件。 Metalenz和ST合作真的是强强联手，ST在Prox和TOF传感上的市场份额很大，而且对于此类模组的客户需求，整体方案，制造都有着非常深的积累。对TOF感兴趣的读者可以关注本blog TOF专题的一些文章。 新闻稿 基于深度神经网络的高感知双共振全介电超表面比色传感器评论：由纳米结构阵列产生的纳米级结构着色已被用作比色检测的信号。由于其直接的检测过程，无需额外的测量设备，比色传感作为一种极具吸引力的传感平台一直备受关注，让人们看到超越实验室水平的即时诊断（point-of-care）的可行性。由于其传感性能取决于纳米粒子的结合对微小环境变化的响应而产生的显著颜色变化，因此可以通过在可见光区域形成特定的光谱线型来提高其灵敏度，该光谱线型表现出易于感知颜色变化的结构色。在这篇论文中，研究人员通过引入前所未有的方法，利用由高折射率电介质制成的双洛伦兹共振超表面，提出了一种高感知的比色传感器。它通过提出一种特定的光谱线型来最大化色差，这与以前的研究方法不同，以前的研究只关注提高光谱或近场光学方面的单共振灵敏度。然后，他们从比色法和光谱学的角度分析了双共振光谱具有显著灵敏度的原因。此外，作为一种无误差地形成目标反射率的精确光谱线型的手段，通过“嫁接”深度学习逆向设计方法，他们成功地实现了均方误差（MSE）在0.005以内的目标。因此，所设计的全介电比色传感器可以通过暗示葡萄糖溶液浓度的变化，用肉眼检测折射率小于0.01的微小变化。这些研究成果可以为发展全介电纳米光子比色传感器奠定基础。 读下来感觉简单的说法就是：设计一个meta lens，然后对某个范围的光谱的反射后，颜色差异最大化，让人眼能看到。 论文 新型光学芯片：每秒可处理近20亿张图像评论：宾夕法尼亚大学研究人员开发出了一种功能强大的新型光学芯片，每秒可以处理近20亿张图像。该设备由一个神经网络组成，可以将信息处理为光，而不会减慢传统计算机芯片的组件。该芯片的基础是神经网络，这是一个以大脑处理信息方式为模型的系统。这些网络由像神经元一样相互连接的节点组成，它们通过对数据集进行训练，以类似于有机大脑的方式“学习”，例如识别图像中的对象或语音中的单词。随着时间的推移，它们的学习能力变得更好。在测试过程中，该团队制作了一个尺寸为9.3mm2（0.01 in 2）的芯片，并将其用于对一系列类似于字母的手写字符进行分类。在对相关数据集进行训练后，该芯片能够对包含两种字符集的图像进行分类，准确率达到 93.8%，对四种类型的图像进行分类准确率为 89.8%。最令人兴奋的是，该芯片能够在0.57纳秒内对每个字符进行分类，使其每秒可以处理17.5亿张图像。该团队表示，这种速度来自芯片将信息处理为光的能力，这使其与现有计算机芯片相比具有一定的优势。另一个优点则是，该芯片不需要存储正在处理的信息，因此不必将数据发送到内存卡。研究团队表示，不存储数据也更安全，因为它可以防止任何可能的泄漏。 论文 可以处理新信号的光控二极管问世评论：中国科学院金属研究所科研团队发明了一种具有新信号处理行为的光控二极管，相关研究成果在线发表于《国家科学评论》（National Science Review）。未来集成电路的发展将呈现出多元化发展趋势，其中光电芯片可实现光传输及信息处理功能。通过与现代电子芯片技术的底层融合，支撑未来大容量、低功耗、集成化与智能化信息芯片技术的发展需求。 二极管作为一种重要的基本电学元件，在集成电路、大功率驱动、光学成像等领域具有重要应用，其结构和功能也十分丰富。光电探测器是一类通过电信号探测光信号的重要半导体器件，包括光电二极管、光电晶体管和光电导等。尽管种类繁多，但光电探测器的信号状态在光照前后可归纳为全关态（0,0）、全开态（1,1）以及整流态（0,1）或（1,0）三类。据了解，已往的光电探测器可以实现两种状态的相互转换，以光电二极管为代表的器件实现由整流态向全开态转换，以及以光电导和光电晶体管为代表的器件实现由全关态向全开态转换。从图中的电学行为的完备性出发，理论上应存在一类由全关态向整流态转换的新型器件。中国科学院金属研究所的研究人员通过异质结的设计与构筑，使得器件获得了新型光电整流特性，光照条件下电流状态实现了由全关态向整流态的转换，进而构筑出无需选通器件的光电存储阵列。基于器件对不同波长和强度光信号响应的差异，研究人员演示了阵列对光信号的探测及处理功能，表明了光控二极管具有实现高集成度、低功耗和智能化光电系统的极大潜力。 很有意思，以前都没有这么想过电学完备性这种问题。 论文 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"浅谈吸收光谱学 第二章 衰荡光腔/增强光腔光谱学","slug":"浅谈吸收光谱学 第二章 衰荡光腔:增强光腔光谱学","date":"2022-06-05T09:00:00.000Z","updated":"2022-06-05T08:55:31.502Z","comments":true,"path":"Spectroscopy_C2/","link":"","permalink":"https://faster-than-light.net/Spectroscopy_C2/","excerpt":"浅谈吸收光谱学这个系列来自于作者Jenkins（微信号：Jenkins123，作者具体介绍见文末）的投稿，作者将通过3章的内容介绍光谱学分类，重点探讨吸收光谱学中的两种痕量测量方法：腔体增强型吸收光谱测量（Cavity Enhanced Absorption Spectroscopy，CEAS）以及腔衰荡光谱（Cavity Ring-Down Spectroscopy, CRDS）。 本文是第二章，介绍光学衰荡腔体以及衰荡光腔/增强光腔光谱学的理论与计量。","text":"浅谈吸收光谱学这个系列来自于作者Jenkins（微信号：Jenkins123，作者具体介绍见文末）的投稿，作者将通过3章的内容介绍光谱学分类，重点探讨吸收光谱学中的两种痕量测量方法：腔体增强型吸收光谱测量（Cavity Enhanced Absorption Spectroscopy，CEAS）以及腔衰荡光谱（Cavity Ring-Down Spectroscopy, CRDS）。 本文是第二章，介绍光学衰荡腔体以及衰荡光腔/增强光腔光谱学的理论与计量。 引言第一章我们从最简单的直接吸收光谱学设定–单程吸收池讲起，讲到单程吸收池技术容易搭建但是受限于灵敏度和精准度很多应用场景无法使用，于是在吸收光谱学的技术发展过程中，出现了许多间接吸收光谱学的计量方法（这里的直接/间接基于设备仪器监测到的信号是通过直接测量被样品吸收后的光强度来推算样品的吸收系数或是通过测量光的吸收引发的其他反应过程来间接推算出吸收系数），例如第一章中提到的激光诱导荧光，共振增强多光子电离和光声光谱等等，然而这些更高精度的间接测量方法应用起来有个共同的难点，就是校准难度过高，甚至有些光谱学家（例如本文参考文献之一的联名作者）因为校准的难度过大，始终无法保证仪器设备的长期监测稳定性，放弃了对某些间接测量方法（光声光谱）的研究。 最后我们提到很多科学家由此把研究方向转回直接吸收光谱学，发现在单程吸收池的基础上增长光在样品中的路程（多程吸收池），能够有效提高灵敏度，然而这种方法的前提是能够有足够大的吸收池镜面尺寸和对应的样品体积，不然光路重叠会有不同光程的光子互相干涉影响最后的吸收光谱（注释：最初的直接吸收光谱计量方法使用宽频光源，最后监测端需要使用光谱仪进行光频率上的分光分析）。然而如果我们允许光路重叠，把多程吸收池视为光的存储容器，同时改进光源利用带宽更窄的激光（有些技术也会使用LED），对激光的强度（往往还有波段）进行调制，并且测量光强vs 时间函数，上述问题就能得到克服，主流的计量方法有衰荡光腔光谱（CRDS， cavity ring-down spectroscopy）和增强光腔吸收光谱（CEAS，cavity enhanced absorption spectrscopy）。在我们深入讲解系统之前，我想先介绍这两种技术都需要使用到的允许多程光路重叠并且互相干涉的吸收池，也就是光学衰荡腔体（optical ring-down cavity） 光学衰荡腔体光学衰荡腔体（optical ring-down cavity）中的ring down其实就是指光在腔体中的衰减过程ring-down time 也就是光被打入腔体后衰减所用的时间，最早在1985年有Crawford博士提出，对于吸收光谱学来说这个时间是与腔体中样品吸收系数成反比，知道了吸收系数我们能够比较轻易的通过数据处理来得到样品的浓度。Ring-down cavity本质是一个 Fabry-Perot resonator， 熟悉激光器构成的读者一定对这个名词不陌生，最基础的FBR由两个反射率几乎为 100%的平行平面反射镜组成，假设我们把一束完美相干（coherent）的白光射入腔体内，我们能从另一面镜片得到的通过方程就是一个Airy Function 如下图所示, 这是在一个静止的理想情况下的通过方程，这个方程的图形也叫做梳状频率图（frequency comb pattern），图形里的等距（频率）的峰值就是模（mode）。从图上可以看到腔体的镜片反射率越高，模的带宽会更窄。光腔的自由光谱范围FSR 代表两个相邻模（腔体的纵模）之间的频率。实际上，纵模对应于腔中相长干涉的条件，当两个腔镜之间的间隔等于整数个半波长，图中的干涉相长峰就会出现，对于一个线性腔体（两面腔镜），FSR=C/2L， c代表光速，L 代表腔体长度。 腔体的精细度(finesse)关于评估ring-down cavity，工业界有许多参数，例如精细度，光学稳定系数g等等，这边着重介绍一下光腔体的精细度（finesse），光学腔体的精细度是在腔体被干扰时（入射光源频率的波动/光腔体长度的波动）衡量腔体在光在多程往返中保持一定程度相长干涉的能力。这可以通过一个例子来形象化：考虑两个物理长度 L 相同的光腔，一个具有几何平均镜反射率 R 99 % 和另一个 R 99.9 %。根据有效增强光程公式（有效光程和光在腔体内衰减时间正相关，代表了光在衰减这段时间内在腔体内做的多程往返光程长度），有效光程为 L/(1-R)，两个腔体的有效增强光程为 100L 和 1000L。现在考虑1.6um波段的单色激光与两个腔共振，如果整个系统是完美的（腔体内没有样品吸收），通过光谱应该峰值与入射光强度比值是1，没有损耗。如果此时激光收到干扰，发射频率有1/2000 腔体FSR的偏移（在物理长度方面这相当于0.4 nm 的变化，在腔的增强路径长度上，两个不同的光腔总路径分别为四十分之一个波长和四分之一个波长。这导致的结果就是，两个腔体的通过光强（在偏移后的光频率上）随时间推移会降低，虽然对于较低的精细度腔 (R =99 %) R/T仍然接近1，但是对于更高精密腔（R =99.9 %）通过光强会显著降低，因为后者的有效光程路径变化的更多。从这个例子可以看出，更高精细度的光腔的有效光程更长，纵模的带宽更窄，但同时这个标准也有它的局限性，遇到相同干扰情况下，更高精细度光腔的因为有效光程更长，绝对变化量也更大，直接比较下受干扰程度更大。 光腔的模结构与模的匹配(mode-matching)光腔中的特定频率模的电磁波性质不光有纵模还有横模（transverse mode）,只有在保证在同一纵模的前提下，横模之间的间距才是一个FSR，在CRDS/CEAS的应用中，大多数情况，工程师愿意使用最低阶的横模TEM00，由于当激光的单模与腔的模共振时，最低阶横腔模可以最大程度提高腔内积聚的光能，个人经验TEM00同样也是相对高阶模对外界环境干扰（温度，样品压力等等）最稳定的模，同时在实际应用中，由于工程师还需要对入射光源的发散角（divergence angle）与光腔的接收角进行匹配，TEM00在入射光的角度位置公差上也是最宽松的，可以降低组装的难度。提到最低阶横模就不得不提到光源和光腔的耦合机制，理论上光源的高斯波需要在入射腔体的临界面于光腔的最低阶横模的可接受光束腰（beam waist）进行匹配，这样才能使耦合后墙积聚的电磁波呈最低阶横模，这种匹配方法，业界称作mode-matching，一般在光源和光腔之间需要设计有特定的光学元件对高斯波的束腰进行调整，一般使用ABCD 矩阵进行模拟和仿真。 衰荡光腔/增强光腔光谱学计量方法讲完光学衰荡腔体，我们进入正题，按照技术发展的时间顺序，最早1988年 有O’Keefe 和Deacon 博士发表的关于脉冲衰荡光腔光谱学（pulsed-CRDS）的文章，2003年 Ball 和Jones 博士第一次在科学文章上总结了宽频光源CRDS的技术特点，2008年 Thorpe 和 Ye 博士发表文章总结了增强光腔技术（CEAS）和由脉冲光源输出的梳状频谱技术，2011年，Foltynowicz 博士在他的《QCL 激光在化学物理中的应用》一书中第一次提到运用QCL（也就是CW激光）在CEAS技术中应用，业界称为CW-CEAS。 衰荡光腔光谱学(CRDS)CRDS技术有许多的分类，一般分为，脉冲衰荡光腔光谱学（pulsed-CRDS），持续波衰荡光腔光谱学（CW-CRDS）和相位转移衰荡光腔光谱学（PS-CRDS），篇幅原因我们只会覆盖到前两个，如果读者有时间有兴趣可以自行找参考文献来看。 脉冲衰荡光腔光谱学(pulsed-CRDS)作为最早的CRDS计量方法，脉冲衰荡光腔技术上并不难理解。如下图所示，实验设计者把一束脉冲激光打入我们的衰荡光腔内（本设定中是两面腔镜的线性腔体），这里是单个脉冲激光，暂时不考虑腔内干涉的情况。 如下图所示，脉冲激光通过其中一个镜子的透射进入腔体，光在另一边通过另一面镜子通过，在另一面镜子后对通过光强按时间进行测量，得到通过光强的时间函数。脉冲光由于镜面的高反射率只有几 ppm（比例单位，parts per million, 百万分之一）的激光进入腔体，其余的被反射。进入腔体微量的光量 (~1 nJ) 在每一次光程中通过腔体内的样品和镜面反射后，又有百万分之几的能量传输出去。通过光腔的光被聚焦到一个光电探测器，例如光电倍增管 (PMT)。光电二极管也可以用来替代PMT使用不了的波段或者用于高信噪比要求的应用。如图三所示，脉冲激光在光腔中每间隔一个往返程的时间（tr=2L/c， tr 是脉冲激光的往返程时间，L是线性腔长度，c是光速）通过的光强度被检测器记录下来，形成图三的衰减柱状图。通过对柱状图的衰减曲线进行数据处理，该脉冲激光在光腔内的衰减时间可以被计算出，并且除去由于腔镜损失贡献的衰减时间后，由于样品吸收导致的光的衰减时间可以被得出，从而计算样品的吸收系数。 以上的实验描述基本完整解释了pulsed-CRDS 的实验原理，但是有一个重要的点被简化了，就是光在腔体中的干涉，现实操作中，脉冲激光的带宽比光腔的带宽要更宽，这就意味着光腔被脉冲激光激发时，多个纵模被激发，并且现实操作中，即使达成模匹配还是会有多个横模被激发，每一个模的光衰减时间都略有不同，最终通过光强衰减曲线计算出的衰减时间是光腔内被激发的所有模的光衰减时间的均值，虽然pulsed-CRDS 不再受脉冲激光不同脉冲之间光强波动所影响，仍然精准度受限于激光器的带宽。 持续波衰荡光腔光谱学(CW-CRDS)针对脉冲衰荡光腔光谱学计量的局限性，随着CW激光的发展，CW-CRDS应运而生。在 CRDS 技术中，只有激发衰荡腔的单个纵模时才能获得最佳灵敏度。脉冲激光器很难实现激发，因为它们具有相对较大的带宽，连续波 (CW) 激光器的带宽通常低于 10 MHz，使得激发单个纵模被激发从而大大增加了精准度。在实际应用中，当光强在检测器上超过某个阈值，产生触发信号使得激光器必须终止5-10个光腔衰减时间。这可以通过关闭来完成激光器驱动电流（在二极管激光器的情况下），或通过使用强度调制器，如声光调制器 (AOM) 或半导体光放大器。激光关断时间常数必须与腔衰减时间更短，因为这点消除了MEMS 型调制器无法在次应用使用。与脉冲 CRDS 相比，CW-CRDS 提供更高的重复率 (kHz)（更高取样频率）、更高的灵敏度 ($ 10^{-10} $ ~ $ 10^{-12} $ $ cm^{-1} $ $ Hz^{-0.5}$)并且，在大多数情况下，更高的光谱分辨率。此外，可以实现更高的腔内能量可以实现，从而提高检测器端的光强强度，从而提高信噪比。 不同于短脉冲激光的情况，CW激光在入射光腔时，如果光源频率于光腔纵模一致，由于相干干涉，腔内的能量会聚集起来，在结束一个往返程后，如下图a所示，会有山峰状型号通过光腔，此时在监测到第一个山峰时关闭光源，随即收集监测之后通过的衰荡信号。 尽管CW-CRDS相比脉冲CRDS灵敏度更高，但是它对比脉冲类型还是有它的局限性： 首先，CW-CRDS 需要在第一个衰荡山峰出来的同时把光源关闭，相比脉冲CRDS，打出去一个脉冲就关闭，CW-CRDS 需要对衰荡时间的发生有一个反馈机制，而这第一个衰荡时间发生时间很难被精确预测，这使得CW-CRDS在某些需要全程监控腔内光和物质反应过程的应用里无法使用。其次，由于显而易见CW-CRDS需要更多的设备来实现，在仪器开发的角度来看，成本会高很多。还有一点就是由光源的不同带来的局限性，CW-CRDS 能够运用比较成熟的Laser diode, LD对比脉冲激光有小包装，易搭建，成本低等特点，但是半导体LD的应用波段远不如脉冲激光来的广，让他在应用场景上比较局限。总的来说，无论是脉冲CRDS还是CW-CRDS，对比最原始的直接吸收光谱计量方法有两个最大的优点： 由于有效增强距离的千倍增加，使得光与样品的反应充分，大大增加了计量方法的灵敏度。 由于CRDS测量的是光在腔体中的衰减时间，使得该技术不受光源入射光强波动影响。 站在工程角度上来讲，CRDS技术有几个局限性： 检测段能量非常弱，并且需求非常快的检测器，这使得仪器的开发比较复杂，特别是接收端，往往需要冷却检测器来降低温度带来的噪音，而且由于监测端的低能量，光在通过光腔后的采集步骤对机械波动和工业误差非常敏感 特别是CW-CRDS 缺少保证光源频率和光腔纵模频率一致的机制，导致单单的Pulsed-CRDS和CW-CRDS在持续检测应用中比较难发挥作用。 增强光腔光谱学(CEAS)不同于衰荡光腔光谱计量方法最早在20世纪80年代就开始有所发展，CEAS技术的发展开始于21世纪初，相对比较新，驱动于更轻便更易携带的应用场景（列如21世纪开始对全球变暖问题的重视，需要有易于携带的设备对碳循环进行检测，例如土壤检测中的一氧化二氮需要检测，浓度要求 0-100ppm,精度要求0.2-0.4ppb, 这类的应用场景，脉冲激光光源显然不是很适合随身携带）。CEAS相对于CRDS有几个共同点和不同点： 共同点： 同样利用高精度光腔低损耗的特点，让入射光在光腔中反复来回来达到增长有效增强吸收长度（光于样品反应的距离）的目的。 同样使用高精度光腔纵模带宽窄的特点，达到高光谱分辨率的特点 不同点： CRDS在检测端是测量光在腔体内的衰减时间，然后通过调制激光的波段来对光腔的纵模进行扫描，每一个纵模会取多个衰减时间进行平均，得到该频率入射光在腔体内的损失信息（镜片损失和样品吸收损失），从而得出样品吸收信息vs光频率的样品吸收谱，而CEAS技术中，由于使用CW光源，并且光源持续射入光腔，（注意CW-CRDS也使用CW光源，但是并不是持续射入）衰荡光腔此时的作用更像一个etalon池, 就是一个Fabry-Perot干涉器，允许特定波长（相长干涉频率）的光源进入，并且理想情况下如果光源特定波长带宽与光腔纵模带宽一致并且腔镜反射率达到100%，那么通过的光强度只会受到样品吸收反应的影响，不受吸收反应影响的波段入射光的透过率能够达到100%，此时调制光源波段使其扫过目标吸收光谱波段，在检测端就可以得到梳妆光谱，此时的梳妆光谱的每一个山峰是代表单位时间内特定波长CW光源通过光腔的光子个数的集合，故CEAS又名ICOS（integrated-cavity-output spectroscopy），很多学术会议使用ICOS而不用CEAS来命名。 下图是OF-CEAS技术的梳妆吸收光谱图，可以看到在1400到1700数据点附近有一个水分子的吸收峰。关于OF-CEAS作为CEAS技术的更新版本，我们会在第三章中集中介绍。 非常明显，对比CRDS技术，CEAS技术不需要复杂的光学开关来快速操控光源，并且检测器的选择上也不再需要特别快的采样速度，这大大简化了设备的搭建难度。但是就是在CRDS/CEAS不同点里提到的，只有在理想状态下，入射光源的通过率才会达到100%，现实情况中，CW光源的带宽远宽于光腔的纵模带宽，这使得一大部分入射光强被腔体拒之门外，这使得最后在检测端的信号非常低，并且相对于CRDS这种测量时间的技术，CEAS直接测量光的强度，测量精度很受入射光强度波动所影响。单纯讲到灵敏度，CRDS还是略胜一筹，一般能达到$ 10^{-10} $ ~ $ 10^{-11} $ $ cm^{-1} $ $ Hz^{-0.5}$而CEAS只能到达到 $ 10^{-8} $ ~ $ 10^{-9} $ $ cm^{-1} $ $ Hz^{-0.5}$)。尽管如此，CEAS技术由于它的设备架构简单，使它能够在实际应用中被做成可携带设备，实现了从实验室到工业应用的目的。 在第三章中，笔者想讲一讲最新应用到低浓度高精度气体检测工业界的技术：光学反馈CEAS（OF-CEAS）。 Reference本系列文章主要参考于 《Cavity Ring-Down Spectroscopy Techniques and Applications》，作者：Giel Berden, Richard Engeln 《Cavity-Enhanced Spectroscopy and Sensing》， 作者：Gianluca Gagliardi, Hans-Peter Loock 光于本文作者Jenkins：笔者光学背景，对光学最早产生兴趣来自于光谱学，研究生毕业以后来到美国中西部的一家气体监测设备产商任职，主要负责研发OF-CEAS 光谱可携带仪器，用于监控土壤的温室气体痕量检测，笔者想结合自己的经历以及这两本工作上的启蒙教材比较详细的介绍高灵敏度高精度的现代吸收光谱学计量方法。有兴趣的朋友可以加微信：Jenkins123 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光谱学","slug":"光谱学","permalink":"https://faster-than-light.net/categories/%E5%85%89%E8%B0%B1%E5%AD%A6/"}],"tags":[{"name":"专题","slug":"专题","permalink":"https://faster-than-light.net/tags/%E4%B8%93%E9%A2%98/"},{"name":"光谱学","slug":"光谱学","permalink":"https://faster-than-light.net/tags/%E5%85%89%E8%B0%B1%E5%AD%A6/"}]},{"title":"光学新闻 20220527","slug":"OpticsNews20220527","date":"2022-05-27T14:30:00.000Z","updated":"2022-05-27T14:13:04.467Z","comments":true,"path":"OpticsNews20220527/","link":"","permalink":"https://faster-than-light.net/OpticsNews20220527/","excerpt":"近两周的五篇光学新闻： Veoneer给BMW Group提供下一代自动驾驶视觉系统相机 — NASA衍射太阳帆 — eMagin基于Steamboat电路板的全彩4K Micro-OLED显示屏 — 横向色散超构表面透镜实现光场光谱动态成像— Harvard大学钻石反射镜反射10kW激光束","text":"近两周的五篇光学新闻： Veoneer给BMW Group提供下一代自动驾驶视觉系统相机 — NASA衍射太阳帆 — eMagin基于Steamboat电路板的全彩4K Micro-OLED显示屏 — 横向色散超构表面透镜实现光场光谱动态成像— Harvard大学钻石反射镜反射10kW激光束 Veoneer给BMW Group提供下一代自动驾驶视觉系统相机评论：自动驾驶公司Veoneer已经和BMW集团签订协议，提供下一代的自动驾驶视觉系统的相机，该合作包括Veoneer，BMW，高通以及Arriver（主要是做传感和交通规则的软件部分）。Veoneer公司这次合同中会提供的是8MP的相机，装在后视镜上，用来监控前方道路。在BMW的下一代自动驾驶系统中，现在的辅助驾驶是使用Arriver的视觉感知和NCAP（欧盟新车安全评鉴协会）标准，使用高通的system on chip的计数。Veoneer的相机系统可以适应现在的中心化和规模化的软件控制架构，可以成为整体自动驾驶平台的一部分。 新闻稿 NASA衍射太阳帆评论：衍射太阳帆项目被选中进入示范任务，该项目来源于NASA的创新高级概念的第三期研究。如同在海上用帆船航行一样，太阳帆使用光压让太空器飞行，现阶段的田扬帆是巨大的轻薄的反射型，这种帆受太阳光的方位限制，被迫在功率和方位之间做协调。衍射太阳帆使用小型光栅集成进帆中，可以让太阳帆在不牺牲机动性的情况下更高效的工作。第三期研究的奖项会给予研发团队200万美元的研发资金用于准备未来的示范任务。 新闻稿 eMagin基于Steamboat电路板的全彩4K Micro-OLED显示屏评论：Display Week 2022大会中，微型显示器制造商eMagin展示了了2.1英寸全彩4K（3600×4000，2600PPI），刷新率120Hz的Micro-OLED产品，亮度测量值最高可达11300尼特（低功率模式为1000你特），该显示屏是展示过的最高像素的OLED显示屏。该屏幕采用了一个名为“Steamboat”的电路板，该公司透漏该显示屏是为了展示一款VR头显原型机设计制造的，合作商是一家大公司，网友们猜测是Valve。下图这个散热模块非常瞩目了。eMargin的OLED可以达到2646ppi，而传统的手机显示屏OLED只有577ppi。对于一个VR头显来说，如果要实现视网膜分辨率，需要达到60pixel/degree。 新闻稿 横向色散超构表面透镜实现光场光谱动态成像评论：来自南京大学、哈尔滨工业大学和香港城市大学的研究人员提出了一种微型化光场光谱动态成像系统。该研究从计算摄像学的理念出发，将超构表面器件的色散效应进一步扩大，协同解耦算法计算成像，首次实现了微尺度条件的光场光谱动态成像，就是既有光场信息，又有光谱信息，而且器件大小还非常小。下图展示了Metalens的设计和色散情况，以及白光照明下对于“4”的成像。该技术可以用于同色异谱的物体检测，可以有效和便捷的运用于材料识别和伪装鉴别。 论文 Harvard大学钻石反射镜反射10kW激光束评论：美国海军的测试展示了一种新型的单材质表面承受住了连续激光器的高功率输出。现阶段的大部分的高功率连续激光的反射镜都是使用多层镀膜，但是只要这个镀膜上有一点点缺陷，就可能被高能激光烧毁造成整个器件损坏。哈佛大学工程和应用科学的研究者们使用了这个星球上最强的物质制造了一种反射镜，通过在钻石表面蚀刻微结构，该团队制造出了可以反射10kW功率的连续激光的反射镜。下图二a,c展示了该反射镜的结构，b为传统镀膜结构，d为对于不同入射角和波长的反射率，e展示了驻波波形。 论文 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"光学新闻 20220515","slug":"OpticsNews20220515","date":"2022-05-15T06:30:00.000Z","updated":"2022-05-15T06:27:41.656Z","comments":true,"path":"OpticsNews20220515/","link":"","permalink":"https://faster-than-light.net/OpticsNews20220515/","excerpt":"近两周的五篇光学新闻： 谷歌宣布收购MicroLED显示技术创企Raxium — Innoviz再获大厂40亿美元激光雷达订单 — 国际首款实时超光谱成像芯片 — MIT开发出一种创新的薄镜面及晶圆精确成型制造方法— 上海光机所米级光栅新技术","text":"近两周的五篇光学新闻： 谷歌宣布收购MicroLED显示技术创企Raxium — Innoviz再获大厂40亿美元激光雷达订单 — 国际首款实时超光谱成像芯片 — MIT开发出一种创新的薄镜面及晶圆精确成型制造方法— 上海光机所米级光栅新技术 谷歌宣布收购MicroLED显示技术创企Raxium评论：谷歌正式宣布Raxium将加入谷歌的设备与服务团队。这是继2020年智能眼镜厂商North之后的又一重要硬件并购案，但双方均未公布具体的交易细节，但是早前有消息称Raxium估值达到10亿美元。Raxium一直专注于开发“世界性能最高的超高密度单片RGB µLED显示器”。换句话说，团队致力于Micro-LED的单片集成，希望能够在用于生产大多数微芯片的同一标准廉价硅制造它们。如果成功，这种方法将能大大降低成本，并实现“一种体积更小，功能更强的显示器产品，包括AR/VR微型显示器和光场阵列”。Raxium在官网中指出，与大约每像素50um的SUPER AMOLED相比，他们的uLED产品仅为大约每像素3.5um，”300x 更小，1000x更亮，而且能耗&lt; 50% ”。与其他显示技术相比，Micro-LED更亮，更小，更轻，更高能耗，续航能力更长。它们有望在增强现实/虚拟现实头显或平视显示器中取代OLED。 其他公司也有类似的动作： Meta是和Plessey达成合作，Plessey向Meta授予IP独家许可权。 Snap是有意向收购Compound Photonics。 苹果在这个领域一般不太会去收购某家企业，个人认为一是苹果在核心领域作为大型公司对可能产生垄断相关的问题的收购都非常谨慎，通常愿意只收购一些初期的小团队而不是成熟企业；二是苹果的产品规模上决定了它需要等待某些技术开始进入相对大规模话和产业化的条件后才会开始发售，这个时期的零部件供应商选择已经开始多了起来，苹果是非常在意供应链稳定性的。 Raxium官网 Innoviz再获大厂40亿美元激光雷达订单评论：全球领先的高性能激光雷达传感器和感知软件供应商Innoviz近日宣布，全球最大的汽车制造商之一与Innoviz建立合作，Innoviz将成为其多个品牌的激光雷达直接供应商。经过了两年多的广泛深入的车规级验证，Innoviz获得了第三个具有重大里程碑意义的design win，该笔交易的订单价值预估为40亿美元-66亿美元。该公司还表示，在此次合作中，他们是将直接向汽车制造商提供LiDAR传感器，而不是通过一级供应商。另据透露，这家汽车企业占据汽车市场约10%的份额。Innoviz首席执行官兼联合创始人Omer Keilaf表示，”被一家全球汽车制造商巨头选中，对Innoviz来说是一个重要的里程碑。我们预计，随着该集团更多的汽车品牌采用我们的方案，这项交易的规模将进一步扩大。此外，我们预计更多的汽车制造商也将在自动驾驶汽车项目中采用我们的方案。” Innoviz现阶段的主要生产固态激光雷达以及响应算法，该新闻对于Lidar行业是个很大的提振。预估该合作应该是会进行一些定制化设计。 新闻稿 国际首款实时超光谱成像芯片评论：清华大学电子工程系黄翊东教授团队崔开宇老师带领学生研制出国际首款实时超光谱成像芯片，该团队利用硅基超表面实现对入射光的频谱域调制，CMOS图像传感器进行频谱域到电域的投影测量，再通过压缩感知算法进行光谱重建，并进一步地，通过超表面的大规模阵列集成实现实时光谱成像。该研究对比起传统的光谱仪最大的意义在于实时，把原来的&lt;1Hz的光谱扫描频率提升到了30Hz的实时帧率，最高甚至可以达到1000Hz。这对于一些需要快速检测的场景可能有很大的意义。 相关成果已进行产业化，创立了光谱芯片成果转化企业北京与光科技有限公司，获数亿元融资，入选2021创业邦100未来独角兽，VENTURE50新芽榜，2021年中关村国际前沿科技创新大奖-集成电路领域TOP 10。 这一年多有好几条类似的新闻，包括：西班牙公司Spectricity(光学新闻 2021080)，以及与光科技完成Pre-A轮融资（光谱芯片初创公司与光科技完成数亿元Pre-A轮融资）等，主要是应用在哪里会是最主要的问题，该种技术的光谱分辨能力不是很强，研究类应用很难，不过可能可以用于一些生活场景的低精度要求的检测。与光科技官网提出的几个应用：拍照优化（色温管理，图像分割）；健康管理（皮肤检测，食品检测）；机器视觉里的颜色管理，LED，LCD检测，物质检测；自动驾驶里的身份是被和障碍物识别与避让。这些应用有一些已经有解决方案去完成了，新的解决方案的优势不是很明显：比如拍照的色温管理Ambient light sensor就是简单的不同滤光片对应几个sensor pixel就可以了，健康；或者有一些精度可能不太能确信：比如皮肤检测，感觉完全就是玄学。不过，根据改论文，该种芯片对于快速工业检测，可能有比较多的应用。 论文 MIT开发出一种创新的薄镜面及晶圆精确成型制造方法评论：MIT的研究者们开发了一种方法，可以更好的制造薄镜面及晶圆，这类部件很容易收到镀膜和加工方法产生的应力影响，造成其发生翘曲等变形，虽然在宏观尺度上，这些变化非常小，但是对于光学应用或者集成电路来说，是致命的。在MIT的该方法中，研究者们在晶圆的背面进行一些加工和处理，人为的制造一些结构来消除应力，最终使整体平面度更好。首先在光学表面衬底背面涂上一层由二氧化硅等材料制成的高应力薄膜。新的应力模式通过平版印刷到薄膜中，这样研究人员就可以在特定区域改变材料的特性。在不同区域选择性地处理薄膜涂层，可以控制应力和张力在表面上的施加位置。由于光学表面和涂层是粘合在一起的，因此控制涂层材料也会相应地重塑光学表面。研究者团队说：“我们不是为了重塑形状而增加应力，而是通过精心设计的几何结构（如点或线），在特定方向上选择性地消除应力。这是一种在反射镜中的某个位置释放目标应力的特定方式，进而可以弯曲材料。” 基本结构如下图a所示，同时研究者们提出了几种方式，如下图d,e,f所示，通过排列这些带着凹槽的结构，可以人为的控制应力的分布。 下图展示了补偿前后晶圆和设计值间的差异。 几个想法： 有些时候，真的一些想法来自于非常简单生活中常见的方法，这种方法和我们用几个木棍撑起一个风筝，或者塑料结构上的加强筋，做爆炒腰花切割刀花等方法，本质上是一件事情。 该种方法对于晶圆类产品，适用于单面加工的，或者双面加工完成后进行最后的补偿，未来的算法开发完善后，甚至可以在某一个阶段对于不同晶圆进行不同补偿。 还有一个问题就是是否普通应用需要如此的补偿和精度，这部分可能需要更多的调研， 论文 上海光机所米级光栅新技术评论：上海正在研制的百拍瓦级超短超强激光装置是上海建设具有国际水平的科创中心的标志性建设内容张江光子大科学装置集群的重要装置之一。其中，尺寸需要达到1.6m×1.05m（双向米级，对角线接近2米）的脉冲压缩光栅是系统的关键器件，也是支撑装置确保实现国际领先水平仍然存在的“卡脖子”技术之一。目前，国内外现有的光栅制备技术上包括机械刻划、细光束扫描拼接曝光、透射静态干涉场曝光等现有技术都达不到制备如此双向米级大尺寸光栅能力。 中国科学院上海光学精密机械研究所提出了利用大口径离轴反射曝光系统制作米级脉冲压缩光栅的创新方案，其核心是利用2个大口径高精度的离轴抛物面反射镜形成两束平行光大范围构造均匀的曝光光场。除上海光机所报道过小口径反射式曝光技术外，国际上至今没有报道过利用反射式曝光技术成功制作衍射光栅的先例。全口径大面积反射式静态曝光技术是引领大口径静态曝光技术的创新方案，将推动我国的大口径高精度超低缺陷离轴反射镜加工技术进步，若能研制成功将是世界上的第一次实现，形成国际上独一无二的大口径光栅制备能力，为我国超短超强激光技术发展提供持续有力支撑。为实现满足衍射光栅制作要求的曝光光场均匀性，需要离轴抛物面镜表面宏观至微观的全频段误差均需达到纳米级。但大口径离轴抛物面镜具有的变曲率、大离轴量等特点，其全频段误差一致收敛加工一直是业界的难点。全频段误差一致收敛加工通俗来讲，就是要将镜子上面的各种凹凸不平的东西都要消除，让镜子保持“极致”光滑状态；如果做不到这一点，反射后的光场一定会出现不均匀性情况，就不可能造出好光栅。所谓“极致”光滑，根据光场理论反演推算，若是把这面镜子放大到上海市大小，其“最高峰”相当于要控制在2mm以下；而对于镜子上10mm空间周期以下的误差，米级元件任一区域误差起伏要求控制在1纳米以内，相当于头发丝直径的五万分之一；如此大口径元件在全空间频段均达到纳米/亚纳米级的制造精度称得上是人类制造皇冠上的明珠。上海光机所项目组团队经过1年多的努力攻关，发明了极窄边缘效应一体式柔性研抛技术与装备、无轨迹波纹非正交磁流变抛光技术、计算机全息位相板检测、大镜低应力支撑等系列创新技术。 上光所这台米级脉冲压缩光栅，用于的超短超强激光装置，有着重要的科学研究意义，比如可控核聚变需要此类激光装置。 脉冲压缩光栅是啁啾脉冲放大技术（CPA）的核心部件，应用于皮秒、飞秒超短脉冲激光器，光栅衍射效率、激光损伤阈值对于激光器性能至关重要。尤其在超强超短脉冲激光器中，对脉冲压缩光栅的衍射效率、激光损伤阈值和尺寸的苛刻要求是普通商业光栅所远远不能满足的。系统原理如下图所示，脉冲压缩光栅充当展宽器和压缩器。 新闻稿 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"光学新闻 20220502","slug":"OpticsNews20220502","date":"2022-05-02T10:30:00.000Z","updated":"2022-05-02T10:08:11.774Z","comments":true,"path":"OpticsNews20220502/","link":"","permalink":"https://faster-than-light.net/OpticsNews20220502/","excerpt":"近两周的五篇光学新闻： Vivo X80 / Pro 正式发布 — Porotech展出全球首款InGaN 基红光Micro LED 显示器 — SensiBel光学MEMS麦克风 — 基于超构透镜集成的平面广角相机— 一款拥有极限成像景深的超构透镜光场相机","text":"近两周的五篇光学新闻： Vivo X80 / Pro 正式发布 — Porotech展出全球首款InGaN 基红光Micro LED 显示器 — SensiBel光学MEMS麦克风 — 基于超构透镜集成的平面广角相机— 一款拥有极限成像景深的超构透镜光场相机 Vivo X80 / Pro 正式发布评论：4 月 25 日的发布会上，vivo X80 系列正式发布。其中基础版的 vivo X80 标准版搭载联发科 4nm 旗舰芯片天玑 9000（Pro 是天玑 9000、骁龙 8 双版本），配备 V1+ 自研影像芯片。我们主要关注影像方面，其中值得关注的有IMX866首发的RGBW大底传感器，Pro配备的人像微云台，ALD镀膜技术等。Vivo 表示，通过吸取第一代自研芯片 V1 的调教经验，用 X80 为大家带来全新自研芯 V1+，它既是一颗影像芯片，又是一颗独显芯片，配合天玑 9000 组成第二代双芯旗舰。 观察这两年的手机，镜头这里是越来越难突破和创新了，这是分久必和的时期，镜头的数量基本到头了，质量也都达到了一个不错的高度，what next？ 新闻稿 Porotech展出全球首款InGaN 基红光Micro LED 显示器评论：英国剑桥大学衍生的Micro LED 公司Porotech 去年在微型显示器技术大突破，于今年Touch Taiwan 2022 发表全球第一套氮化铟镓（InGaN）基的红光、蓝光、绿光的Micro LED 显示器，解析度为1,920 x 1,080，亮度至少可达200 万尼特（≥ 2M nits）。Porotech是工业界第一家展示出用一种材料和工具链实现三种颜色的公司，他们依赖的是其专利技术平台PoroGaN™，其中原生的红色InGaN显示。该公司的技术可以实现三种颜色都达到高亮度高效率和小型化。 Micro LED会是近几年AR，VR的必争之地。 新闻稿 SensiBel光学MEMS麦克风评论：MEMS麦克风创新厂商sensiBel近日宣布完成1500万欧元A轮融资，此轮融资由德国TRUMPF Venture领投，其他投资方包括欧洲理事会EIC Fund、Skagerak Capital、Investinor和SINTEF Venture IV。sensiBel计划利用这笔资金扩大生产。传统电容式MEMS麦克风关键参数的改进已经达到了极限。sensiBel申请专利的光学MEMS技术基于干涉和衍射光学现象，这两种现象都源于光的波动特性。简单来说，sensiBel的光学MEMS麦克风通过利用一颗微型低功耗VCSEL激光器，结合一个微型集成干涉仪，可以极其精确地测量硅基振膜的运动。整个光学系统的尺寸实际上不到一个立方毫米。这种超低自噪声读出原理，使其麦克风具有很高的信噪比（SNR）和声学过载点（AOP），并且还在非常小的MEMS封装中实现了低功耗。 Trumpf作为VCSEL生产商投资这个企业完全说得通，不知道这个改变对于传统声学企业有何影响，对于生产，这种零部件可能需要光学和声学的双重校准，专利上是否使用这种方案可能需要看终端公司的态度，成本也是需要考量的一个因素。 新闻稿 基于超构透镜集成的平面广角相机评论：南京大学李涛教授、祝世宁院士的研究团队研发出一种基于超构透镜阵列的平面广角相机，仅用亚微米厚的单层超构透镜阵列就实现了超过120°视角高质量的广角成像功能。该工作充分发挥了超构透镜超轻、超薄的优势，结合团队之前开发的超构透镜与CMOS成像芯片，整个平面广角相机相较商用鱼眼镜头在体积和重量上具有巨大优势（下图b平面广角相机的尺寸约1 cm×1 cm×0.3 cm）。李涛教授团队提出了一种基于超构透镜阵列的广角成像方案。其实现原理是对阵列中的每个透镜相位进行精心设计，在双曲聚焦相位的基础上附加一定的角度修正项，使得每个透镜可以对一定角度范围内的入射光高质量聚焦。阵列中所有透镜负责的角度范围可以覆盖120°的视角范围，然后通过将每个透镜的子图像拼接可以得到完整的广角成像。 重点在于拼接，牺牲空间，用多个透镜换视场角，这么个思路的话，普通相机用复眼睛式的镜头也可以实现，不过Metalens的好处就是它是平的。 论文 一款拥有极限成像景深的超构透镜光场相机评论：南京大学，马里兰大学帕克分校，NIST的研究者们联合工作，借鉴古代三叶虫的复眼结构，实现了一款拥有极限成像景深的超构透镜光场相机，下图展示了三叶虫的复眼结构。 该相机可以同时以一个清晰的视角，来拍摄距镜头距离30 mm至1.7公里范围内的所有物体。同时，为了进一步提高相机的视觉效果，研究人员还设计了一套完备的算法，用高性能计算机对拍摄所得的图像进行色差矫正，能够同时精确识别物体在视场中的远近位置，实现对于不同位置物体轮廓的锐化，助力覆盖巨大景深范围全聚焦图像的生成。 该相机采用了纳米加工的技术手段，基于超表面结构，搭建出精确排布的超透镜阵列(Matelens Array)，同时结合多层的卷积神经网络算法，对像差进行进一步的优化。该相机的物理结构表征如下图a所示，光线需要依次通过主透镜和超透镜阵列，最终才能被传感器平面所捕获。b图中可以看到，超透镜阵列专门用于对光的状态进行调整，包括光束的偏振状态及其他特性。而这种结构一般会包含数以百万计的纳米柱，纳米柱被镶嵌或刻蚀在平坦的玻璃表面，构成了性能指标极佳的超平面，这种超平面有助于实现高精度的光学成像。最下图展示了对于30mm到1.7公里范围内的成像质量，非常的好。 近期无论是神经网络和超透镜的要求，都有一种感觉，就是几何光学，衍射光学，神经网络的结合。不像以前镜头做镜头的事情，sensor做sensor的事情，现在整体的imaging pipline被集成在了一起，所有元器件被放在一起设计并优化，最终实现一个更加好的结果。 论文 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"光学新闻 20220416","slug":"OpticsNews20220416","date":"2022-04-16T09:30:00.000Z","updated":"2022-04-16T14:49:36.329Z","comments":true,"path":"OpticsNews20220416/","link":"","permalink":"https://faster-than-light.net/OpticsNews20220416/","excerpt":"近两周的五篇光学新闻： 灵明光子完成数亿元C轮融资 — Lumentum推出M系列高性能多结VCSEL阵列 — 微软Surface Hub 2 Smart Camera— 我国成功研制105亿年偏差不到1秒的光频标— Glass-in-Glass制程","text":"近两周的五篇光学新闻： 灵明光子完成数亿元C轮融资 — Lumentum推出M系列高性能多结VCSEL阵列 — 微软Surface Hub 2 Smart Camera— 我国成功研制105亿年偏差不到1秒的光频标— Glass-in-Glass制程 灵明光子完成数亿元C轮融资评论：近日，灵明光子完成数亿元C轮融资，领投方为美团龙珠，老股东昆仲资本和高榕资本继续加注，光源资本担任独家财务顾问。融资完成后，公司将加速推进产品量产，并继续在先进领域投入研发，保持技术领先性。灵明光子致力于用国际领先的单光子探测器（SPAD）技术，为智能手机、激光雷达、机器人、AR设备等提供自主研发的高性能dToF深度传感器芯片。自2018年成立以来，灵明光子已迅速完成多轮融资，并引入小米、OPPO、欧菲光等产业资本，显示出市场对于灵明光子dToF芯片研发能力和应用前景的看好。灵明光子专注dToF技术，拥有极高的核心技术壁垒。公司掌握国际领先的SPAD器件设计和工艺能力，基于波长905nm处的单光子探测效率（PDE）达到25%，为世界纪录级别，远超行业平均的5%-18%，可以实现探测距离更远、功耗更低、体积更小。同时，灵明光子也拥有国内唯一、全球稀缺的成熟3D堆叠dToF芯片设计和工艺能力，并已成功研发多款3D堆叠SPADIS芯片。 灵明光子主要是做dTOF相关的芯片部分，并发布了多种基于自己芯片技术的参考设计。dTOF在国内的市场逐渐增加，手机上的使用还是缺乏一些基础，但是非手机的应用上开始有很多的机会。不过灵明光子要面对AMS，ST等公司成熟产品的竞争，需要找到自己的产品路线和渠道。 新闻稿 Lumentum推出M系列高性能多结VCSEL阵列评论：Lumentum推出M51-100，70W 905nm多结VCSEL阵列，是用于下一代车载激光雷达和工业3D的解决方案。整体阵列小型化，适用于中短距离LiDAR方案。该VCSEL可以很好地放入机械旋转式Lidar结构中并进行升级，或者组合进定制化的可寻址的固态LiDAR。M51-100是M系列（多结）的一种，用于未来LiDAR，以提供高质量，低成本的解决方案。重要参数如下 0.19 mm^2 的chip size 70 W (25°C, 2 ns PW, 0.03% DC) &gt;4.8 W/A 效率 IATF和AEC-Q102认证 多结VCSEL是在一个VCSEL Mesa中做出多个pn结，这种方式可以提高单一发光点的峰值功率。 产品页 微软Surface Hub 2 Smart Camera评论：微软为Surface Hub 2开发了一款新的AI Camera “Smart Camera”，该Camera使用了定制的镜头，AI模型，边缘计算等，可以提供4K的影像。镜头是一个11镜片的f/1.8全玻璃镜头，接近衍射极限的性能，配合12MP(4000x3000)的传感器。Camera可以达到136°FOV，镜头FOV达到了184°。这款camera的性能看起来非常不错，虽然价格看起来比较贵$799，但是如果考虑到使用场景是商业场景的大型会议室，而且Surface Hub 2的50英寸的产品为$9000，85英寸的产品为$22,000，那么，升级到这款Camera就感觉非常值了。 新闻稿 我国成功研制105亿年偏差不到1秒的光频标评论：近日，中国科学院精密测量科学与技术创新研究院高克林研究团队成功研制105亿年偏差不到1秒的钙离子光频标，成为国际上第五种不确定度指标达到10-18量级的光频标。相关研究成果已发表于国际学术期刊《应用物理评论》。当前世界测量精度最高的物理量是光频，最高精度已达10-18量级。其中原子光频标是光频精密测量的典型代表，是目前准确度最高的原子频标。截至目前，国际上仅有锶原子光频标、镱原子光频标、铝离子光频标以及镱离子光频标等四种原子光频标的不确定度达到了10-18量级。精密测量院高克林研究团队从2000年开展钙离子光频标的实验研究，通过解决抑制离子运动效应、解决超窄线宽激光、实验环境影响精确控制等一系列关键科学和技术问题，于2011年成功研制国内首台光频标，不确定度为7.8×10-16， 2016年将光频标的不确定度提升至5.1×10-17， 2019年将钙离子光频标的不确定度提升至1.3×10-17。经过科研攻关，研究团队解决黑体辐射频移、多普勒频移、微运动效应、电四极频移等影响钙离子光频标不确定度的关键物理问题与技术难题，最终在国际上首次实现了液氮低温钙离子光频标，不确定度达到3×10-18。专家介绍，高精度光频标有助于提高基本物理量的定义、基本物理定律检验等的精度，从而推进基础物理研究，探索新物理；同时在时间基准、相对论大地测量、导航定位等方面具有广泛的应用场景。 这种新闻就是不明觉厉型的，论文也读不懂，不过就是感觉很厉害。左图是中国科研团队的光频标原理图，右图是英国UK National Physical Laboratory (NPL)的锶光学原子钟，它的核心也是一个锶光频标。 论文 Glass-in-Glass制程评论：几个世纪以来，科学家和工匠门都在尝试结合两种不同的玻璃以实现单一玻璃无法独自实现的功能，最常见的方式就是把两种玻璃采用胶合或者叠加的方式结合到一起，比如消色差透镜或者装饰玻璃。瑞士的研究者们研究了一种新的熔渗（infiltration）方法，可以将硫系玻璃融入石英玻璃制程的腔体内。研究者们认为这种制程可以让使用于成像，传感以及光谱测量设备的微型红外光学零部件的制造变得更加容易。硫系玻璃在光学中有着非常多的应用，因为器在红外波段有着非常好的透过性，其高折射率以及高非线性也使它们非常受到光子电路，可重写光学介质以及其他光学产品的欢迎。但是硫系玻璃非常易碎且容易老化，其中的一些非常容易收到水汽影响，有一些还有毒。 瑞士研究者们开发的这种制程类似于金属熔渗方法，见下图，（a）首先使用飞秒激光器轰击石英玻璃基底（b）然后将部件浸入氢氧化钠溶液几个小时实现化学蚀刻流程，实现空腔结构，类似一个模具，可以看到模具上的注入孔（c）将这个模具上面放置一个商用硫化亚砷玻璃块，放入真空腔，缓慢加热至600 °C。 下图展示了该种方法可以实现的微小结构和复杂结构，这种制程可以应用于3D光波导，中红外光谱仪等产品和设备中。 论文 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"光学新闻 20220410","slug":"OpticsNews20220410","date":"2022-04-10T14:00:00.000Z","updated":"2022-04-10T13:44:19.393Z","comments":true,"path":"OpticsNews20220410/","link":"","permalink":"https://faster-than-light.net/OpticsNews20220410/","excerpt":"近两周的五篇光学新闻： DigiLens完成D2轮融资 — Mojo Vision宣布AR隐形眼镜重大进展 — Insight柔性触觉传感器 — 迄今像素最高的固态激光雷达— 中科院物理所研制出拓扑腔面发射激光器（TCSEL）","text":"近两周的五篇光学新闻： DigiLens完成D2轮融资 — Mojo Vision宣布AR隐形眼镜重大进展 — Insight柔性触觉传感器 — 迄今像素最高的固态激光雷达— 中科院物理所研制出拓扑腔面发射激光器（TCSEL） DigiLens完成D2轮融资评论：全息波导厂商DigiLens日前宣布，已完成D轮融资的第二阶段，新增特殊玻璃和陶瓷材料厂商康宁和歌尔股份参投基金Optimas Capital Management。不过，团队未公布D轮融资第二阶段的金额，只表示目前公司当前的估值现已超过5.3亿美元，两次D轮融资金额超过5000万美元。DigiLens 在CES 2022大会上发布了新一代的近眼光学技术：全彩Crystal30第二代波导，有30°的对角视场角，12mm x 10mm的eye box，厚度大概为3mm。 新闻稿 Mojo Vision宣布AR隐形眼镜重大进展评论：AR隐形眼镜厂商Mojo Vision日前发布了全新的Mojo Lens原型，并表示这是“世界首款真正的智能隐形眼镜”。这家公司指出，所述原型融合了一系列的业界首创功能，包括世界尺寸最小、密度最大的动态显示器、低延迟通信功能和眼控用户界面。接下来，团队将以其为基础，进一步开发、测试和迭代新的隐形计算体验，从而为人们的日常任务和关键任务需求带来帮助。全新的Mojo Vision原型融合了一系列的业界首创功能，包括世界最小、最密集的动态显示器、低延迟通信功能，眼动追踪，医用电源系统和眼控用户界面。不过还是有很多人包括笔者对这个技术方案有所怀疑，包括这东西如何能放进眼睛里保证舒适性，电源维持等等。 新闻稿 Insight柔性触觉传感器评论：来自德国马克斯普朗克智能系统研究所（Max Planck Institute for Intelligent Systems）的研究团队开发出一款拇指大小的柔性触觉传感器，名为“Insight”。该传感器基于机器视觉和深度神经网络技术，能够实现全方位的触觉感应，准确推断出物体位置及力信息。该研究成果已发表于Nature Machine Intelligence期刊。Insight触觉传感器具备独特的机械设计结构，研究团队采用了一种围绕着轻质刚性骨架的软壳作为整体支撑结构，并在外壳弹性体中混合了深色且反光的铝片，使其呈不透明灰色状，以防止外部光线进入。隐藏在这个结构内的是一个微型160°鱼眼摄像头，在一圈LED灯的照射下可进行彩色图像记录。研究团队通过实验对Insight触觉传感器的姿态识别，以及其对微妙触觉刺激的敏感度进行了定量评估，证明了其出色的性能。它的定位精度可达0.4mm，力精度约为0.03N，力方向精度约为5°，可适用于具备不同接触面积的各种触觉探测。 论文 迄今像素最高的固态激光雷达评论：美国加州大学伯克利分校（University of California, Berkeley）电气工程和计算机科学系吴明强（Ming C. Wu）教授团队设计了一个集成激光雷达（光探测和测距）系统，能以高分辨率测量距离，具有大视场角，同时还保持了小面积和低功耗。他们将焦平面开关阵列（FPSA，Focal Plane Switch Array）集成到 1平方厘米的芯片中，实现了16384（128×128）像素尺寸，这是迄今为止文献报道中最大规模的焦平面开关阵列。实验中研究人员还通过将焦平面开关阵列与 FMCW 测距结合，实现了三维成像，验证了 10 米的测距距离，距离分辨率达 1.7 厘米。从灵活性角度来看，该团队用使用焦平面开关阵列做光束扫描，光的扫描范围和角分辨率可通过采用不同镜头的方式进行调整。这与现在的相机相似，通过使用不同参数的镜头，相机可以实现各种不同的拍摄视角和分辨率。基于同样的原理，使用同一个焦平面开关阵列芯片，可以利用不同的镜头，实现不同的光束扫描范围和分辨率。清华大学付红岩副教授、北京大学李倩副教授同期在 Nature 发表了评论文章。他们认为，该工作在集成激光雷达系统方面提供了突破。随着加工技术的成熟，进一步的小型化和性能的改进，将使焦平面开关阵列成为一种很有前途的技术，其应用领域包括百万像素 3D 激光雷达和光通信。 论文 中科院物理所研制出拓扑腔面发射激光器（TCSEL）评论：中国科学院物理研究所/北京凝聚态物理国家研究中心光物理重点实验室L01组陆凌团队成功研制出了拓扑腔面发射激光器（TCSEL）， 得到了远超同类商用产品的指标和性能。中国科学院物理研究所/北京凝聚态物理国家研究中心光物理重点实验室L01组陆凌团队，之前提出了一种“狄拉克涡旋”拓扑光腔，是已知大面积单模性最好的光腔设计，可以从原理上突破现有瓶颈，同时提高出射功率和光束质量。最近，他们将原创的拓扑光腔应用于面发射半导体激光器中，研制出了拓扑腔面发射激光器（TCSEL）， 得到了远超同类商用产品的指标和性能（见图一中的比较）。在1550nm这一最重要的通信和人眼安全波段，同时实现了单个器件10W峰值功率、小于1°的远场发散角、60dB边模抑制比，和二维多波长阵列的集成能力。TCSEL的发明对于人脸识别、自动驾驶、虚拟现实所需的三维感知和激光雷达等新兴技术有重要意义。 论文 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"TOF系统 第六章 电路系统","slug":"TOF系统 第六章 电路系统","date":"2022-04-05T10:30:00.000Z","updated":"2022-04-05T10:01:05.403Z","comments":true,"path":"TOFSystem_C6/","link":"","permalink":"https://faster-than-light.net/TOFSystem_C6/","excerpt":"本章主要介绍TOF系统中的电路系统，包括iTOF和dTOF的电路系统，将使用两个实际TOF产品作为例子进行说明，其中dTOF系统将使用ST的VL53l5CX作为例子；iTOF系统将使用TI的OPT8241 3D Time-of-Flight Sensor以及配套的OPT9221 Time-of-Flight Controller和开发板电路进行介绍。由于作者本人不是电子工程专家，本章主要是在系统和模块级别进行一定的介绍和分析。","text":"本章主要介绍TOF系统中的电路系统，包括iTOF和dTOF的电路系统，将使用两个实际TOF产品作为例子进行说明，其中dTOF系统将使用ST的VL53l5CX作为例子；iTOF系统将使用TI的OPT8241 3D Time-of-Flight Sensor以及配套的OPT9221 Time-of-Flight Controller和开发板电路进行介绍。由于作者本人不是电子工程专家，本章主要是在系统和模块级别进行一定的介绍和分析。 回顾TOF系统：第一章系统综述，两种TOF系统的架构基本相同，主要都是由发射端和接收端构成（见下图）。而电子电路系统是实现系统架构的重要组成部分。比如发射端激光需要激光驱动芯片；接收端根据接收传感器的不同需要图像处理芯片对信号进行不同的处理，并直接进行一些片上计算输出深度信息；整个系统需要一个微控制芯片进行控制；需要一些储存单元储存固件及校准信息等。 而控制这些硬件电路的是固件Firmware，固件一般是以半永久的方式记录在硬件中的一种软件，在硬件断电后也不会消失；和Firmware进行交互的是该套系统的驱动driver/应用程序接口，该套程序可以让用户使用一系列更高级别的功能来控制固件的初始化，启动和停止测量距离，模式的选择等，可以通过I2C接口和Firmware进行交互；最上层就是用户自行开发的应用程序，调用系统的TOF测距的功能。 dTOF电路系统我们以STMicroelectronics(意法半导体)的VL53l5CX作为例子进行dTOF电路系统的介绍 系统简介VL53l5CX是ST出品的一款dTOF型测距模组，下图为实际模组图，正面图可以看到其发射端和接收端，中间是散热部件；背面图可以看到模组的电路连接端口和最中间的散热pad。 该模组的特点有： 快速的测距能力 多个zone的测距，可以选择4x4或者8x8zone 低功耗待机模式 最高400cm的测量距离 单一zone内多目标探测距离能力 60Hz帧率 模组内的直方图处理和算法补偿以最小化和移除cover glass造成的串扰 每个zone内有移动指示判断目标是否有位移 小型化和大FOV 940nm VCSEL发射端，集成模拟驱动 63° DFOV视场，使用DOE在发射端和接收端 接收端是SPAD阵列 低功耗的微处理器运行固件 大小：6.4mm x 3.0mm x 1.5mm 易于集成 单次回流焊组件 灵活的供电选择，使用单一3.3V或2.8V控制，或者使用3.3V在AVDD和1.8V在IOVDD 可以搭配多种范围的cover glass材质 应用场景有： 场景理解，多区域zone和多目标的识别能力可以用于机器人应用的3D室内空间映射和障碍识别。 大FOV和多区域扫描可以实现内容管理（卡车中的装货量，水箱，垃圾桶） 姿态识别 液面控制 视频投影仪的keystone校正 激光辅助对焦，增强相机AF自动对焦系统速度，增强若光照低对比度情况下的对焦鲁棒性 VR、AR增强，双相机立体视觉和3D深度辅助 智能建筑和智能光照 IoT（用户和物体检测） 视频对焦追踪，60Hz的帧率可以实现连续对焦算法 电路系统架构上一节简述了模组的功能，模组的功能是要靠其系统实现的。下图展示了该dTOF系统的电路系统架构图，可以看到其主要的系统功能块和主要接口。 VCSEL DriverVCSEL Driver用于驱动VCSEL工作，最简单的一种架构如下图所示，由于系统的控制部分是数字信号，VCSEL本身是模拟元器件，而且需要一个高电流，系统需要做的是快速的控制VCSEL的开关以发出高频脉冲光波。其中VCSEL的正极连接高电压，用于VCSEL本身的供电，该电压有时可以和数字电路部分的控制电压分离开来。VCSEL的负极端连接一个MOSFET（金属氧化物半导体场效应管），起到一个开关的作用。VCSEL本身可以被大致描述为一个有着特定大小电阻电容和电感的理想二极管。MOSFET的gate侧可以接收脉冲信号，来对MOSFET进行开关。对于高速应用，gate侧使用一个Gate Driver来提升信号速度，比如使用一对儿MOSFET来对VCSEL的MOSFET进行快速的充放电保证其开关高速性能。 SPAD Detection ArraySPAD detection array执行的是检测任务，主要由SPAD像素点，淬灭和重置电路和读出电路组成。下图展示了一个8x8的SPAD阵列的单像素结构，其中SPAD像素点用于感收到光子时发生雪崩效应产生电信号；淬灭和充值电路进行电压控制，已完成先停止SPAD像素点的雪崩过程，再让其回到工作状态；而读出电路用于识别SPAD读出的信号，并最终输出时间差信号。 读出电路中的一个重要组成部分是TDC(Time-to-Digital Converter)电路，为了实现时间相关单光子计数（TCSPC），整个系统要知道VCSEL发射出光子的时间和SPAD接收到光子的时间差。一个典型的TDC包含两个输入端一个输出端，其中输入端包含Start和Stop信号，在TOF应用中，Start信号可以为激光发射时控制信号的高电平，Stop信号为SPAD收到光子后输出的信号，TDC电路会记录两个信号的上升沿然后输出时间差。下图展示的是德州仪器的TDC7200，可以最多识别开始信号到最多5个结束信号之间的时间差。而ST这个模组的TDC都集成在SPAD阵列周围。 SPAD整体的设计难点是整个系统的工作速度，以及随着SPAD像素点增多后，如何提高SPAD像素点的fill factor以及控制整个模组的大小。下图展示了两种不同的SPAD array阵列的结构，不同于上面每个读出电路在单像素点周围（filling factor很小）。一种是读出电路整体在SPAD像素阵列边上（左图），一种是Sony的3D堆叠技术，整体读出电路在SPAD像素阵列下方（右图）。 Advance Ranging Core这一部分的系统取决于不同公司叫法不同，主要包含的是对TDC出来的时间差信号，SPAD像素点地址信息等的信号处理。最主要的是片上histogram的计数，然后依据算法，计算出距离，并依据标定的各种参数对数据进行校准并完成最终输出。 Micro ControllerMicro controller用于控制片上各子系统 NVM，ROM，RAMNVM用于来储存firmware，序列号，系统的校准信息等需要一直保存的信息，ROM用于储存系统初始化信息等，RAM用于系统运行的计算存储。 外围电路和端口ST的文档中展示了配合该模组的外围电路，模组通过I2C端口（SCL，SDA，INT）和Host MCU进行通信进行输入控制信号和输出信号的传输。 状态机该模组系统有断电模式，低功耗待机模式，高功耗待机模式和测距模式。 开发环境想使用该模组进行开发，可以选用多种开发板，只要保证Host MCU上安装了该模组的驱动，以及外围电路连接正确即可。 下图展示了使用Arduino进行连接的方式 下图展示了使用STM32 Nucleo64单片机连接该模组的一种方式以及一个简单的输出形态 下图展示了某些开发人员在开发板上再连接显示屏进行输出 ST会提供面向不同平台的驱动API等，以及一些简单的示例程序。该模组很容易集成进一些电路系统，作为一个传感器进行工作。 iTOF电路系统我们以Texas Instrument(德州仪器)的OPT8241 Chipset作为例子进行iTOF电路系统的介绍。其中OPT8241是iTOF传感器，需要搭配德州仪器的ToF controller OPT9221进行使用，OPT9221用于接收来自于OPT9241的数据进行深度信息的计算。 OPT8241 Evaluation Module是德州仪器开发的用于OPT8241和OPT9221的评估开发板，包括Illlumination Board和Sensor Board，见下图。下图右图展示的是接收端Sensor Board的部分，其中重点标注出了传感器芯片OPT8241（在镜头下面），TOF控制芯片OPT9221以及一个Micron的DDR2，左图展示了加上了带有四个激光发射端的Illunimation Board的整体开发板布局。整体形成了一个iTOF系统。开发板包括一个5V电源插口和一个Micro-USB接口，可以直接连接电脑使用。 系统简介OPT8241特性如德州仪器官网介绍如下，它是一个QVGA的iTOF传感阵列 成像阵列： 320 × 240 阵列 1/3” 光学格式 像素间距：15µm 高达 150 帧/秒 光学属性： 响应度：850nm 时为 0.35A/W 解调对比度：50MHz 时为 45% 解调频率：10MHz 至 100MHz 输出数据格式： 12 位相位相关数据 4 位共模（环境） 芯片集接口： 与 TI 的飞行时间控制器 OPT9221 兼容 传感器输出接口： CMOS 数据接口（50MHz DDR，16 通道数据、时钟和帧标记） LVDS： 600Mbps，3 个数据对 1LVDS 位时钟对，1LVDS 采样时钟对 定时发生器 (TG)： 可编程感兴趣区域 (ROI) 的寻址引擎 调制控制 抗混叠 主/从同步操作 用于控制的 I2C 从接口 电源： 3.3V I/O，模拟 1.8V 模拟，数字，I/O 1.5V 解调（典型值） 经优化的光学封装 (COG-78)： 8.757mm × 7.859mm × 0.7mm 集成光学带通滤波器（830nm 至 867nm） 便于对齐的光学基准点 工作温度范围：0°C 至 70°C 应用场景有 深度感测： 位置和临近感测 3D 扫描 3D 机器视觉 安全和监控 手势控制 增强现实和虚拟现实 OPT9221的特性如下 最高120 FPS的控制能力 深度信息输出: 12-Bit相位 最高12-Bit强度信息 最高4-Bit环境光 过曝检测 芯片集接口：适用于OPT8241 输出（CMOS，8Lane数据，8个控制信号和时钟） 数字视频协议适用：Data, VD, HD, Clock 同步串行接口（SSI）适用 深度引擎: 像素合并 ROI(Region of Interest) 去混叠 非线性校正 温度校正 高动态范围 空间滤波 时钟协调: 传感器控制 主从同步 I2C 接口 电源: 1.2-V Core, 1.8-V I/O, 3.3-V I/O, 2.5-V Analog 封装: 256-Pin, 9-mm × 9-mm NFBGA 工作温度: 0°C to 85°C 可以看到，由于iTOF使用的芯片更接近CMOS芯片，输出的信息量也比较大，所以OPT8241需要配合一个类似于ISP的OPT9221来工作。 电路系统架构上一节简述了模组的功能，模组的功能是要靠其系统实现的。下图展示了该iTOF系统在评估开发板中的架构图，可以看到其主要的系统功能块和主要接口。 Illunimation Driver发射端驱动用于驱动激光器，和dTOF的激光驱动没有本质区别，都是使用MOSFET等元器件实现，可以看到激光驱动的控制和调制信号来源自于OPT8241 Sensor，同时发射信号也输出给Depth Engine进行深度信息的计算。 Sensor(OPT8241)Sensor部分即OPT8241芯片，主要包括像素阵列，ADC和时间发生器。 像素阵列为320x240，最高支持150帧每秒，由于是iTOF应用，每帧读出4次强度信息(可能是使用的四相位连续波调制)，所以每秒可以读出600次数据。 ADC用来进行模拟到数字信号的转换 Timing Generator（TG）可编程，用于控制iTOF的调制，复位，读出，数字化序列。该可编程TG提供了对于不同算法的可能性（包括功率，移动物体的识别稳定性，信噪比和环境光降噪等） Depth Engine(OPT9221)Depth Engine在iTOF系统中充当一个类似于电脑显卡的工作，快速的计算序列化的数据，然后输出简单的深度信息。可以看到它的核心是Depth Engine的计算单元，OPT8241 Sensor的数据和时钟通过LVDS(Low Voltage Differential Signaling) Receiver De-Serializer模块输入到Depth Engine。除了原始数据，Depth Engine还需要一些补充参数用于更准确的深度计算，包括在发射端靠近VCSEL的温度传感器的温度信息（我们提到过VCSEL温漂会造成波长变化进而影响深度计算的准确性），配置信息，时间控制信号等。 DDR/DDR2用于储存Sensor原始读出信息的储存，不在芯片里，需要连接一个使用，当所有必要信息（4相位的读出信息）都完成储存时，Depth Engine会读出这些数据进行深度信息的计算，TI推荐最小128mbits的DDR用于储存，使用DDR2可以比DDR更快进行数据读入读出，所以OPT9221配置了也可以和DDR2通信的控制器。 其他的模块是通信接口等模块。 Configuration EEPROM, Calibration EEPROM, USB Tx/Rx(FX2)Configuration EEPROM用于存储其Firmware。 Calibration EEPROM用于储存校准参数，这些参数直接作用于输出后的深度信息矩阵上，所以不需要被Depth Engine读取，而是直接进行处理后完成最终输出。 USB Tx/Rx(FX2)用于USB的传输，其中开发板的固件存储在这个模块。 Power management and monitoring该模块主要是作为开发板本身的电源控制和监控。 开发环境固件该评估开发板包括两部分的固件fireware，一个是FX2固件和OPT9221的固件，这两个firmware分别存储在不同的EEPROM上。 软件该开发板使用开源3D camera software development kit Voxel-SDK. 为了使评估更容易，TI提供了一个基于该SDK开发的Voxek Viewer。该软件可以实现以下功能，软件GUI如下图所示： 实时查看以下数据: 相位，强度，环境光，距离，深度，点云 配置iTOF相机参数 基础统计：时间和空间平均，标准差，直方图 滤波器（时间和空间）：增加、删除、插入滤波器，配置滤波器参数 校准相机 更新OPT9221固件 参考dTOF VL53L5CX ST VL53L5CX Arduino + VL53L1X STM32 Nucleo64 board + VL53L5CX iTOF OPT8241 OPT8241 OPT9221 OPT8241 评估开发板文档 Voxel SDK Voxel Viewer User’s Guide 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"TOF系统","slug":"TOF系统","permalink":"https://faster-than-light.net/categories/TOF%E7%B3%BB%E7%BB%9F/"}],"tags":[{"name":"TOF","slug":"TOF","permalink":"https://faster-than-light.net/tags/TOF/"},{"name":"专题","slug":"专题","permalink":"https://faster-than-light.net/tags/%E4%B8%93%E9%A2%98/"}]},{"title":"光学新闻 20220320","slug":"OpticsNews20220320","date":"2022-03-20T10:00:00.000Z","updated":"2022-03-20T09:37:17.233Z","comments":true,"path":"OpticsNews20220320/","link":"","permalink":"https://faster-than-light.net/OpticsNews20220320/","excerpt":"近两周的五篇光学新闻： 荣耀发布Magic 4 — AR企业Rokid获7亿元C轮融资 — Dispelix和瑞声科技建立战略合作关系 — 使用衍射透镜提升裸眼3D效果— 基于隐私保护的人体姿态识别","text":"近两周的五篇光学新闻： 荣耀发布Magic 4 — AR企业Rokid获7亿元C轮融资 — Dispelix和瑞声科技建立战略合作关系 — 使用衍射透镜提升裸眼3D效果— 基于隐私保护的人体姿态识别 荣耀发布Magic 4系列评论：2022年3月17日荣耀发布了Magic 4系列手机。影像方面，荣耀Magic4系列均搭载5000万像素主摄（1/1.56英寸超大底），5000万像素超广角（支持微距摄影），不同的地方在于潜望镜头。标准版采用的是一颗800万像素潜望式长焦，最高支持50倍数字变焦；Pro版则是一颗6400万像素潜望式长焦，最高支持100倍数字变焦。二者前置镜头均为1200万像素，不同是Pro版多了一颗3D ToF镜头，可以进行3D人脸解锁。除了摄像头的相关配置，荣耀Magic4系列还搭载了多个影像辅助传感器，比如dTOF镜头可以提升对焦速度；多光谱色温传感器可以扑捉复杂光线信息，提升色彩准确度。当然荣耀也有不少影像算法，例如自研的AI-RAW超级人像引擎，提升人像在不同场景的效果；荣耀色彩还原引擎 Color Engine 2.0首次引入了人眼色适应机制，帮助用户在照片中找回“氛围感”。荣耀Magic4系列首发4K 60fps 10bit-log电影模式，增加60fps视频片幅技术，让影片更流畅。荣耀联手好莱坞专业影像团队为荣耀Magic4系列调制了多个电影级的3D LUTs，能调出更丰富的色调，表达不同的影调情绪。 荣耀的Magic 3系列是去年8月发布的，这次3月就发布了Magic 4系列，间隔比较短。对于荣耀，离开了华为后，现在可能有着更多自己的想法，无论是堆料到最满，还是DXO拿排名第一，都有造势的想法，对荣耀来说，抢占更多的市场，扛旗华为以前的大旗可能是现阶段最大的任务。 新闻稿 AR企业Rokid获7亿元C轮融资评论：3月20日消息，近日，国内AR智能眼镜领域领军企业杭州灵伴科技有限公司获得总额7亿元人民币的C轮融资，本轮融资主要用于技术研发、市场营销和生态建设。据公开资料，Rokid 是⼀家专注于⼈机交互技术的产品平台公司，致⼒于AR眼镜等软硬件产品的研发及以YodaOS-XR操作系统为载体的⽣态构建。据悉，该公司此前已获得包括淡马锡、IDG 资本、瑞士信贷、海通证券、元璟资本在内的多家顶级机构投资。 不去说产品做的是好是坏，To B，To C, To VC里Rokid的To VC和To B做的一直不错，一直愿意拓展合作伙伴和应用场景。 公司官网 Dispelix和瑞声科技建立战略合作关系评论：诚瑞光学母公司——全球领先的智能设备解决方案提供商瑞声科技，与增强现实(AR)和混合现实(MR)可穿戴式see-through光波导显示技术的领导者Dispelix，联合对外宣布建立战略合作伙伴关系。这种双赢合作关系的建立，将结合Dispelix独特的see-through光波导技术，与诚瑞光学全球领先的晶圆级量产技术，为全球客户提供在外形、图像质量和清晰度等方面性能更优的光波导显示解决方案，以此更好地满足AR&amp;MR等全球可穿戴设备相关市场日益增长的需求。作为瑞声科技旗下聚焦光学业务的子公司，诚瑞光学现已发展成为全球领先的光学产品及解决方案提供商，全面覆盖光学镜头、传动、模组等领域，手机光学镜头市场份额位居全球前三，并与全球主流手机品牌均建立了长期战略合作关系。此次合作是诚瑞光学在AR&amp;MR领域战略布局的重大拓展，将与诚瑞光学其他光学业务产生协同效应，为“光学整体解决方案”赋能。 Dispelix上次融资是11月8日，由Atlantic Bridge领投、新投资者CCB Trust和Flashpoint跟投的3300万美元B轮融资。包括Lifeline Ventures、VTT Ventures、Finnish Industry Investment和3M Ventures在内的所有老股东也参与了本轮融资。截至目前，Dispelix总融资额达到5000万美元。 Dispelix官网 使用衍射透镜提升裸眼3D效果评论：传统的裸眼3D系统经常受限于观察距离，这次中国苏州大学的研究者们使用一种新型的平面透镜设计，以提升远观察距离上的图像效果。裸眼3D系统的传统难点是视觉疲劳，有限的移动视差，有限的观察距离，以及观察角度和解析度的权衡。该团队使用衍射光学元件极大地增加了DOF（Depth of Docus）。研究者们设计了一种结合衍射光学平面透镜的向量光场显示器，用以在一系列的观察位置重建正确的深度信息。研究者们设计了一种优化的锯齿状结构，这些结构纠缠在一起组成了“view modulator”，这些调制器可以将光导入正确的位置。最终这种4inch的原型机展示出了在24-90cm的观察范围，实现了18000倍的DOF提升。下一阶段的提升在于视场角的提升（现阶段视场角只有9°）以及更复杂的算法的开发。本质上这算是计算光学的一部分，使用复杂的计算方法实现裸眼3D，但是看起来这种方法还是有种种限制。 论文 论文 基于隐私保护的人体姿态识别评论：几十年来，摄像头一直被设计成模仿人类的视觉系统。固定了光学系统之后，我们使用摄像头获取多张高保真图像，然后调整计算机视觉算法以优化它们在特定任务中的准确性。大多数计算机视觉应用，甚至是隐私保护方法，都依赖于这种传统的光学成像系统。例如，可以检测对隐私敏感的日常情况，并使用机械快门启用或禁用第一人称摄像头。然而，这种方法对传统摄像头获取的高分辨率视频执行软件级处理，可能就已经包含了在攻击中易暴露的隐私敏感数据。受光学和算法联合设计趋势的启发，哥伦比亚的桑坦德工业大学和美国的斯坦福大学的研究人员通过在端到端框架中优化光学编码器（硬件级保护）和软件解码器（卷积神经网络）来解决基于隐私保护的人体姿态估计问题。研究人员在光学编码器中引入了视觉隐私保护层，经过适当的参数化，可以优化光学镜头的点扩散函数（PSF）。研究人员通过广泛的模拟和原型摄像头验证了上述方法，展示了基于隐私保护的“深度光学（deep-optics）”方法成功地降低或抑制了隐私属性，同时保证了重要特征来执行人体姿态估计。 读了下论文，研究者同时优化硬件部分的光学面型和软件部分的姿态估计神经网络，制造出了一种高度定制化的系统。个人觉得这是一种非常有意思的尝试，把软硬两部分系统放在一起优化，最终实现一个高度定制化的功能性系统。 论文 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"TOF系统 第五章 VCSEL","slug":"TOF系统 第五章 VCSEL","date":"2022-02-05T10:00:00.000Z","updated":"2022-02-09T01:39:49.746Z","comments":true,"path":"TOFSystem_C5/","link":"","permalink":"https://faster-than-light.net/TOFSystem_C5/","excerpt":"本章主要介绍TOF系统中的重要零部件VCSEL，介绍其基本原理，结构，制程，封装，主要参数，产业链等，为不熟悉VCSEL的读者提供一个了解VCSEL的初始信息和基本体系结构的了解，可以作为一个更深入了解VCSEL的入门信息。","text":"本章主要介绍TOF系统中的重要零部件VCSEL，介绍其基本原理，结构，制程，封装，主要参数，产业链等，为不熟悉VCSEL的读者提供一个了解VCSEL的初始信息和基本体系结构的了解，可以作为一个更深入了解VCSEL的入门信息。 VCSEL简介垂直腔表面发射激光 Vertical Cavity Surface Emitting Laser (VCSEL)，是一种光电元器件，是一种半导体激光器件。由于其有各种优良的特性，近些年在通信，电子消费品，工业，汽车，医疗领域得到的广泛的应用。尤其是电子消费品领域，VCSEL作为光源出现在各种应用中，包括临近传感器，距离传感器，面部识别，3D相机等。2020年75%的VCSEL产值是在传感领域，24%的产值在通信领域。 VCSEL, LED, EEL对比常用的半导体光源有三种，分别是VCSEL，LED（light-emitting diode）和边发射器 edge-emitting laser（EEL）。从下面的图和表格我们来比较他们的不同。 这三种光源都是使用半导体制程制造，其中LED和VCSEL发光从表面垂直方向发出，EEL从侧面发出，这种模式决定了LED和VCSEL都可以在Wafer上进行片上测试，而EEL要把Wafer切开后形成单个零部件封装后才能进行测试，由此，成本上EEL最高。 光强上，EEL可以提供单一元件的最强光强，所以常用在光通信领域。单一的VCSEL和LED光强受限于本身的几何结构，但是可以使用阵列的形式提供高强度光强。 光谱宽度方面，VCSEL和EEL都是受激发光，属于激光，都有很窄的光谱宽度。LED属于发光半导体，光谱宽度较宽。 光束质量上，VCSEL可以提供相对小发散角的光束，而LED发光是Lambertian，EEL发出的是椭圆形光束，常需要光束整形。 调制速度上VCSEL和EEL都可以达到相对高速，所以常用于光通信领域，同时VCSEL的高调制速度使其可以使用在TOF应用中。LED相对较慢。 光电转换效率上，VCSEL对比LED有着更高的效率，所以也受电子消费品领域的青睐。 封装方式上，VCSEL和LED由于是表面发光，可以使用多种表面元器件通用的封装技术，而EEL受限于侧面发光，封装方式需要特别设计。 VCSEL形态如果按一个die上有几个发光点去分，VCSEL可以分成单点，多点和阵列式，如下图所示（请注意，下图的不同VCSEL的放大比例不同，单点的VCSEL其实很小，相当于阵列VCSEL的一个点的大小） 下图展示另一个单点VCSEL，左图展示了有1个点和4个点的VCSEL，每个发光点被称为Mesa。右图展示了一个单点VCSEL，可以看到中间的发光点，该VCSEL包括1个anode和3个cathode触点，可以看到Mesa本身的宽度和厚度的比例。 VCSEL十分小巧，下图来自于II-VI公司的宣传图，可以看到单点VCSEL和一个蚂蚁头部的对比。VCSEL是上面的薄层，下面都是wafer的本身基底（substrate）。 阵列型的VCSEL如下图所示，该VCSEL已经封装在一个基板（submount）上并通过Wire bond进行了电路的连接。 VCSEL结构首先，我们先复习一下最简单的激光器模型。激光器是利用受激辐射原理使光在某些受激发的物质中放大或振荡发射激光的器件。典型的激光器包括1.增益媒介 2.激光泵浦源 3.高反射镜（理想情况100%） 4.输出耦合（99%反射镜） 5.激光光束。3和4构成了谐振腔。 下图展示了VCSEL最基本的模型，作为一种激光器，它的基本模型和典型激光器没有区别，只是实现不同结构的方式是通过半导体制造的方式实现的。其中激光的谐振腔由两个分布式布拉格反射器（distributed Bragg reflector，DBR）构成，相当于两个反射镜，这个结构是在由高、低折射率介质材料交替生长成的，每层都是发射激光的四分之一波长。常见的VCSEL中，上下两层DBR结构会被注入p型和n型材料，形成半导体pn结，这样电流就可以流过。激光的量子阱在这两层DBR中间，常见的是3~5层。最上面是金属电极，中间红色是出光位置。下层是n型基底和最下层的金属电极，同时下层金属电极也可以作为反射镜增加出光效率。 下图展示了更贴近实际的VCSEL的结构和形态 下左图展示了各层的材料。可以看到最中间是三层InGaAs材料形成的量子阱，中间两层GaAs材料分隔开，整个激光激发区的外侧由AlGaAs形成的限制区夹住。限制区/氧化层/氧化孔径是限制光束和电流的区域，是由侧向氧化方式实现的。右图重点展示了氧化层的位置和形态，以及如何限制光路和电流的，电流和光束正常情况下都无法穿过氧化层（电流增大会穿过氧化层，因为很薄）。再外侧是上下分布式布拉格反射器，由掺杂p型材料的30个1/4波长周期AlGaAs/GaAs构成其中一个反射镜，一般反射率会在99.5-99.9%之间，由掺杂n型材料的17.5个1/4波长周期的AlAs/GaAs构成另一个反射镜，一般反射率为99%。然后是两侧的高浓度掺杂的p+GaAs层和n型GaAs基底以及最外侧的金属接触点。 VCSEL可以设计成上面变出光或者下表面出光，如下图所示，上面的VCSEL是基底在下，上方出光，而下方的VCSEL是设计成从基底侧出光，同时基底一面被做上了微透镜阵列，这种形式的好处是直接可以对光束进行整形，或者改变光束的方向。不过现阶段常见的VCSEL还是第一种。 VCSEL制程前面一节简单介绍了VCSEL的结构，VCSEL制造就是要实现这种结构。VCSEL主体结构是多层的“千层饼”结构，基于多层主体结构中，再继续进行限制氧化层，台面，电极等结构的制造，以实现光，电，热的设计需求；也会进行绝缘保护等工序，实现更好的寿命和信赖性。 VCSEL的主要制程被分成两个主要的部分，一部分是实现千层饼结构的MOCVD(metal organic chemical vapor deposition)金属有机物化学气相沉积技术了；一部分是实现后端各种结构和需求的FAB晶圆工艺，其中FAB晶圆工艺包括光刻，电极蒸发沉积及剥离，湿法台面蚀刻，侧向湿法氧化，BCB填充等。 我们使用下图作为例子来具体说明，图1为实现的VCSEL的形态，左边为我们前文就看到的侧视结构图，右图为实际的VCSEL俯视图，可以看到p和n电极； 图2为制造流程。图片引自Vertical-Cavity Surface-Emitting Lasers: Large Signal Dynamics and Silicon Photonics Integration 晶圆MOCVD外延MOCVD，metal organic chemical vapor deposition，金属有机物化学气相沉积是在基板上成长半导体薄膜的一种方法（是一种外延技术，其他外延技术还有分子束外延，液相外延，固相外延），是实现VCSEL千层饼结构的第一步。MOCVD是一种外延技术，主要实现的是在晶圆上一层一层的物质。在MOCVD制程中，反应气体在升高的温度下在反应器中结合以引起化学相互作用，将材料沉积在基板上。在MOCVD中，将超纯气体注入反应器中并精细计量以将非常薄的原子层沉积到半导体晶片上。含有所需化学元素的有机化合物或金属有机物和氢化物的表面反应为晶体生长创造条件，形成材料和化合物半导体的外延。不同于传统的硅半导体，这些半导体可以包含的组合III族和V族，II族和VI族，IV族或第IV族，V和VI族的元素。 外延工艺的难点在于精准控制每层外延层的厚度、均匀度，以及控 制缺陷密度。由于每层外延层只有几纳米至几十纳米厚度，所以对于 工艺精细度的要求非常高。 对于VCSEL，一般为在GaAs或InP晶圆上生长多层反射层与发射层。 (a) p极触点制造p极触点一般触点材料是 Ti/Pt/Au，使用电子束蒸发或者金属蒸镀后剥离方式实现。 (b) 第一台面蚀刻并进行SixNx沉积完成极点的沉积后，进行第一台面蚀刻，把上层的DBR反射部分和激发层暴露出来。这步蚀刻是一个化学过程，比如使用ICP-RIE方法结合NF3及SlCl4进行蚀刻。完成蚀刻后，一层SixNx被PECVD方法被沉积在整个台面上，这层SixNx可以在后面的侧向氧化制程中保护Mesa表面和芯片表面。 (c) 侧向氧化首先侧面的SixNx会被移除，然后进行侧向氧化的制程，该制程是VCSEL制造中非常重要的一步。湿法氧化工艺氧化工艺中，外延结构中高铝组分氧化层通过湿法氧化工艺后变成低折射率、高绝缘性的Al2O3形成有效的光场和电场限制。（在高温水蒸汽中将 AlAs 层氧化，变为有绝缘性的 AlxOy 层，其折射率也大大降低，因而成为把光、载流子限制在垂直方向的结构。）氧化孔径的大小和形状影响着VCSEL器件的很多性能参数，如VCSEL的阈值电流大小、光功率大小、串联电阻大小等。湿法氧化工艺时，通过控制氮气气体流量、腔室内加热温度来控制氧化速率，保证氧化速率的稳定性，从而达到用时间精准控制氧化孔径大小的目的，同时还使用红外光源的CCD用于实时观察氧化情况，保证氧化工艺的成功率。VCSEL的湿法侧向氧化孔径的大小和形状影响着VCSEL器件的很多性能，一般该限制孔径的大小为4~20um。VCSEL氧化限制层的横向结构形状通常为圆形，所以VCSEL的光斑基本为圆形。 侧向氧化后，为了不让氧化制程的AlAs层继续向内氧化影响谐振腔体积，造成激光特性突变，一些VCSEL很多还会增加一步绝缘保护制程(passivation)，使用ALD方式，沉积跟VCSEL氧化层特性接近的氧化铝（Al2O3）薄膜，这种侧面镀膜均匀，致密性高，厚度很薄就可以完全绝缘保护芯片，应力也小。 (d) 第二台面蚀刻完成侧向氧化孔径后，使用SiCl4和ICP-RIE工艺进行蚀刻，形成第二台面。保护的SixNy层被ICP-RIE结合NF3移除。 (e) n极触点制造n极触点为Ni/Ge/Au，使用电子束蒸发或者金属蒸镀后剥离方式实现。完成后在惰性N2环境中进行退火（430℃）。 (f) 接触层剥离Mesa和n触点外的接触层被进一步剥离，以降低bondpad（接触pad）的电容。 (g) BCB填充使用喷溅式镀膜方式将一层BCB（苯并环丁烯）喷射到整个VCSEL芯片上，使整个VCSEL平面化。 (h) Bondpad沉积沉积Ti/Au的bondpad使其和n/p极接触点连接。 不同VCSEL种类可能步骤多多少少有些区别，但是基本都是类似于上述流程，其中外延，侧向氧化和绝缘保护制程是关键工艺。 VCSEL封装完成VCSEL制造后，整体晶圆将经过检测，dicing进行出货。VCSEL在模组端会进行封装，主要会进行Die attach和wire bonding。Die attach的主要目的是将VCSEL和模组基板建立导电和导热通道，如下图所示。对于不同功率的VCSEL，使用的bonding环氧树脂种类不同，以实现不同的散热和信赖性需求。 完成基底bonding后，会进行wire bonding，单一VCSEL发光点一般使用一条wire bonding即可，但是对于高功率VCSEL阵列，需要用多个wire bonding以避免高电流熔断金线。如下图所示，左边是单一wire bonding，右边是多个wire bonding。根据Vixar，对于1 mil粗细的金线，最大可以承受0.7安培的电流。 VCSEL关键参数VCSEL作为一种半导体激光器元件，有很多参数，其中关键参数为光学，电学和热学特性等。波长特性，包括波长，光谱宽度，波长和温度的关系；光束质量（模式，发散角）；输出功率和转换效率等。 波长特性（波长，光谱宽度，温度特性）VCSEL的光谱特性由其量子阱中增益介质和DBR的设计决定。常见的VCSEL波长为650nm-1080nm，1550nm等，以红外应用为主，最新的研究可以实现280-320 nm的紫外VCSEL。对于有多个发光点的VCSEL阵列，由于制程误差，每个VCSEL的波长会略有偏移，整体展示出一个相对较宽的整体光谱，单个VCSEL Mesa的光谱宽度一般小于1nm。VCSEL波长对于温度十分稳定，为~0.06nm/K的数量级。 光束质量（模式，发散角）VCSEL中的氧化限制层在DBR中制造了一个波导结构，VCSEL的横模类似于光纤中的弱波导模式。对于足够小的氧化限制孔径，只有基础模式LP01可以存在，扩大孔径会让更多的模式射出。VCSEL整体发出的光是由多个模式组成的，每个模式都有自己的发散角。基础模式LP01在远场是高斯光束，高阶模式发散角更大，光束质量也更差。下图（a）展示了不同模式的形态，图（b）展示了单一Mesa对于不同孔径的光束发散角的区别。VCSEL的光束发散角一般定义为包含一半Peak能量的发散角宽度。同时电流也会影响光束质量，图（c）（d）展示了电流是如何影响光束偏离理想高斯光束的，其中θm是测量的光束发散角，θ0是理想高斯光束的发散角。电流越低，光束质量越好，原因是大电流直接流出了限制孔径范围，造成更复杂的发光情况。 输出功率和转换效率根据应用需求的不同，VCSEL功率从mW到W级别。工作电流和孔径的大小都影响其输出功率。功率会随着电流增大而增大，达到一个峰值然后下降，如下左图所示，展示了直流情况下电流和功率的关系。这种现象的原因是半导体结内的温度上升导致的，被称为“thermal rollover”。可以通过使用脉冲模式来实现更高的峰值功率，如下右图所示，展示了1%duty cyle， 50ns pulse width，不同温度下的峰值功率。 一般来说，单独的Mesa用大孔径会实现更大的功率。小孔径的VCSEL较小的电流密度限制了一个VCSEL可以实现的最大Wall Plug Efficiency (WPE)。但是由于VCSEL孔径的大小和DBR厚度比例的限制，出现最大WPE的孔径为某个值，然后WPE开始下降。假设这个值为8um左右，随着aperture变大，其中的电流分布就开始不均匀，影响了其WPE。为了实现高功率，如果要做一个VCSEL阵列，可能会选择使用10-12um的孔径，并制造成阵列。这种方式很好的平衡了最大的功率需求和电光转换效率，以及光束质量。下图展示了VCSEL的电光转换效率，孔径和温度的关系。 VCSEL设计中还有很多其他需要考量的因素，包括其阈值电流，电阻，上升沿下降沿时间，工作温度范围，效率等。可以看到很多参数之间是相互影响，需要在设计中进行取舍和平衡。 信赖性由于VCSEL是一种千层饼式的激光结构，这种结构的每层都是不同物质，同时每层都很薄，所以这种结构很容易收到各种影响，其中包括水汽，应力和热等。绝缘保护制程可以很好的增强防水氧侵袭，良好的封装散热也很重要，制造的参数控制也对应力很有帮助（比如会有退火的流程）。 VCSEL企业和市场VCSEL企业现阶段最大的VCSEL器件玩家主要是Lumentum，II-VI，Trumpf，Vixar等供应商，这些公司在VCSEL主要使用在通信领域的时期积累了非常多的经验，尤其是高信赖性的产品上有着独一无二的优势。在传感器领域，这些公司依然是主要玩家。国内的重要玩家是睿熙科技，纵慧激光和长光华芯等，都是在苹果发布FaceID时期，创办或开始重点研发VCSEL的企业。 VCSEL市场根据Yole的调研报告（见下图）： 市场预期 全球VCSEL市场预期在2026年增长到24亿美元的规模，21-26年CAGR为13.6%，主要驱动力是数据通信和手机应用需求。其中手机和电子消费品领域VCSEL规模预期达到17亿美元，21-26年CACG为16.4%；车用VCSEL在2026年预期达到5700万美元规模，CAGR 21-26 122%。 技术预期 多结VCSEL(Multi-junction VCSEL)技术代表着VCSEL工业界的下一个大飞跃；同时VCSEL生产厂商从4”晶圆向6”晶圆升级，并很快会进入8”晶圆生产；对于OLED屏下传感的应用，由于组装方式和集成方式不同，可能会打破传统的供应链形式。 供应链 Lumentum和II-VI掌握着80%的市场占有率，VCSEL的供应商很多，但是头部玩家很少，主要是中小型企业。 参考 VCSELs - Fundamentals, Technology and Applications of Vertical-Cavity Surface-Emitting Lasers Vixar公司的一系列 Application Notes 飞芯电子 一文读懂VCSEL Lumentum VCSEL II-VI VCSEL Yole VCSEL Market Research 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"TOF系统","slug":"TOF系统","permalink":"https://faster-than-light.net/categories/TOF%E7%B3%BB%E7%BB%9F/"}],"tags":[{"name":"TOF","slug":"TOF","permalink":"https://faster-than-light.net/tags/TOF/"},{"name":"专题","slug":"专题","permalink":"https://faster-than-light.net/tags/%E4%B8%93%E9%A2%98/"}]},{"title":"光学新闻 20220108","slug":"OpticsNews20220108","date":"2022-01-08T15:00:00.000Z","updated":"2022-01-08T15:35:25.439Z","comments":true,"path":"OpticsNews20220108/","link":"","permalink":"https://faster-than-light.net/OpticsNews20220108/","excerpt":"近两周的五篇光学新闻： 光谱芯片初创公司与光科技完成数亿元Pre-A轮融资 — 科思创和 TactoTek展示新的智能表面 — 滨松推出近红外增强型ToF图像传感器 — OV发布5MP 2.2um RGB-IR Global Shutter传感器— Voyant Photonics获1540万美元投资","text":"近两周的五篇光学新闻： 光谱芯片初创公司与光科技完成数亿元Pre-A轮融资 — 科思创和 TactoTek展示新的智能表面 — 滨松推出近红外增强型ToF图像传感器 — OV发布5MP 2.2um RGB-IR Global Shutter传感器— Voyant Photonics获1540万美元投资 光谱芯片初创公司与光科技完成数亿元Pre-A轮融资评论：光谱芯片初创公司与光科技宣布完成数亿元Pre-A轮融资，本轮融资由武岳峰科创领投，红杉中国、招商清控、信熹资本、中美绿色等跟投，老股东韦豪创芯、元禾原点、SEE Fund持续加码。本轮融资将用于光谱芯片核心技术的工程化和商业化，践行与光科技“让光谱感知无处不在”的愿景。与光科技专注于为全球客户提供先进的光谱芯片、AI算法和智慧感知方案。成立的一年多以来，陆续发布了SEE8610和SEE8810，其中SEE8610已经开始向行业头部客户送测，并进入量产筹备阶段。在AIoT、生鲜检测、工业检测等应用场景，与光科技和行业头部客户对智慧感知方案的深度合作开发，正在有序推进。光谱作为空间分辨率和3D立体视觉之外新的传感维度，与光科技坚定看好光谱成为超越人眼感知能力的蓝海市场，为机器视觉提供多元化的物理信息输入。与光科技认为，在不远的将来，光谱芯片有望成为人工智能和大数据行业的基础设施。 2021年8月，高光谱传感器的开发公司Spectricity B轮融资了1600万美元，说明这条赛道上开始出现一些公司，但是光谱芯片的应用场景依然不是非常明确，而且技术壁垒感觉也没有非常高，现在看起来只是在filter上做文章，这对于传统CMOS大厂来说都不是问题。最终会造成不同的主要还是算法和解决方案，谁家的算法可以基于硬件做出最好的应用，这是最重要的know-how。 值得一提的是，与光科技的两款参考设计的产品名字非常好听，“复虹”和“斓彩”。 新闻稿 科思创和 TactoTek展示新的智能表面评论：这条新闻不算是很光学，但是这个产品很有意思，可能是未来的显示和电子集成的一个方向。科思创covestro是世界领先的高科技聚合物材料供应商，TactoTeck是模内结构电子 (IMSE®) 解决方案的先驱，其关键组件采用聚碳酸酯树脂和薄膜制成。两家公司通过联合开发的新型演示设备——集成显示屏的Nighthawk 演示器展示智能表面的无限可能性。模内结构电子 (IMSE®) 技术主要是将用于布线和触摸控制的电子设备使用清洁的增材工艺印刷，电子元件表面安装在聚碳酸酯薄膜上，该薄膜与装饰薄膜一起插入注塑模具中，以封装在聚碳酸酯树脂中，最终制成单一无缝的IMSE®电子结构。传统制程中面板和电子电路是分离，分别制造然后在总装厂进行组装贴合。 本次主要展示了带有集成显示屏的 Nighthawk演示器，它采用了科思创的 Makrolon® 树脂和 Makrofol® 薄膜。Makrolon® 聚碳酸酯树脂的高透明度、低粘度和独特的导热性是使这些设备成为可能的关键，而 Makrofol® 聚碳酸酯薄膜提供抗紫外线和抗划伤性。降低任何设备材料堆栈的复杂性，增加了有效分离和回收的潜力。 新闻稿 滨松推出近红外增强型ToF图像传感器评论：滨松推出了一款128 x 8pixel的NIR近红外增强型TOF传感器，当与脉冲调制光源结合使用时，该ToF图像传感器输出关于光发射和接收时间的相位差信息，并可以通过使用外部信号处理电路或在PC上对输出信号进行计算来获得距离信息，主要应用包括自动驾驶领域的物体检测、安防领域的入侵检测、物流领域的形状识别等。滨松还为此产品提供相关评估套件。可以看到除了ST和AMS外，Hamamatsu也在TOF领域不断发展。对于机器视觉，这种不是用于手机上的相对高像素的TOF，而是用于这些生活中大家甚至不会注意到的场景的应用也大有发展空间。 官网介绍 OV发布5MP 2.2um RGB-IR Global Shutter传感器评论：OV发布了OX05B1X传感器，5MP，2.2um pixel size，RGB-IR。主打in-cabin（汽车车内）监控。Global Shutter的NIR sensor从几年前的OV7251 VGA像素数一路发展到今天5MP。每个不同的像素数都开始有自己的应用场景。 新闻 Voyant Photonics获1540万美元投资评论：Voyant Photonics近期募集了1540万美元资金，本次A轮融资由UP. Partners领投，LDV Capital和Contour Ventures跟投。Voyant是使用基于光子学的调频连续波（FMCW）激光雷达系统并结合硅光子技术以降低尺寸和成本。该方法利用可识别的数据模式编码并不断调整其频率的连续光束，避免了传统激光雷达的飞行时间（ToF）方法的许多问题。Voyant Photonics使用的方法可将激光雷达规模化量产成本降至100美元以下——所有光学、光束操纵和传感等功能都集成于芯片上，而不是使用移动部件。联合创始人Chris Phare和Steven Miller以前在哥伦比亚大学纳米光子学研究组共同工作，并决定一起商业化他们的研究成果。下图展示了该种芯片的形态和公司的开发时间表。 新闻稿 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"光学新闻 20211224","slug":"OpticsNews20211224","date":"2021-12-24T06:00:00.000Z","updated":"2021-12-24T06:05:32.719Z","comments":true,"path":"OpticsNews20211224/","link":"","permalink":"https://faster-than-light.net/OpticsNews20211224/","excerpt":"近两周的五篇光学新闻： Oppo发布弹出式伸缩摄像头 — Sony新传感器技术 — 图像传感器上Metalens应用 — Oppo发布Air Glass智能眼镜— LineVision使用Lidar监控输电线路","text":"近两周的五篇光学新闻： Oppo发布弹出式伸缩摄像头 — Sony新传感器技术 — 图像传感器上Metalens应用 — Oppo发布Air Glass智能眼镜— LineVision使用Lidar监控输电线路 Oppo发布弹出式伸缩摄像头评论：日前，在“致善・前行”第三届 OPPO 未来科技大会 2021 (OPPO INNO DAY 2021) 上，OPPO 全新自研弹出式伸缩摄像头正式亮相。这颗摄像头搭配 1/1.56 英寸传感器，等效焦距 50mm、F2.4 光圈，弹出后，焦距为 50mm，从而转换成为一颗人像镜头，并且具备 2X 光学变焦能力。这像是十几年前数码相机又回来了。不过，这种可动机构在设计，组装，校准尤其是信赖性上都有挑战。 oppo近几年除了和其他厂商进行多摄的相似开发外，也一直在探索一条相对独特的道路，就是在手机上，重点打磨一颗主摄像头，然后其他摄像头作为辅助。Oppo的产品经理对消费者的理解是，大部分时候就应该只使用这一颗镜头即可。另外，各厂商都在对变化镜头进行探索，Sony Xperia Pro I是使用了可变光圈，Xperia 1&amp;5使用了连续变焦长焦镜头。可以保持关注，等更多评测和专利出现，具体分析一下这个设计。 新闻稿 Sony新传感器技术评论：索尼半导体解决方案公司已成功开发出全球首创的双层晶体管像素堆叠式CMOS图像传感器技术。传统CMOS图像传感器的光电二极管和像素晶体管分布在同一基片，而索尼的新技术将光电二极管和像素晶体管分离在不同的基片层。与传统图像传感器相比，这一全新的结构使饱和信号量约提升至原来的2倍，扩大了动态范围并降低噪点，从而显著提高成像性能。采用新技术的像素结构，无论是在当前还是更小的像素尺寸下，都能保持或是提升像素现有的特性。索尼在2021年12月11日（星期六）开始的IEEE国际电子设备会议上宣布了这一突破性技术。 （传统的）堆叠式CMOS图像传感器的堆叠式结构中，背照式像素组成的像素芯片堆叠在逻辑芯片之上，而信号处理电路构成了逻辑芯片。在像素芯片内，用于将光转换为电信号的光电二极管和用于控制信号的像素晶体管在同一基片层并列。在这样的结构限制下，如何实现饱和信号量的最大化，对实现高动态范围、高图像质量的摄影具有重要作用。 索尼开发出的全新结构是堆叠式CMOS图像传感器技术的一项进步。索尼使用专有的堆叠技术，将光电二极管和像素晶体管封装在分离的基片上，一个堆叠在另一个上面。 相比之下，在传统的堆叠式CMOS图像传感器中，光电二极管和像素晶体管并排位于同一基片上。新的堆叠技术支持采用可以独立优化光电二极管和像素晶体管层的架构，从而使饱和信号量相比于传统图像传感器增加约一倍，进而扩大动态范围。 此外，因为传输门 (TRG) 以外的像素晶体管，包括复位晶体管 (RST)、选择晶体管 (SEL) 和放大晶体管 (AMP)，都处于无光电二极管分布这一层，所以放大晶体管（AMP）的尺寸可以增加。通过增加放大晶体管尺寸，索尼成功地大幅降低了夜间和其他昏暗场景下图像容易产生的噪点问题。这项新技术使动态范围扩大并降低了噪点，将避免在有明暗差（例如背光设置）的场景下曝光不足和过度曝光的问题，即使在光线不充足（例如室内、夜间）的场景下也能拍摄高质量低噪点的图像。索尼将通过双层晶体管像素技术致力于实现更高质量的成像，例如智能手机拍摄等。 下图展示了传统的堆叠式图像传感器（左）；采用新开发的双层晶体管像素技术的堆叠式CMOS图像传感器（右） 下图展示了采用双层晶体管像素技术的CMOS图像传感器的横截面图片 新闻稿 图像传感器上Metalens应用评论：来自日本NTT Device Technology Labs的研究者们使用Metalens开发了一种增强型的传感器，他们称为是像素级Metasurface lens，这种metasurface，可以帮助图像传感器收集到更多的光。传统的图像传感器，上面会有一层滤光片和微透镜阵列，滤光片用于分光，而不需要光的自然被滤掉了。而这种Metasurface可以把白光分光至下面感光部分的不同位置，起到了分光的作用，同时又不损失光。传统滤光片会损失掉70%左右的光，而新的设计可以保留全部光线。这层metalens阵列是使用在SiN晶圆上蚀刻完成的。研究者们汇报了2.83倍的感光提升，同时保证了像质和解析度，该种制程也可以很容易和现代CMOS图像传感器的制程结合起来。这种设计未来可以提升照相机暗态的感光能力，以及实现更高的快门速度。 下图展示了这个设计概念，a图是传统的图像传感器和滤光片，只有30%的光会到达感光元件；b图是使用metasurface的设计概念，所有光都可以到达感光元件；c图是整个的阵列的展示，metasurface同时作为微透镜阵列和分光片的功能；d图展示了metalens阵列是如何把光线分光导入不同的pixel的。畅想一下，未来可能镜头和sensor的设计优化要结合起来，甚至可以先设计好镜头，然后设计sensor上的这层metasurface，然后同时生产。 论文 Oppo发布Air Glass智能眼镜评论：此次新发布的OPPO Air Glass采用单目分体式方案，主体重量不到30克，镜片厚度1.3毫米。镜片采用轻薄的衍射光波导技术，平均入眼亮度1400尼特，采用自研Spark微型光机。具备触控、语音、手势和头动操控四种交互方式，通过专用App，与OPPO手机、OPPO Watch配合使用，具备消息提醒、随身翻译、导航、提词等功能。 Oppo三年搞了三款AR眼镜，2019年做一体式双目，2020年做了birdbath方案的分体式，这次2021年直接搞了个光波导单色单眼分体式，可能Oppo就是想市场上占据一个生态位，熟悉一下光波导方案的开发，支持一下光波导制造商，培养自己的供应商，保证自己的这个team有活干。感觉这款眼镜在普通消费者领域估计不会掀起什么水花，不过，从这个角度看，可能Oppo的公司风格是研发什么的目标都是面向最终交付产品，即使研发出来这个可能不是很完美，卖不出去，或者不成熟，oppo的团队也要发布这个产品。对于开发团队这可能也是个好事情，永远面向最终产品思考，不至于闭门造成，同时进行一个以年为单位的迭代，不行就换方案。当然这种开发方式也有缺点。 如果哪家公司可以给快递员们设计一款好用的智能眼镜，AR功能都可以不要，也是很好的。科技以人为本。 新闻 LineVision使用Lidar监控输电线路评论：马塞诸塞州的电网监控公司LineVision近期在纽约电网系统中，使用Lidar监控输电线路元器件的位置和移动。这条新闻值得注意的一点是这里的Lidar是来自于激光雷达的明星公司Velodyne。2021年5月，Velodyne报告了巨额亏损，由于自动驾驶市场并没有很快的发展起来，同时该公司内斗严重。所以，这条新闻对于LineVision就是一个新技术的应用消息，对于Velodyne，可能从侧面反映了该公司不得不扩展市场去保持营收，甚至是去库存。下图卡可以看到在箱体上部是Velodyne的激光雷达。 新闻稿 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"TOF系统 第四章 dTOF和iTOF比较，产业链及应用","slug":"TOF系统 第四章 dTOF和iTOF比较，产业链及应用","date":"2021-12-16T14:50:00.000Z","updated":"2021-12-17T14:04:57.361Z","comments":true,"path":"TOFSystem_C4/","link":"","permalink":"https://faster-than-light.net/TOFSystem_C4/","excerpt":"第一章中我们介绍了TOF的基本原理，应用，系统架构和分类。第二章和第三掌中，我们详细介绍了dTOF和iTOF系统，系统原理，从架构和零部件性能出发，分析重要的系统参数。本章，我们对iTOF系统和dTOF系统进行一个比较，同时介绍TOF的产业链，并且介绍一些应用。","text":"第一章中我们介绍了TOF的基本原理，应用，系统架构和分类。第二章和第三掌中，我们详细介绍了dTOF和iTOF系统，系统原理，从架构和零部件性能出发，分析重要的系统参数。本章，我们对iTOF系统和dTOF系统进行一个比较，同时介绍TOF的产业链，并且介绍一些应用。 dTOF和iTOF比较根据前两章的介绍，dTOF和iTOF的比较总结如下。 基本原理：两者都是去尝试获得飞行时间，dTOF是直接测量了飞行时间，而iTOF是通过相位差的方式间接得到这个信息。 核心组件：dTOF的核心组件是SPAD单光子雪崩传感器，而iTOF的核心元件是iTOF CIS传感器。根据基本原理和传感器的不同，两者使用不同的模拟数字混合电路及IC。 探测距离和探测精度：探测距离上，dTOF的探测距离可以较远，主要原因是其精度不随距离下降；而iTOF受限于原理，随着探测距离增加，探测精度随之下降。dTOF的贪色精度受限于脉冲宽度，而iTOF的探测精度反比于调制频率。 误差：TOF系统是测距系统，再深层一些，是使用光飞行时间进行距离的计算，其中重要的参数有光波的波长，飞行的时间。所有对于这两个参数会产生影响的器件都是误差产生的原因，比如激光波长偏移，SPAD，TDC的时间误差，时钟精度，读出噪声等等。 距离歧义：由于iTOF是通过相位计算飞行时间，相位是周期性变化的，所以会产生距离歧义。 空间图像分辨率：dTOF的SPAD制造技术依然pixel较大，filling factor较低，所以空间图像分辨率较低；iTOF的传感器基于CMOS sensor，可以做到较高的像素数量。 抗干扰能力：总体上讲，dTOF的抗干扰能力比iTOF强，由于其使用时间相关单光子计数法，所以可以通过统计方式去除干扰；iTOF容易收到各种干扰，需要使用各种算法去补偿和校正，这也是各种iTOF方案公司的主攻方向。 功耗：dTOF无论在发射端还是接收端功耗都比iTOF低。 工艺：dTOF主要的工艺难点在SPAD的获得和TDC电路的制造商，iTOF的工艺类似于传统手机内照相机系统工艺，相对简单。 成本：dTOF的成本主要集中在SPAD和电路上，iTOF成本相对低一些。 产业链TOF的产业链总结如下图，其中特别列出了一些有代表性的中国企业。 VCSEL供应商：VCSEL的供应商大部分最初来自于光通信领域，比如Lumentum和II-VI，今年II-VI收购了Coherent，Lumentum收购了NeoPhotonics，继续扩展业务；而AMS和OSRAM合并，强强联合；TRUMPF来自于飞利浦。国产代表初创公司有睿熙科技和纵慧激光。 激光驱动ASIC：激光器需要有一个专门IC进行驱动，该IC是数字模拟混合芯片，德州仪器，Analog，ST，AMS都可以提供该类芯片。 SPAD传感器：Sony依然是该行业老大，可以提供最高技术最多像素点的SPAD；ST，AMS可以提供64像素的SPAD传感器，主要用于临近传感或者辅助对焦应用；国内的创业公司灵明光子也在独立开发SPAD传感器。 iTOF CIS传感器：这种传感器制造方式类似于RGB CMOS，所以传统的CMOS厂商都有提供该种传感器的能力，国内的创业公司聚芯微电子也可以提供背照式iTOF CIS芯片。 滤光片：滤光片是TOF中的重要部件，Viavi和水晶光电是主要的供应商。 DOE和diffuser：苹果的dTOF方案使用DOE居多，其中台积电和Himax都可以提供DOE，diffuser的供应商有II-VI，舜宇光学，Viavi等。 镜头：光学镜头的供应商主要是舜宇光学，大立光学，玉晶光电和瑞声科技等。 模组组装：TOF的模组组装也是传统的模组组装厂，其中有ST，LG Innotek，Sharp，舜宇，信利等。 解决方案和算法公司：ST，AMS的官网都可以看到在售的TOF模组，pmd和infineon也为各个客户提供各种解决方案，国内的解决方案公司是光鉴科技。 可以看到TOF产业链已经非常完善，同时，在各个领域，国内都有光学企业占据了或者尝试占据生态位。但是国内企业对于一些核心零部件的掌握还不是很重复，比如VCSEL，激光驱动芯片，解决方案和算法，SPAD传感器等。但是对于镜头，滤光片，整体模组组装。 应用对于TOF应用，苹果的FaceID刚出现的时候，带起了手机行业的3D识别风。经过这几年的沉淀，手机上后置TOF国内手机企业更多的是使用TOF进行辅助对焦，或者前置进行人脸识别，高级一些的有后置的体感交互，不过没有很好的应用，手机上的临近传感器也是TOF。 智能家居的TOF应用也越来越多，扫地机器人是一个很好的例子，新形态的机器人开始从扫地机器人发展而来，比如Amazon近期发布的家用机器人Astro。 对于工业自动化的自动避障，测量距离，定位，TOF的应用从以前专门的工业结局方案到现在的更多的集成化解决方案。 ToB业务种新零售也使用了很多TOF，比如手势识别，客流统计，行为识别，人脸识别等等。 不同场景的TOF的应用差别很大，从空间分辨率一个pixel就足矣的应用（比如小便池距离），到需要很高空间分辨率的应用（Lidar等）；从要求快速响应的应用到慢一些也可以的应用；从需要低功耗的应用，到可以连接电源的高功耗可以接受的应用等等。 所以TOF的传感器设计要综合考虑应用，进行各种参数的平衡，其中包括精度，测量范围，响应速度，空间分辨率，成本，功率等等，并针对应用，进行整体的软硬件设计。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"TOF系统","slug":"TOF系统","permalink":"https://faster-than-light.net/categories/TOF%E7%B3%BB%E7%BB%9F/"}],"tags":[{"name":"TOF","slug":"TOF","permalink":"https://faster-than-light.net/tags/TOF/"},{"name":"专题","slug":"专题","permalink":"https://faster-than-light.net/tags/%E4%B8%93%E9%A2%98/"}]},{"title":"光学新闻 20211205","slug":"OpticsNews20211205","date":"2021-12-05T07:30:00.000Z","updated":"2021-12-05T07:09:51.817Z","comments":true,"path":"OpticsNews20211205/","link":"","permalink":"https://faster-than-light.net/OpticsNews20211205/","excerpt":"一直在路上，近三周的五篇光学新闻： 选择文章的原则是紧跟技术及产品进步，拓展视野 富士发布Instax Mini Evo相机 — 哈佛大学新型硅纳米柱涂层，有望解决透明光学元件的光色散问题 — 通快将于年底完全收购意大利合资子公司 — 日本 AR 初创公司 Cellid— 中国2.5米大型激光陀螺仪试制成功","text":"一直在路上，近三周的五篇光学新闻： 选择文章的原则是紧跟技术及产品进步，拓展视野 富士发布Instax Mini Evo相机 — 哈佛大学新型硅纳米柱涂层，有望解决透明光学元件的光色散问题 — 通快将于年底完全收购意大利合资子公司 — 日本 AR 初创公司 Cellid— 中国2.5米大型激光陀螺仪试制成功 富士发布Instax Mini Evo相机评论：富士发布Instax Mini Evo 数码拍立得，价格还没有公布（一些新闻称会是199美元）。官网介绍这款相机有10种镜头滤镜+10款相纸滤镜可选，可以组合成100种风格，应该都是电子滤镜。如果让我评论，这是一款配置着手机镜头的打印机。不过颜值就是正义，可能会变成网红相机（打印机）。而且随着显示屏，处理器，镜头的成本降低，可能未来的拍立得就会变成这个样子。甚至可以畅想一下以后景区会出现这种租借的共享拍立得。 官网 哈佛大学新型硅纳米柱涂层，有望解决透明光学元件的光色散问题评论：哈佛大学的Federico Capasso教授的Meta Surface实验室SEAS Lab近期又开发了meta surface的新应用，一种硅镀膜，可以帮助解决玻璃镜片的色散问题。尤其是可以解决飞秒激光脉冲应用的色散问题，主要是用于通信领域。这种镀膜包括600nm高，160nm宽的纳米柱，作为Metasurface控制光波。虽然这里叫coating，但是这种图层是使用商用光刻机制作的。项目组更多的是在该文章中，描述一种新的应用场景，以推广Metasurface的应用。 新闻稿 通快将于年底完全收购意大利合资子公司评论：Trumpf（通快）宣布，公司正在大力拓展其增材制造业务，并将从其意大利合作伙伴 SISMA S.p.A. 手中完全收购合资企业 TRUMPF SISMA S.R.L.的股份。目前，通快持有 TRUMPF SISMA 公司 55% 的股份。此外，通快还将接手SISMA公司在工业、牙科和医疗市场方面的激光金属熔化（LMF）业务。目前，两家公司已签署了相关协议。在出售合资企业股份及自己原有的激光金属熔化（LMF）业务后，SISMA公司未来将重点发展珠宝和时尚行业，并促进通快激光金属熔化（LMF）设备在这些市场的分销。 TRUMPF SISMA 公司成立于 2014 年，是一家合资公司。其总部位于意大利北部的斯基奥市（Schio）。约有 60 名员工从事基于激光金属熔化（LMF）技术的 3D 打印设备开发和生产工作。10月03日的光学新闻中，提到了Trumpf开发激光打印牙科拱座 新闻稿 日本 AR 初创公司 Cellid评论：日本 AR 初创公司 Cellid宣布开始提供 FOV 60 度光波导显示模组样品，参数为：60°+ FOV，1.2立方厘米的投影部分，&lt;1.6mm的厚度，&gt;200Nits亮度，HD的分辨率，RGB，但是本次提供的样品输出的图像为单一的绿色，可以输出全彩色图像的产品样品预计也将于 2022 年 2 月上市。以前并没有很多听过这家公司的消息，该公司成立于2016年，该公司会参加2022年2月的Photonics West。 官网 中国2.5米大型激光陀螺仪试制成功评论：一台边长达2.5米的大型激光陀螺仪原型机在湖南建造成功并实现闭环运转，这是国际上目前投入实用的最先进技术方案首次在国内实现自主试制。据悉，该原型机由湖南二零八先进科技有限公司（下简称“二零八公司”）技术团队研发，填补了我国在大型激光陀螺建造领域的空白，为进一步推进该领域的研究奠定了良好的基础。 大型激光陀螺仪是指边长在米级以上的陀螺仪，巨大的面积优势赋予其极高的测量灵敏度和精度，其测量精度远远超出小型激光陀螺仪，这使其在世界时（UT1）测量、地球物理、大地测量、地震学等领域有着全新的应用。但随着尺寸增大其研制难度大幅提升，研制过程也需要在小型激光陀螺仪基础上多花费五至十年甚至更长的时间，同时需要大量经费进行支撑。目前仅有新西兰、德国、美国以及中国的部分科研机构进行研究，属于高精尖的基础科学装置。我国在大型激光陀螺仪技术方案上一直未能获得突破，相关领域面临“卡脖子”困境。 没有看到我国的陀螺仪原型机的图，下图是在德国的Geodetic Observatory Wettzell（大地测量天文台）里的大型环形激光陀螺仪。 新闻稿 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"光学新闻 20211113","slug":"OpticsNews20211113","date":"2021-11-13T14:30:00.000Z","updated":"2021-12-04T11:32:05.724Z","comments":true,"path":"OpticsNews20211113/","link":"","permalink":"https://faster-than-light.net/OpticsNews20211113/","excerpt":"本周五篇光学新闻：： OV发布首款自拍前摄用常亮RGBC图像传感器 — SWIR传感器公司Trieye融资7400万美元 — 衍射光学网络对全息图进行光学重建 — VR厂商大朋完成新一轮千万美元融资— 北京意链科技超薄VR眼镜原型机","text":"本周五篇光学新闻：： OV发布首款自拍前摄用常亮RGBC图像传感器 — SWIR传感器公司Trieye融资7400万美元 — 衍射光学网络对全息图进行光学重建 — VR厂商大朋完成新一轮千万美元融资— 北京意链科技超薄VR眼镜原型机 OV发布首款自拍前摄用常亮RGBC图像传感器评论：OmniVision发布了其OV32C，一款32MP，1/3.2 inch，0.7um像素大小，用于手机前摄自拍的图像传感器。该传感器的低功耗模式可以让其实现“always-on”的功能，这种功能可以使用AI技术去自动化很多照相机的任务，比如人脸检测和扫描二维码等。这款传感器中的C的部分，成为clear pixel，应该是没有filter，用于提升低光照情况下的图像质量和感光度。使用这种技术需要在ISP层面开发相应的on-chip RGBC to Bayer的转换和融合算法。 官网 SWIR传感器公司Trieye融资7400万美元评论：以色列初创公司Trieye致力于开发CMOS型的SWIR传感器，该公司新一轮融资7400万美元，实现在四年内融资960万美元。新的投资回用于商用化其SEDAR (Spectrum-Enhanced Detection And Ranging)传感器（光谱增强检测和距离测试传感器），用于自动驾驶。SEDAR使用脉冲照明方法实现3D点云的收集。近几年，由于自动驾驶，Lidar等快速发展，SWIR的传感器初创企业也很多，而且需求很大，各个公司都在致力于实现更好的传感器。 新闻稿 衍射光学网络对全息图进行光学重建评论：自20世纪40年代末，诺贝尔奖获得者丹尼斯·加博 (Dennis Gabor) 发明全息术以来，全息术已广泛应用于科学和工程应用，例如计算成像、显微镜、传感器、显示器和干涉测量。在全息术的许多应用中，通常使用数字计算机和迭代算法来重建全息图以检索对象信息，这可能会很耗时，具体取决于全息图的大小。 最近，在ACS Photonics发表的一篇文章中，来自加州纳米系统研究所 (CNSI) 和加州大学洛杉矶分校 (UCLA) 电气与计算机工程系的 Aydogan Ozcan 教授和研究生 Sadman Sakib Rahman 提出了一种不需要计算机，使用衍射网络对全息图进行全光学重建的方法。衍射网络是一种全光学处理器，由一组空间设计的衍射表面组成，这些表面通过光物质相互作用和衍射共同计算输入光场的所需变换。在计算机中使用深度学习针对给定任务训练和优化衍射网络的空间特征。训练完成后，可以制造和组装这些衍射表面，形成一个物理网络，该网络可以以光速全光重建未知物体或场景的输入全息图，除了照明外，无需外部电源。可以全光重建全息图的整个衍射网络架构非常薄，其跨度仅为光波长的约 225 倍。例如，使用绿色激光光源进行照明，这样的衍射网络将像人的头发一样细，使其非常紧凑和轻便。这种非常薄、紧凑的设计还可以在不到 1 皮秒的时间内从其全息图即时重建对象，与利用图形处理单元的最先进的数字全息图重建算法相比，速度要快一万亿倍以上（GPU）。加州大学洛杉矶分校研究人员进行的数值分析表明，衍射网络在全光学全息图重建方面具有众多优势，可实现卓越的图像重建质量、增强的景深以及衍射处理器输出的更高衍射效率。 加州大学洛杉矶分校的研究人员总结说，这种全光学全息图处理器可以在全息成像、显微镜、传感和显示相关应用等不同领域找到许多应用，尤其是受益于其无计算机操作和超快速图像重建能力。作者获得了来自美国AFOSR的研究资金。 新闻稿 VR厂商大朋完成新一轮千万美元融资评论：大朋VR（DPVR）宣布已完成新一轮由联合光电旗下基金、谦宜资本、小村资本等投资机构的联合投资，融资千万美元。大朋VR是一家世界级的软硬件一体化的全栈XR技术与产品公司，致力于元宇宙的基础设施建设，并在其中打造更加富有效率的交互内容和形式，客户遍及海外40+国家和地区，服务13000+开发者。2019-2021年连续三年入选 “中国VR 50强企业”。 IDC2021年最新报告显示，2021年第一季度全球VR头显设备出货量和去年同期相比增长了52.4%，在2021-2025年间，全球VR头显设备出货量有望达到约41.4%的年均增速。中国VR产业的市场规模在2020年达到了413.5亿元人民币，2023年预计将达到1051.6亿元。2021年Q1季度大朋VR全球市场占有率为6%，仅次于Oculus，位居全球第二。 作为元宇宙概念最主要的硬件承载设备，VR行业近几年在芯片、显示、传输、通信等各个模块高速发展，技术和内容快速更新迭代。2021年，大朋VR推出了针对行业解决方案的P1 Ultra 4K VR一体机，采用模组化设计，搭载高通骁龙845，较835性能提升30%以上，并斩获2021世界VR产业大会云峰会VR/AR创新奖。 大朋VR创始人CEO陈朝阳表示，“本轮融资将有助于增强公司的资金储备，我们会继续加大产品上的研发投入，引入高精尖人才，一如既往的用心给用户打造更完美的VR产品，保持大朋VR优秀的产品力。公司将依托智能交互、VR硬件等核心虚拟现实技术，致力于元宇宙的基础设施建设，同时与元宇宙产业上下游合作伙伴一道，从技术、标准、应用等层面探索元宇宙产业的发展和建设。我们之后还有新的6Dof超薄VR眼镜发布计划，新品会紧盯世界一流技术水平。” 大朋可能在B端业务上还有一些份额，其他的不知道重点研发在哪个方向，可以后续关注一下。 新闻稿 北京意链科技超薄VR眼镜原型机评论：近日，虚拟现实技术公司EM3（北京意链科技）公开了一款代号为ETHER的超薄VR眼镜原型机，整机厚度仅6.8mm，重量不到35g，是迄今为止全球最轻薄的VR近眼显示方案。该版本原型机采取分体式设计，由Micro-oled微显示器驱动，支持全彩显示，单眼2.5k分辨率，Fov90度，可以物理调节瞳距。据称，产品的下个迭代版本有望在产品体积不变的情况下，将FOV进一步提升至110°。据透露，EM3-Ether眼镜采用了一套特殊的光学成像系统NEO-M，用一组衍射透镜取代了传统VR眼镜中厚重的透镜组，可以在极短的焦距内，对所有可见光进行汇聚以实现清晰成像，因此可以极大地缩减光学模组厚度。 Facebook（Meta）在去年也公布了一款超薄VR眼镜的原型机，厚度约8.9mm，但该产品还处于非常早期的实验性阶段，仅支持低分辨率的单色显示，离真正的产品化还有相当长的距离。 看了一下公司官网，官网上还在展示birdbath方案，这次这种原型机的发布更多的可能是造势融资吧，基本不可能做成实际应用产品或者量产。 新闻稿 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"光学新闻 20211107","slug":"OpticsNews20211107","date":"2021-11-07T07:00:00.000Z","updated":"2021-12-04T11:32:05.724Z","comments":true,"path":"OpticsNews20211107/","link":"","permalink":"https://faster-than-light.net/OpticsNews20211107/","excerpt":"本周五篇光学新闻：： eMagin发布全球最亮全彩硅基OLED显示器 — Lumentum以9.18亿美元收购NeoPhotonics — 三星参投波导厂商DigiLens D轮融资 — 索尼谈颠覆性SWIR图像传感器— Luvoir下一代天文望远镜","text":"本周五篇光学新闻：： eMagin发布全球最亮全彩硅基OLED显示器 — Lumentum以9.18亿美元收购NeoPhotonics — 三星参投波导厂商DigiLens D轮融资 — 索尼谈颠覆性SWIR图像传感器— Luvoir下一代天文望远镜 eMagin发布全球最亮全彩硅基OLED显示器评论：eMagin推出全球最亮全彩Micro OLED显示器，亮度高达10000尼特。这是一款WUXGA（1920x1200）像素分辨率的全彩色硅基OLED微型显示器产品。据介绍，该产品使用了公司专有的dPd技术，产品亮度达到超高的10,000尼特，这也让它成为目前世界上亮度最高的高分辨率、全彩色OLED微型显示器。eMagin的CEO Sculley表示，这是eMagin公司和整个行业的历史性时刻，同时这也是公司在推进专有dPd技术方面迄今为止取得的最大成就。公司凭借专有dPd技术开发了这款WUXGA 显示器，亮度达到10000 cd/m2 以上。相对于传统基于W+CF方案的硅基OLED微型显示器，这款产品在亮度上提高了将近20倍。相较于之前推出的XLE系列微型显示器，该产品亮度也提高了3到4倍，我们相信这是目前世界上亮度最高的高分辨率全彩色OLED微型显示器。另外，Sculley还表示，正在与一家头部消费电子产品公司合作以进一步开发这项技术，合作内容主要在提高产品的量产性。其认为，更高的亮度和分辨率将有助于客户克服低效光学器件的限制，从而实现原来无法想象的目标。而10000尼特亮度全彩色显示器的达成，是emagin到2023年中期实现超过28000 尼特亮度全彩色显示器路线图上的一个重要里程碑。 官网 Lumentum以9.18亿美元收购NeoPhotonics评论：Lumentum和NeoPhotonics（新飞通）近日宣布达成收购协议，Lumentum将以每股16美元的现金价格收购NeoPhotonics，合计对NeoPhotonics估值9.18亿美元。双方董事会均以一致通过这次并购，但是收购还需要股东大会和合规批准，收购计划完成时间是2022年下半年。两家公司都在中国有着很大规模的商业活动，所以这次的收购也需要中国方面的批准。 可以看到，光子学领域的巨头们由于为了营收增加，为了完善产品线和竞争对手对抗，竞相开始进行合并和收购工作，强强联合。前几个月Lumentum输掉了收购Coherent的并购，反而让II-VI成功竞标Coherent。所以，这次很快就并购NeoPhotonics也是一次完成对光通信领域的目标，并完成对产品线的互补。NeoPhotonics主要生产用于云计算和光通信应用的光子学零部件，Lumentum 60%的收入来自于类似的应用，但是其他的应用包括3D传感和Lidar应用以及用于材料处理的光纤激光器等。 新闻稿 三星参投波导厂商DigiLens D轮融资评论：Digilens正在进行D轮融资，其中三星参投，但是该公司并未说明具体融资金额，只是表示公司估值达到5亿美元。 新闻稿 索尼谈颠覆性SWIR图像传感器评论：Sony官网上周发布了一篇文章：“小尺寸，高解析度SWIR图像传感器，工业界最小尺寸pixel将给检测应用带来创新”的文章（Small and high-resolution SWIR Image Sensor with the Industry’s smallest pixel size will bring about innovation in the world of inspection.），其中，四位索尼的工程师就SWIR图像传感器分享了他们的经验，这次Sony开发的基于InGaAs的可见光和SWIR同时传感的传感器。SWIR可以穿透水，硅等物质，所以可以用于食品检测，晶元检测等应用。 原文 Luvoir下一代天文望远镜评论：随着James Webb天文望远镜的发射的临近，NASA的下一代天文望远镜也开始进入人们的视野。LUVOIR(Large Ultraviolet Optical Infrared Surveyor)作为下一代的方案，会使用8m或者15.1m的主镜，计划发射时间2029年。Luvoir的主要任务会是研究地外行星，太阳系系统以及宇宙起源。 Luvoir项目主页 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"光学新闻 20211031","slug":"OpticsNews20211031","date":"2021-10-31T06:00:00.000Z","updated":"2021-12-04T11:32:05.724Z","comments":true,"path":"OpticsNews20211031/","link":"","permalink":"https://faster-than-light.net/OpticsNews20211031/","excerpt":"近期比较忙，停更了两周，以下是过去三周个人比较感兴趣的五篇光学新闻： 索尼发布新手机Xperia Pro-I — 滨松光子发布首个量子级联光子探测器 — 哈佛大学开发新型超表面结构 — 雷鸟创新发布雷鸟智能眼镜先锋版— “羲和号”发射成功！中国正式步入“探日”时代","text":"近期比较忙，停更了两周，以下是过去三周个人比较感兴趣的五篇光学新闻： 索尼发布新手机Xperia Pro-I — 滨松光子发布首个量子级联光子探测器 — 哈佛大学开发新型超表面结构 — 雷鸟创新发布雷鸟智能眼镜先锋版— “羲和号”发射成功！中国正式步入“探日”时代 索尼发布新手机Xperia Pro-I评论：Sony 5月份的时候推出了自己的Xperia 1和Xperia 5 Mark III，当时还写了一片文章分析其光学变焦长焦，Sony Xperia 1&amp;5 Mark III变焦镜头。本周，Sony又发布了自己的Xperia Pro-I，主打影像手机，甚至可以称为有打电话功能的照相机，宣传片基本提的都是其影像功能，宣传图也直接把这个手机和Sony的其他超相机摆在了一起。可以看到，现在Xperia这款手机的产品策略已经是主打专业摄影了。这次的Xperia Pro-I包括F/2.0、F/4.0可变光圈，配备1英寸sensor，Zeiss Tessar加T*镀膜加持的主摄，实体拍照按键，甚至还留了系绳槽。同时配备有广角，长焦，和TOF辅助对焦。其中，可变光圈的实现看起来是个机械结构，通过两个光阑片的组合形成大光圈和小光圈。该款手机售价高达1799美元。 官网 滨松光子发布首个量子级光子联探测器评论：滨松光子成功生产世界首个量子级联光子探测器，quantum cascade photodetector (QCD)，P16309-01。这钟新型探测器使用了一种量子结构和特别设计的电路设计以增强对于中红外的敏感度。这种新型的QCD传感器可以实现2-20GHz的截止频率，是世界上在室温工作的可以买到的最高速的中红外传感器。使用这种QCD传感器的分析设备，可以用于进行皮秒级的化学反应分析。其他应用包括高速，大容量空间通信或者远距离激光雷达。 新闻稿 哈佛大学开发新型超表面结构评论：超表面是与光互动的纳米级结构。大多数超表面使用纳米柱来聚焦、整形和控制光线。纳米柱越高，光通过纳米结构的时间就越长，使超表面对每种颜色的光有更多的控制。但是柱型横纵比是受限的，太高了会弯折或者粘连。哈佛大学的研究人员开发了另一种超表面，使用孔洞的形式来实现超表面，研究结果发表在Nano Letters上。这种新的超表面使用1200万针状的孔，整体在一个5um厚的硅膜上，大概1/20头发丝的厚度。每个长条形孔洞大概几百纳米直径，这就相当于实现了30：1的高宽比。通过这种更多自由度的设计，这种超表面可以控制更多的颜色的光，给消色差透镜设计带来了新的可能。 新闻稿 雷鸟创新发布雷鸟智能眼镜先锋版评论：TCL电子孵化的雷鸟创新发布了一款AR眼镜：雷鸟智能眼镜先锋版。这是继Facebook，华为，小米等发布智能眼镜后，又一款智能眼镜。当我们说智能眼镜是，一般是为了和AR或者MR眼镜区分，这种眼镜可能带有显示功能，但是并不能有AR或者MR功能。据雷鸟创新表示，为了实现佩戴舒适，产品整体重量是不能超过 60 克的。为了实现这一目标，经过多年无数次的实验，最终找到切实可行的方案——全息光栅的衍射光波导搭配 MicroLED 技术方案。根据行业信息，其显示和光机部分应该来自于JBD，光波导来自于Waveoptics。 不提这里的技术，这条新闻代表随着衍射光波导以及AR显示逐渐成熟，供应链开始完善，开始有着各种器件可选的情况下，终端公司开始下场，尝试推出自己的产品。 宣传视频 “羲和号”发射成功！中国正式步入“探日”时代评论：转自人民网 10月14日18时51分，我国在太原卫星发射中心采用长征二号丁运载火箭，成功发射首颗太阳探测科学技术试验卫星“羲和号”，实现我国太阳探测零的突破。这标志着我国正式步入“探日”时代。“羲和号”将实现国际首次太阳Hα波段光谱成像的空间探测，填补太阳爆发源区高质量观测数据的空白，提高我国在太阳物理领域研究能力，对我国空间科学探测及卫星技术发展有重要意义。 国际首次 在太空进行Hα谱线研究 “羲和号”的全称是太阳Hα光谱探测与双超平台科学技术试验卫星，运行于高度为517公里的太阳同步轨道，主要科学载荷为太阳空间望远镜。卫星在轨运行期间，将观测太阳耀斑和日冕物质抛射的光球及色球表现，探究太阳爆发的源区动态特性和触发机制，同时探测太阳暗条形成和演化过程的色球表现，揭示其与太阳爆发的内在联系，还将获取全日面Hα波段多普勒速度分布，研究太阳低层大气动力学过程，为解决“太阳爆发由里及表能量传输全过程物理模型”等科学问题提供重要支撑。国家航天局对地观测与数据中心主任、高分辨率对地观测重大专项工程总设计师赵坚表示，“羲和号”卫星在轨开展的相关试验，有望获得有国际影响力的科学产出，将显著提高我国在太阳物理领域的国际影响力。我国在太阳观测领域发表论文数量已居世界第二位，但使用的数据均来自国外卫星数据。赵坚表示，“羲和号”发射成功，打破我国在此领域的被动局面，我国将成立卫星数据科学委员会，制定数据政策，供国内外科学家研究、使用、共享卫星探测数据，力争产生原创性科学成果。 国际首创 采用双超新技术卫星平台 “羲和号”采用了国际首创的超高指向精度、超高稳定度的双超卫星平台。赵坚表示，随着我国航天产业的发展，对地观测、空间科学探测等各类航天任务对高性能卫星平台的需求越来越迫切，尤其亟须发展具有超高指向精度、超高稳定度指标的卫星平台。“羲和号”卫星平台采用“动静隔离非接触”总体设计新方法，将平台舱与载荷舱物理隔离，阻断平台舱微振动对载荷工作的影响。与传统卫星平台相比，“羲和号”卫星平台的指向精度、姿态稳定度均提高了2个数量级。“羲和号”高性能技术卫星平台在轨试验成功后，是世界上首次将磁悬浮技术在航天器上进行工程应用，将大幅提升我国空间观测技术水平。未来，双超平台技术还将在高分辨率对地详查、大比例尺立体测绘、太阳立体探测、系外行星发现等新一代航天任务中开展广泛应用，助推我国空间科学和空间技术跨越式发展。 太阳探测的“中国方案” “我国作为航天大国，及时开展太阳探测活动，十分必要，不能缺席。”赵坚强调。中国目前已经制定了两个太阳探测计划：“羲和”和“夸父”。“羲和号”是太阳Hα光谱探测与超高指向精度、超高稳定度卫星平台试验的科学技术试验卫星，实现我国太阳探测破冰之旅。羲和是中国上古神话中的太阳女神，是掌管时间和历法的太阳神，并以太阳母亲的形象为人所知。“夸父”计划是研制发射先进天基太阳天文台卫星，对太阳进行科学观测，已纳入中国科学院先导计划。夸父源自《山海经》，夸父追日，最后化身为夸父山的传说广为人知。赵坚介绍，两个计划经过多年的准备，正在拉开帷幕。“羲和号”卫星重量508公斤，设计寿命3年，运行于517公里高度、倾角98度的太阳同步轨道，该轨道将经过地球的南北极，能够24小时连续对太阳进行观测。“夸父”计划天基太阳天文台卫星计划明年发射，同样运行于太阳同步轨道，轨道高度约700公里。赵坚透露，我国正在论证后续太阳探测发展计划，科学家们希望按照在黄道面内多视角探测（首选地日拉格朗日L5点）、大倾角太阳极区探测和太阳抵近观测“三步走”进行实施，由易到难，逐步深入，进一步了解太阳构造，确定太阳活动的三维结构，掌握机理和活动规律，预报空间天气，趋利避害，造福人类。 新闻稿 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"光学新闻 20211010","slug":"OpticsNews20211010","date":"2021-10-10T05:00:00.000Z","updated":"2021-12-04T11:32:05.723Z","comments":true,"path":"OpticsNews20211010/","link":"","permalink":"https://faster-than-light.net/OpticsNews20211010/","excerpt":"本周五篇光学新闻： 佳能发布用于VR的DUAL FISHEYE镜头 — Light Field Lab展示SolidLight全息显示平台 — 广达2000万美元增持以色列AR技术公司Lumus — 更亮，更小的全彩LED — VCSEL拓扑激光阵列","text":"本周五篇光学新闻： 佳能发布用于VR的DUAL FISHEYE镜头 — Light Field Lab展示SolidLight全息显示平台 — 广达2000万美元增持以色列AR技术公司Lumus — 更亮，更小的全彩LED — VCSEL拓扑激光阵列 佳能发布用于VR的DUAL FISHEYE镜头评论：佳能发布了RF5.2mm F2.8 L DUAL FISHEYE，专用于VR摄影的镜头，售价275000日元。它集成了全新的双光学数码相机镜头和面向高端数码相机EOS R5的新固件来实现180度立体视图的捕捉，同时又配备了用于后处理的新款软件程序。镜头的光圈为f/2.8至f/16，两枚鱼眼镜头相距60mm，接近于人类IPD。 官网 Light Field Lab展示SolidLight全息显示平台评论：硅谷初创公司Light Field Lab展示了名为SolidLight的全新显示平台，并表示这是有史以来最高分辨率的全息显示器。该公司专注于生产全息图的小型子模块/全息模块，称为SolidLight Surface。每个子模块是16K×10K像素，显示表面是6英寸乘4英寸。将15个全息图子模块/全息砖块组合在一起，可以组装一个28英寸的全息显示器。技术上主要的部分一部分被称为Photonics Array &amp; Nanoparticle Polymer Fused Surface Energy Relay，一部分被称为Complex Phaseguide Modulation Surface，个人认为都是发明出来的奇怪高端名词，最后的技术实现可能甚至是Looking Glass的方案。比如把OLED/LCD显示屏叫做Photonics Array，把柱镜光栅/微透镜阵列叫做Nanoparticle Polymer Fused Surface Energy Relay。还需要更多信息去判断实际使用的方案。 新闻稿 广达2000万美元增持以色列AR技术公司Lumus评论：台湾笔记本厂商广达电脑（Quanta Computer）发布公告，宣布参与认购以色列扩展现实（AR）公司Lumus 特别股，以每股63美元购入31.74万股，投资金额达到2000万美元。广达此前曾在2016年投资以色列光学元件AR公司Lumus，此次增持之后，广达累积持有Lumus持为10%。市场认为，广达与Lumus合作，将共同开发AR整机系统，甚至合作智能眼镜产品所需的镜头元件，抢攻AR市场。资料显示，Lumus成立于2000年，是一家专注于AR光学器件的技术厂商，主要产品为应用于AR眼镜的光学显示器模组，包括微型显示器（Micro-display Pod）和反射光波导镜片（Light-guide Optical Element ，LOE)。相比目前常见的衍射波导镜片来说，反射波导镜片在光效率方面具有明显优势，即可拥有更高的亮度和更透明的透镜。 这次合作可能更多的是正常一次投资行为，继续加深合作。Lumus的重要生产合作伙伴是Schott，广达电脑和水晶光电。 新闻稿 更亮，更小的全彩LED评论：沙特阿拉伯的研究者们使用一种方法，制备出17平方um的红色LED。传统LED缩小的方法中，由于生产问题，会在LED的侧壁上出现小的裂纹，导致漏电流，最终造成光输出降低，限制了LED的大小在400平方um左右。这只团队使用了一种方案去控制侧壁漏电现象，首先团队小心的使用金属氧化物气相外延技术（MOPVE）生成InGaN红色LED，然后使用光刻蚀刻出10x10的阵列，每个LED17x17的mesa。最终步骤里，使用化学蚀刻流程清洗侧壁，可以移除侧壁的瑕疵缺陷。最终的LED性能从1mW每平方毫米上升到1.76mW每平方毫米。 论文 VCSEL拓扑激光阵列评论：以色列和德国的研究者们开发了一种方式去强制一个阵列的VCSEL激光一起工作，如同一个单一的激光器一样，工作发表在Science上。这次的工作室将VCSEL通过特殊的几何排布，强迫光通过特定的路径，被称为光子拓扑绝缘体平台。拓绝缘体绝是一种创新的量子材料，可以在内部进行隔绝但是外表面可以让电流通过。几年前，由Prof. Mordechai Segev领导的 Technion Group 证明了第一种光子拓扑绝缘体，让光可以在2维的波导中传播，这开创了一个新的研究领域，被称为拓扑光子学，现在有上百个研究小组在进行相关的研究。这次针对于VCSEL的研究未来有很多应用场景，包括医疗，通信等，比如可以更好地进行通信设备的大规模集成等。 新闻稿 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"TOF系统 第三章 iTOF系统","slug":"TOF系统 第三章 iTOF系统","date":"2021-10-07T12:00:00.000Z","updated":"2021-12-12T12:55:56.999Z","comments":true,"path":"TOFSystem_C3/","link":"","permalink":"https://faster-than-light.net/TOFSystem_C3/","excerpt":"第一章中我们介绍了TOF的基本原理，应用，系统架构和分类。第二章中，我们详细介绍了dTOF系统，系统原理，架构和零部件性能出发，分析重要的系统参数。本章，我们会用同样的形式介绍iTOF系统。阅读本章前，请阅读第一章。","text":"第一章中我们介绍了TOF的基本原理，应用，系统架构和分类。第二章中，我们详细介绍了dTOF系统，系统原理，架构和零部件性能出发，分析重要的系统参数。本章，我们会用同样的形式介绍iTOF系统。阅读本章前，请阅读第一章。 iTOF基本原理和核心组件如第一章的介绍，iTOF的原理是测量发射的正弦波/脉冲信号与接收的正弦波/脉冲信号之间的相位差的方法计算出时间。iTOF可以按发射光波的调制方式分成连续波调制（CW-iTOF）和脉冲调制（Pulsed-iTOF）。下图一展示了iTOF的系统架构，发射端iTOF主要也使用VCSEL，但是有一些应用里，iTOF可以使用LED。激光或LED的光线经过diffuser匀光片照射被测场景。接收端使用传感器进行接收。dTOF和iTOF在传感器端的区别是iTOF使用的是CMOS工艺开发的CIS传感器(Camera Image Sensor)以及配套电路，而dTOF需要使用SPAD传感器。CW-iTOF和Pulsed-iTOF在硬件架构上没有很大区别，主要是控制和传感电路的一些调制解调电路区别。下图二展示了一个实际的iTOF模组（由Leica和pmd联合研发），可以从外观上看到发射端的diffuser和接收端的镜头。 iTOF的主要优势是和dTOF比起来相对简单低速的硬件电路，可以实现更高的帧率，以及空间分辨率，同时模组成本也更低；但是iTOF有着测量精度随距离增加下降，多路串扰以及相对比较高功耗等问题。 激光驱动Laser/LED Driver是发射端电路的主要部分，负责驱动激光或者LED，控制电路发出调制信号，控制光源发射。发射调制的信号可以是脉冲型或者连续波型。 激光器或LED在iTOF中，根据不同应用场景的模组，选择使用VCSEL或者LED。和LED相比，激光器的调制速度快很多，高频LED的3dB roll-off 频率一般为10MHz到30MHz，而VCSEL的3dB roll-off 频率一般高于100MHz。iTOF主流还是使用VCSEL。因为调制速度越高，深度测量的精度就越高，我们会在后面的系统参数部分列出公式。下图展示了LED和激光调制能力的对比。 发射端光学iTOF发射端一般直接使用diffuser进行光束整形，让光源均匀照射被测场景，diffuser一般是玻璃基底上的规则或者非规则微结构，将VCSEL阵列发出的光进行均匀化，最后形成top hat形式的光束。 接收端光学和dTOF系统一样，接收端光学零部件需要的主要是收集期望测量的视场角内的光线，这种镜头F数越小越好，相对照度越高越好，同时镜片上可以进行一定的镀膜增强透光性，同时接收端会使用尽量窄带的滤光片，去滤除其他波长的杂光干扰。 接收传感器CMOSiTOF接收端是基于CMOS Image Sensor工艺制程的，主要使用的是 (CAPD)像素工艺。如我们第一章介绍，iTOF是一个调制解调信号的过程，为了能更准确的计算发射信号和接收信号的相位偏移，使用Current-Assisted Photonic Demodulator（电流辅助光子解调CAPD）像素工艺，该种工艺可以同步取样发射光和接收光信号。同时CAPD允许在每一个像素的光电二极管中加载可转换方向的偏转电压，制造一个漂移电场，这样可以把光信号产生的电子拉向两个不同的半导体结。如下图所示，VCSEL发射出来的光，进入传感器，被转换成电子，每个像素点在不断转换的电压的辅助下，持续输出成两个信号，通过这两个信号，就可以计算相位偏移， 以Sony的IMX556为例： 背照式CMOS工艺 640 x 480像素 Global Shutter 10.0um 像素大小 1/2”传感器大小 提供iTOF的传感器供应商有 Sony, Infineon, Melexis, Analog Devices, EPC Photonics, Samsung, Artilux等。 电路iTOF不需要特别的额外电路，传感器输出的信号经过一定的处理后和发射信号进行对比即可计算出相位偏移，但是为了实现比较好的效果，算法比较复杂。iTOF的CMOS输出是模拟信号，为了进行数字处理，还需要进行模数转换电路，但是ADC电路本身就非常普遍。dTOF直接输出的就是数字信号。 系统参数探测距离电子消费品的iTOF的探测距离受限于精度，比如1%的精度，在10米就是10cm的深度误差。所以到底多远的距离，取决于应用。电子消费品的iTOF应用，一般只能达到5m左右的探测距离。同时，由于iTOF采用泛光透射，传感器可以探测到的能量随距离降低的速度很快，随着距离增加，信噪比降低到一个程度下就完全无法区分调制信号和背景噪声了。 探测距离的精度和误差iTOF的测量精度和量程存在矛盾，同样相位解析精度下，测量精度反比于调制频率。但是高调制频率会降低测量量程，造成距离测量含糊混叠，不过这种混叠可以通过一些方式解决，比如多频率调制去歧义。我们在这里具体讨论这几个问题。当我们通过算法得到相位偏移ϕ后，距离d就如下公式所示，fmod为调制频率。 实际中，由于光子散粒噪声，读出电路噪声和多径干扰等问题，相位估计ϕ会有误差ϵϕ，那么距离估计误差ϵd如以下公式所示，可以看到，通过增加调制频率，可以降低距离估计误差。 下图也很好地展示了为什么提高调制频率可以很好地降低距离误差。 误差 产生相位估计误差的原因主要有：时钟精度，发射端电路调制精度，VCSEL的调制脉冲速度，接收传感器的精度，读出电路噪声等。比如发射和接收端的同步信号发生了10ps的偏移，就相当于1.5mm的位移。这些需要在后面的标定和校准过程中进行补偿。 距离歧义但是，使用高调制频率会造成距离估计的歧义。由于iTOF是通过计算相位后计算距离的，相位是在0-2π中变化的。根据公式，如果调制频率是100MHz，那么每1.5m，相位0-2π完成一次变化，如果是200MHz，就是每0.75m完成一次变化。假设100MHz调制频率，测出一个相位偏移是2π，那么距离可以是1.5m, 3m, 4.5m等等。解决距离歧义的一种方法是多频率调制，如下图所示，可以使用几个不同的调制频率去确认哪个距离才是真实的距离，这种方法低调制频率的部分可以提供无歧义的距离估计，而高调制频率的部分可以提供更高的精度，兼顾了测量距离和测量精度的需求。但是增加了计算量降低了帧率。最终的深度估计是通过不同调制频率得到的距离给上不同的权重进行计算，更高的频率的权重更高。如果最优选择各个调制频率的权重，深度识别误差是反比于调制频率的均方值rms的。对于一个固定的深度误差需求，增加调制频率可以降低积分时间或者降低发射光强。 噪声和抗干扰能力多路径干扰 多径干扰(Multi-Path Interference，MPI)是光线通过多个路径返回传感器，如下图所示。iTOF无法分辨哪个信号是直接返回的信号，哪个信号是经过多次反射返回的信号。学术界和工业界尝试多种方法去解决多路径干扰，但是这是iTOF原理本质上问题，无法完全根除。 飞点噪声 飞点噪声是深度信息图里出现的不连续的无效深度信息，如下图所示，a图示深度点云图，红色代表距离更近，蓝色代表距离更远；b图示强度值，c图是振幅值。飞点噪声是下面的白圈中展示的情况，形成原因是在深度变化较大的位置（不连续），物体反射率不是很好，传感器同时接收到前景和后景反射回来的能量，这两个能量叠加在一起，使原始数据中包含了两部分的信息，于是计算深度时就无法得到准确的深度值。下图中左上角的白圈里的飞点噪声是另一种现象，深度信息错误是由于显示屏上部的高反射造成的。同时镜头散射，像素间的串扰等问题也会引起飞点噪声。 空间图像分辨率现阶段电子消费品iTOF使用的sensor多为QVGA或者VGA(0.3MP，10um像素大小)，三星在2021年初的一个会议论文中推出了1.2MP的iTOF传感器。 功耗iTOF需要采用高频调制发射相对较高功率的激光，相对于dTOF，平均功率要高。 工艺分析对于i-ToF的发射端，前面我们分析了，如果想提高精度，就要提高调制频率，所以需要高频率高功率调制的驱动芯片。这种芯片和VCSEL的温度系数与 i-ToF 测量的温漂紧密相关，需要尽可能保证线性。同时，在接收端，虽然iTOF的传感器没有SPAD传感器制造起来难，但是也需要有足够的灵敏度，动态测量范围，足够的像素尺寸。对于普通的图像传感器，需要增加2TAP或者4TAP的采样和控制电路。 iTOF的标定和校准iTOF校准一般来说需要进行以下几种校准：镜头校准，频率校准，非线性校准，相位共偏校准 ，逐像素校准，温度校准 。如下图所示，展示了校准的过程，温度校准参数独立于其他几个校准流程。 镜头校准 镜头校准主要校准镜头的光学中心和畸变等问题，使用张正友标定算法进行。 频率校准 设定的调制频率和实际产生的频率是有误差的，需要校准。 非线性校准 发射端的光波不是理想方波或者正弦波，会产生误差，这种误差表现为测量得到的相位差，与理想的相位差之间有偏差，这个偏差呈现一定的变化规律，在2pi的相位范围内，呈现误差先变大再变小的规律。见上图中非线性校准中的绿线和红线，绿线是一个圆代表理论相位，红线是实际相位。这种误差可以使用插值查表法进行非线性误差补偿。主要是对于波长范围内，均匀选取多个位置，记录真实距离和深度测量值，然后进行插值，得到对应相位的表数据，在测量到这个相位的时候，就对该相位进行补偿。这种校准也叫Wiggling标定校准或Cyclic error calibration。 共偏校准 完成前几步校准后，进行共偏校准。共偏校准是确定图像中心的相位偏移，然后基于已知确定的距离进行校准。 逐像素校准 逐像素校准是校准非中心的像素距离测量值。完成共偏校准后，测量一个平面时，可能会得到一个不是很平的有起伏的深度点云，这时就需要进行逐像素的校准和补偿。这时整个校准的最后一步。也叫Pixel dependent offset calibration。 温度校准 由于温度变化导致测量产生相位偏移并造成误差的影响因素有两个：光源和接收传感器。光源端，发射波长随着温度的升高会发生红移现象。计算深度的波长和实际波长不一致，这就会导致检测的深度值出现误差。接收传感器端，存在由于温度上升导致测量出的深度值也变大的情况，这种和温度线性相关的现象称为温飘。这种温度补偿通过测量不同温度下的TOF性能，发射及接收的参数，计算出补偿参数，写入模组。实际模组通过使用NTC测量温度，在不同温度下使用不同的温度补偿系数。 参考模组以下列出一些参考模组，供读者研究学习 Analog AD-96TOF1-EBZ开发板 Analog ADSA3100传感器 光鉴科技Stellar 200 飞芯电子 光微科技 Omron B5L Texas Instrument OPT8241 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"TOF系统","slug":"TOF系统","permalink":"https://faster-than-light.net/categories/TOF%E7%B3%BB%E7%BB%9F/"}],"tags":[{"name":"TOF","slug":"TOF","permalink":"https://faster-than-light.net/tags/TOF/"},{"name":"专题","slug":"专题","permalink":"https://faster-than-light.net/tags/%E4%B8%93%E9%A2%98/"}]},{"title":"浅谈吸收光谱学 第一章 光谱学及吸收光谱测量","slug":"浅谈吸收光谱学 第一章 光谱学及吸收光谱测量","date":"2021-10-05T03:00:00.000Z","updated":"2021-12-04T11:32:05.730Z","comments":true,"path":"Spectroscopy_C1/","link":"","permalink":"https://faster-than-light.net/Spectroscopy_C1/","excerpt":"浅谈吸收光谱学这个系列来自于作者Jenkins（微信号：Jenkins123，作者具体介绍见文末）的投稿，作者将通过3章的内容介绍光谱学分类，重点探讨吸收光谱学中的两种痕量测量方法：腔体增强型吸收光谱测量（Cavity Enhanced Absorption Spectroscopy，CEAS）以及腔衰荡光谱（Cavity Ring-Down Spectroscopy, CRDS）。 本文是第一章，介绍光谱学分类及吸收光谱学中的具体技术分类及他们的应用范围。","text":"浅谈吸收光谱学这个系列来自于作者Jenkins（微信号：Jenkins123，作者具体介绍见文末）的投稿，作者将通过3章的内容介绍光谱学分类，重点探讨吸收光谱学中的两种痕量测量方法：腔体增强型吸收光谱测量（Cavity Enhanced Absorption Spectroscopy，CEAS）以及腔衰荡光谱（Cavity Ring-Down Spectroscopy, CRDS）。 本文是第一章，介绍光谱学分类及吸收光谱学中的具体技术分类及他们的应用范围。 作为开篇笔者想借用工作上一本入门书《An Introduction to Cavity Ring-DownSpectroscopy》的第一章来打开光谱学以及直接/间接吸收光谱学这个话题：“光谱学，研究光（电磁辐射）和物质的相互作用，是物理科学家可用的最普遍和最精确的方法。特别是对于孤立的原子、分子和小簇，它没有同伴。它用于阐明从原子核到天然蛋白质的量子系统的结构和动力学。基本上我们所知道的超出人类和他们的仪器可以物理接触范围关于宇宙的一切都，来自光谱学。没有它，天文学只不过是集邮而已。虽然是一个成熟的领域，但光谱学是周期性的通过开发新工具重生，开辟新视野，例如开拓未充分探索光谱区域，显著提高分辨率或灵敏度。几乎总是，这些新的工具最初并没有这么高的预期，并且最早是用于解决一些特定的问题。然而，真正开创性的工作会激发并导致新应用程序的爆炸式增长以及方法的进步。核磁共振波谱是这段经历的缩影。” 光谱的分类光谱分类多种多样，主流的分类方式有根据最终测量的辐射能量类型或者是光与物质相互作用的方式，这里使用后一种光谱学根据测试能量产生方式可以分为：发射光谱、散射光谱、反射光谱和吸收光谱。 发射光谱有的物体能自行或者激发后发光，由它直接或被激发产生的光形成的光谱叫做发射光谱。例如荧光反应，黑体辐射产生的光谱等 散射和反射光谱弹性散射和反射光谱决定了入射辐射如何被材料反射或散射。晶体学利用高能辐射（例如 X 射线和电子）的散射来检查蛋白质和固体晶体中原子的排列。当光照射到物质上时，还会发生非弹性散射，在散射光中除有与激发光波长相同的弹性成分（瑞利散射）外，还有比激发光波长长的和短的成分，后一现象统称为拉曼效应。这种现象于1928年由印度科学家拉曼所发现，因此这种产生新波长的光的散射被称为拉曼散射，所产生的光谱被称为拉曼光谱或拉曼散射光谱。 吸收光谱当来自辐射源的能量被材料消耗时，就会发生吸收。吸收通常通过测量通过材料的能量的比例来确定，吸收会减少通过光的部分。本系列文章主要重点介绍直接吸收光谱。 直接吸收光谱最简单也是最早发展的光谱计量方法就是直接吸收光谱（Direct absorption spectroscopy）。直接吸收光谱是一种简单、无创并且可在样品原生状态下使用的技术，用于获得有关气相、液相或固相中物种的信息。通过分析吸收光谱，可以提取定量绝对浓度或绝对频率相关信息。在直接吸收实验中，光穿过一个样品后的衰减过程被测量（如下图所示）。 透射后的强度遵循 Beer-Lambert 定律：I = I0*exp(-ad) ，其中 Io 是入射光的强度，d 是样品的长度， α是吸收样本系数。我们这里假设吸收发生在单一物种样品： a(v) = Nσ(v) ; σ(v)是吸收的横截面积， N 是样品的密度信息（单位体积内的分子数量）， v 是光源的频率（波段）。 单程通过吸收池经典的直接吸收光谱计量方法的例子就是单程通过吸收池（single pass absorption cell）的例子，如下图所示: 这里的光源是可调谐激光器(波段可调)，样品（例如气体）包含在吸收池cell中。激光通过第一个窗口W进入吸收池，经过吸收衰弱过的激光通过第二个窗口W穿出吸收池被特定的传感器接收。实验者通过记录光强vs波长，可以得到吸收池中样品的吸收光谱。 下图展示了氢气的吸收光谱 单程吸收技术原理最简单，是最早的直接吸收光谱计量方法，但是其灵敏度低，限制了它在许多研究领域的应用（例如痕量气体检测，既及其微量的气体检测）。这种低灵敏度主要因为这种计量方法必须在高强度的背景信号（与光强成正比）下测量小强度的光衰减，导致信噪比不优秀。即使是稳定的光线来源，这种计量方法最多只能检测到背景信号0.1%级别的信号变化。常用的单程通过吸收池方法会使用的脉冲激光器，脉冲激光器很难保证时域上不同的脉冲的绝对值强度相同，所以对于绝对剂量的检测是存在一定误差的。 间接吸收光谱随着应用端的需求，单程池直接吸收光谱测量法因其的局限性没办法满足灵敏度和精准度的要求（sensitivity and accuracy），科学家们就开始通过使用间接吸收技术来提高灵敏度，这些技术是测量光吸收引起的效应而非测量光本身的吸收。 激光诱导荧光在激光诱导荧光 （laser induced fluorescence，LIF) 技术中（如下图所示），被测物体分子吸收光并激发荧光（荧光，即当分子衰变回它们的基态时发出的光），然后测量这个荧光。原则上，LIF 是一个不受背景信号干扰的技术，但来自激发激光的散射光可能会增加噪声。降低噪声的方法有：如果发射中有明显的斯托克斯位移（Stokes effect，即激发光波段和荧光发射波段在光谱上错开），可以使用滤波器阻挡大部分散射光；还可以使用时间门控（time-gated）检测来阻止大部分剩余的散射光同时仍能检测大部分荧光。但是LIF 不太适合高气压气体测量的应用，由于高压下会产生的碰撞淬灭（collision quenching，由于高压环境，被激发的荧光团与分子或者原子直接接触导致激发态变化到基态的过程中不发射光子）和散射增加。 共振增强多光子电离在共振增强多光子电离 （resonant enhanced multiphoton ionization，REMPI）测量技术中，待测样品中分子可以通过中性分子的中间能级吸收两个或更多光子后电离。在许多情况下，REMPI 提供了单光子光谱方法无法获得的光谱信息，例如，使用这种技术很容易看到分子中的旋转结构。REMPI 理论上也是不受背景信号干扰的，可以与批量的光子选择相结合，通常使用飞行时间方法（这里笔者不多赘述，感兴趣可以自行google）。尽管具有高灵敏度和选择性，REMPI在大气条件下难以进行。也很难用它来检测经历快速非辐射衰减的振动跃迁或激发电子态。由于 REMPI 检测的多光子特性，绝对信号强度取决于聚焦甚至激光脉冲形状，这使得它很难使用REMPI 用于定量测量。 光声光谱光声光谱 （photoacoustic spectroscopy，PAS）方法也是一种间接吸收光谱法。当分子中沉积的能量不再重新释放时，碰撞弛豫（collisional relaxation）将这种能量转化为热量，这将提高气体的温度和压力。因此，样品对调幅调制光束的吸收将产生可检测的声波。这种光声（或光声）效应是由亚历山大·格雷厄姆·贝尔 (Alexander Graham Bell) 首次研究发现。这种反应所产生的声音的幅度与样品吸收的光强度成正比。使用可调谐激光源，声级检测与激光频率的关系可以被记录下来，这被称为光声光谱 (PAS)。PAS 可应用于固体、液体和气体，并且仅对样品吸收敏感，没有散射损失。在许多实验中，样品包含在一个声共振结构中，入射光源也在共振频率调制，这也能显著增强信号。由于人耳的阈值灵敏度和最低噪声麦克风，是一个压力单位增加10^-9 bar，只需要很小的热量就可以产生可检测的声音信号。即使是在高功率激光入射时，使用连续波激光器吸收监测的灵敏度仍能维持在10^-10cm^(-1), (cm-1 也做波数，常做光谱相关的能量单位)。这个灵敏度已经可以和我们的主角外腔体吸收光谱计量 CRDS 的灵敏度极限相当。然而当只有低功率激光器可用时，灵敏度要低得多。环境噪声和噪声气流产生的气体也会显着降低灵敏度。 目前PAS 仪器利用石英音叉提高了环境噪声抗扰度和检测能，目前能够测试一立方毫米的气体样品。 PAS 需要足够的压力进行碰撞弛豫以及有效率的与麦克风声学耦合，因此灵敏度在气体压力低于1bar的情况下受影响很大。由于是间接检测，设备需要定期用校准样品以获得绝对吸收截面面积或浓度数值。 《An Introduction to Cavity Ring-Down Spectroscopy》的一位共同作者就因为校准过程的难度从而放弃了PAS 并且转投校准难度更小的CRDS。 如下图所示，待测固体样品置于密封容器中，并附有小麦克风，当调制的红外光束被样品吸收时，入射光会产生热量。这种热量会导致周围气态层的压力发生变化，高灵敏度麦克风可以检测到这种变化。来自麦克风的信号是声干扰波。对这些信号应用傅立叶变换会产生类似于吸收光谱的光谱。 腔体增强型吸收光谱及腔衰荡光谱测量尽管间接吸收技术具有惊人的灵敏度，但它们并不会自校准，这意味这我们仅能获得相对吸收系数。直接吸收光谱最大的优点就是它提供了获得绝对吸收系数最直接的方法，但是我们前文描述了，单程吸收光谱受限于灵敏度不足。通过以下方式可以提高其灵敏度： 增加通过样本的路径长度（即增加前文公式中的 d），这个可以通过复杂的多程池配置来实现。 多程池由两个或更多高反射镜组成。每次反射时，光都会通过不同的光路穿过细胞。随着配置的改进，可以实现几百米的吸收路径长度。然而，在这些传统的多程吸收池中，光子的单个程（pass）必须是在空间上分开。这导致需要使用相对较大的镜子和样品体积。此外，即使是非常小的光线空间重叠也使不同的通过光（multi-pass light）产生干涉条纹从而增加吸收光谱的噪声，这通常会限制灵敏度。 我们也可以通过快速 (fm ~ 100 MHz) 频率调制的激光，检测高频吸收，从而提高灵敏度。这种检测方法被称为调频 (FM) 光谱，使用这种方法可以使检测到的样品吸收参数灵敏度达到10^(-6)cm^(-1)，当组合路径长度达到100m，吸收系数测量灵敏度可以达到10^(-10)cm^(-1)。然而，这种敏感性仅适用于吸收光谱线宽(linewidth)与调制频率相当的吸收特征，线宽越大，吸收参数监测灵敏度会随之下降。 然而现实情况下在多程吸收池的结构中，光子会在吸收池中的多次穿过（multi-pass），会有空间上的重叠，虽然这种情况并不是最初所能预见的理想情况，但却能大大减少需要探测样品的体积，并且更进一步说，由于允许不同光程相互重叠，空间上不需要互相独立，样品的通过光程次数原则上仅受镜片镀膜和样品的损失限制，从而可以提高灵敏度。在这种情况下，吸收池便充当光学谐振器，并且只能在非常窄的频率范围内传输光（如果镜面反射率非常高）。这种情况下，微小 (kHz) 级的激光频率不稳定或机械抖动也会导致吸收光谱的高噪声，直接使用这种多程吸收池似乎没法在现实中应用。但是，如果我们将重点转移到把多程吸收池视为光的存储容器，上述问题就能得到克服，并且这种新技术对微量样品的灵敏度比以前高得多。这种分析光强vs时间函数的计量方法就引出了我们系列的主角腔衰荡光谱（Cavity Ring-Down Spectroscopy，CRDS ）和腔增强吸收光谱（Cavity Enhanced Absorption Spectrscopy，CEAS）。两者略有不同，CRDS主要是通过计算通过外腔体的光强vs 时间函数 来算出入射激光在腔体中停留时间从而计算出外腔体中的气体吸收系数；而CEAS，使用同样的外腔体，测量通过外腔体的时间平均光强对照初始入射激光强度来计算出样品气体吸收系数。我们会在后面的章节对这两种痕量光谱检测技术进行细致的讨论。 Reference本系列文章主要参考于 《Cavity Ring-Down Spectroscopy Techniques and Applications》，作者：Giel Berden, Richard Engeln 《Cavity-Enhanced Spectroscopy and Sensing》， 作者：Gianluca Gagliardi, Hans-Peter Loock 光于本文作者Jenkins：笔者光学背景，对光学最早产生兴趣来自于光谱学，研究生毕业以后来到美国中西部的一家气体监测设备产商任职，主要负责研发OF-CEAS 光谱可携带仪器，用于监控土壤的温室气体痕量检测，笔者想结合自己的经历以及这两本工作上的启蒙教材比较详细的介绍高灵敏度高精度的现代吸收光谱学计量方法。有兴趣的朋友可以加微信：Jenkins123 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光谱学","slug":"光谱学","permalink":"https://faster-than-light.net/categories/%E5%85%89%E8%B0%B1%E5%AD%A6/"}],"tags":[{"name":"专题","slug":"专题","permalink":"https://faster-than-light.net/tags/%E4%B8%93%E9%A2%98/"},{"name":"光谱学","slug":"光谱学","permalink":"https://faster-than-light.net/tags/%E5%85%89%E8%B0%B1%E5%AD%A6/"}]},{"title":"光学新闻 20211003","slug":"OpticsNews20211003","date":"2021-10-03T07:00:00.000Z","updated":"2021-12-04T11:32:05.723Z","comments":true,"path":"OpticsNews20211003/","link":"","permalink":"https://faster-than-light.net/OpticsNews20211003/","excerpt":"本周五篇光学新闻： 中国首颗LCOS芯片得到商用 — ST开始量子点图像传感器生产 — 多光谱地球探测卫星Landsat 9成功发射入轨 — 光学3D打印制造疫苗微针注射贴 — Trumpf开发激光打印牙科拱座","text":"本周五篇光学新闻： 中国首颗LCOS芯片得到商用 — ST开始量子点图像传感器生产 — 多光谱地球探测卫星Landsat 9成功发射入轨 — 光学3D打印制造疫苗微针注射贴 — Trumpf开发激光打印牙科拱座 中国首颗LCOS芯片得到商用评论：9月28日，上海慧新辰实业有限公司（下称“慧新辰”）和成都德利普光电科技有限公司在深圳发布LCOS显示芯片投影应用产品。这意味着纯国产LCOS芯片首次在国内智能投影领域得到市场化应用。慧新辰目前是上市公司ST晨鑫(002447.SZ)旗下公司。ST晨鑫称，对于国产LCOS芯片，其已具备月产8万片的生产能力。成都德利普为国内知名投影光学引擎生产企业，拥有全套LCoS、LCD、DLP投影光学引擎生产线，以及完整的光学元件配套加工能力，年产各型投影光学引擎数十万套。公司拥有或申请了多项具有重大市场价值的投影光学引擎技术发明专利，一直致力于推动中国投影行业向更高水平发展。 这个新闻喜忧参半，一是LCoS型产品的国产化是个好事情，另一方面这个晨鑫公司挂着一个ST，总是感觉这件事情后续的发展存在着不确定性。 新闻稿 ST开始量子点图像传感器生产评论：2021年5月份，ST在年度的显示器协会论坛上，发布了公司已经准备好商业化量子点传感器平台技术，其940nm的工程样品已经准备好在2021年下半年出货，其SWIR(&lt;1400nm)的样品会在2022年准备好。ST声称该项技术可以极大地降低传感器价格（100-1000倍），实现高性能，高分辨率，高光谱响应的图像传感器，可以在未来大规模推动SWIR的图像应用的增长。潜在的应用场景有手机，小型化光谱仪，混合光谱成像，机器视觉以及高级驾驶辅助。值的注意的是现阶段的研究已经显示出了超过TOF应用需求的芯片速度。ST开发的技术是使用Nanoco公司生产的量子点纳米材料。如果成功，该项目可以最终在2023年进入量产，该量产有Nanoco在Runcorn的量产工厂保证其材料产能。Nanoco也正在和眼周的一家大型化工企业合作，开发量子点传感器的红外传感应用。该亚洲客户期望在自己的材料中结合Nanoco的纳米材料，并进行全球化的销售。该公司的量产可能会在ST量产的1年到18个月后。 量子点传感器的技术优势有：直接和CMOS技术集成；近红外应用中提供比硅基传感器更好的量子效率，更好的传感性能，更低的功耗；可以实现短红外（SWIR）区域（1100-2000nm）的传感，而不像硅基传感器，对于1100nm是投过的，同时作为InGaAs传感器的低成本替代；扩展应用波长，最终使用在LiDAR，机器视觉，TOF等应用中的潜力。 Nanoco分析 多光谱地球探测卫星Landsat 9成功发射入轨评论：NASA确认Landsat 9地球成像卫星成功发射，该卫星是持续50年的任务的最新版，第一代是Landsat 1号卫星。Landsat 9号卫星携带了两台最高水平的光学和红外传感设备，可以提供图像和数据用于监控环境问题，包括水资源，森林火灾，珊瑚变化，冰川和冰盖变化，热带雨林减少等科学问题。Landsat携带的两台设备是Operational Land Imager 2 (OLI-2) 和Thermal Infrared Sensor 2 (TIRS-2)，分别由波音和NASA的Goddard太空飞行重心开发。这两台设备可以测量地球表面反射的11个波长范围，从433nm到12um。卫星在185km的高度工作，每个像素大概是30m的分辨率。该卫星可以每16天完成一次全球的扫描，和Landsat 8错开8天。OLI-2传感器有着14个模块，每个波长范围有着大概7000个across-track sensors，500-680nm有着13000个传感器。TISR-2使用push-broom传感架构，1850像素的线性阵列可以覆盖185km的范围，使用一个四反系统。 Landsat 9项目主页 光学3D打印制造疫苗微针注射贴评论：传统疫苗注射都是使用肌肉皮内注射，就是把疫苗注射到表皮层中，这么做有很多好处，主要是人类皮肤中有着大量免疫细胞，这样，较少的注射计量就可以激发不错的免疫反馈，整体降低了疫苗的价格。近期，斯坦福大学和北卡罗来纳大学的研究者们开发了一种快速轻量的3D打印制程，来制作皮下注射微型注射贴。小鼠实验证明了该种方式可以比传统注射更好地激发免疫反应。这种2015年开发出来的3D打印技术被称为连续液体表面制造continuous liquid interface production (CLIP)，使用连续的UV光去成像照射树脂，固化树脂，在基底上生成需要的形状，并不断上移基底。这项技术的难点是UV光照射的部分是一种氧气和UV光都可透过的材料，树脂的更新在已经固化的部分和这层材料中间，保证了树脂不会粘上，斯坦福大学的研究者称这层一直是液态的树脂层dead zone，这是这种3D打印方式的突破性技术。 新闻稿 Trumpf开发激光打印牙科拱座评论：在上周德国克隆的牙科展会上，Trumpf公司展示了一种新式的，更加高效的用于生成定制植牙基座的技术。TruPrint 1000型3D打印机，特别给牙科工业制造，可以在3小时内，一次生产64个基座。植牙是牙科近期增长最块的板块，这也是为什么牙科实验室需要这种新型的技术。这种技术是激光3D金属打印技术，使用1个或者2个激光器，在金属粉末中熔化金属形成需要的形状。 新闻稿 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"光学新闻 20210925","slug":"OpticsNews20210925","date":"2021-09-25T12:30:00.000Z","updated":"2021-12-04T11:32:05.723Z","comments":true,"path":"OpticsNews20210925/","link":"","permalink":"https://faster-than-light.net/OpticsNews20210925/","excerpt":"本周五篇光学新闻： Rokid 发布消费级AR 眼镜Rokid Air — 微软专利用于MEMS激光扫描显示的宽谱激光二极管 — eMagin与美国防部签署3360万美元硅基OLED订单 — 斯坦福大学全息近眼显示图像质量优化 — 天津大学新算法展示浑浊水体成像","text":"本周五篇光学新闻： Rokid 发布消费级AR 眼镜Rokid Air — 微软专利用于MEMS激光扫描显示的宽谱激光二极管 — eMagin与美国防部签署3360万美元硅基OLED订单 — 斯坦福大学全息近眼显示图像质量优化 — 天津大学新算法展示浑浊水体成像 Rokid 发布消费级AR 眼镜Rokid Air评论：Rokid发布了消费级 AR 智能眼镜Rokid Air，采用了医疗级镁铝合金架构设计，重量是83g 超轻重量，可以折叠镜腿。光学方面，没有什么特别的，采用Bird Bath的光学方案，43° FOV，Micro OLED屏幕，每个显示屏1920 x 1080像素， 75hz 的屏幕刷新率，2000尼特屏幕亮度，同时它还具备 100000：1 的屏幕对比度。售价2999人民币。 比较特别的一点是，Rokid Air可以采用调节屏幕和透镜的相对位置的方式，实现了0~500 度屈光度调节。这个有些意思，可以实物出货后看看如何具体实现的结构，如果双眼协调调整不好，可能会比较影响体验。 KickStarter链接 微软专利用于MEMS激光扫描显示的宽谱激光二极管评论：微软最新的专利介绍了一些宽光谱激光二极管的方法，这些宽光谱激光器可以用在MEMS的AR设备中。具体的专利链接放在下面，主要这里评论一下为什么要去展宽光谱。首先，2代的Hololens使用了MEMS激光扫描的显示方式，这种方式对比起LCD或者LCOS的显示方式来说，可以实现更小的光机大小，更亮，更低功耗，更高对比度等。但是，当使用光波导时，激光作为光源有一些问题，但是使用MEMS就需要准直性比较好的激光光源。激光光谱宽度很窄，这种窄光谱宽度结合使用waveguide型的AR会造成一些问题。第一，当波导内的optical path length和激光的相干OPL相同时，会产生干涉条纹，然后在显示图像中产生一些图样，造成图像质量下降。第二，会产生颜色不均匀，这是表面浮雕式光栅波导（SRG）的特性导致的，入射光只能以一个小角度范围耦入光波导，波长决定了耦入角度。SRG的耦入效率是角度决定的，耦出光线在FOV范围内效率不同，造成了强度调制的效果。从另一个角度说，由于耦入角度范围被限制的很小，所以，每个角度耦入的光线在耦出时，没有达到完全的空间覆盖，造成了图像质量下降。这部分具体的描述可以去看看Kogelnik efficiency plot in the angular/spectral space。 所以，微软提出了一些方法，来展宽激光器的光谱，主要是如何使用多个不同波长激光发射器排列，主要要制造在一个衬底上。 专利链接 eMagin与美国防部签署3360万美元硅基OLED订单评论：eMargin是美国领先的OLED显示屏制造商，其显示屏主要用于军用和商用VR、AR设备中。该公司宣布其和美国国防部签署了一份3360万美元的OLED显示屏幕订单，用于维持和增强本土生产高分辨率，高亮度的OLED显示屏，包括该公司的direct patterning technology (dPd™)直接图案技术。这笔订单中的一大部分用于在eMagin的Hopewell工厂和New Yok总部安装新设备，用于提高该种创新技术OLED的良率。国防部选择eMagin说得过去，因为它是美国本土唯一的OLED微型显示屏制造生厂商。 eMargin一直在提升自己公司的OLED的亮度（见下图），现在已经可以量产750nit的显示屏，正在开发的显示屏亮度是28000nit。该公司的直接图案技术（dPd）不像常规Micro OLED需要采用白光+彩色滤光片的方式，而是直接采用红、绿、蓝三色光源，这是一大优势，可以提供更高的光效率，亮度，色彩。这也是室外应用型的AR头盔的一个重点需求，亮度。 新闻稿 斯坦福大学全息近眼显示图像质量优化评论：在AR和VR中，全息近眼显示技术使用相位型空间光调制器(spatial light modulator,SLM)对入射光波整形，目标图像通过干涉的方式间接形成，可以用于实现多个焦距的显示变换，提供focus cues。但是全息显示的相位型SLM存在衍射效率低的问题。这是由于其有限的像素填充因子、背板架构和其它因素，使得多达20%的入射光可能不会被衍射，从而产生零级衍射级，这通常会干扰控制的衍射级并显著降低观察到的图像质量。导致目前计算生成全息的图像质量还不如传统的显示技术。光学上，一般通过轴上和立轴滤波模型技术去最小化零级衍射。轴上滤波是通过在傅里叶平面阻挡住没有被衍射的光束，这可能会遮挡一部分衍射光线，降低了低频分量，同时这种方式在处理多色时也有挑战。轴外方法会降低FOV，因为只使用了1级的一半分量，或者会降低光效率，这两个参数对于近眼显示器都很重要。还有通过补偿光束或者SLM像素画结构补偿零级的方式。近期，也有通过camera-in-the-loop(citl)的技术，通过其他衍射分量，部分的补偿未衍射的光线。但是这些软件方法都依赖于实际SLM的物理限制，限制了可以利用相消干涉抵消零级衍射的程度。 斯坦福这个团队提出提出了使用两个SLM的方法，该团队称之为Michelson全息（Michelson holography, MH)，并结合CITL优化方法，使得一个SLM的衍射光可以与另一个SLM的非衍射光形成相消干涉，因此，非衍射光可以用于目标图像形成而不是产生散斑或者其它的伪影，从而大大提升图像质量。这种citl优化流程捕捉所有衍射和未衍射光线的相干叠加量，然后回传和目标图像比较，再迭代到SLM中。这种方法不需要特定的SLM像素结构或者未衍射的光线，只需要一个照相机去捕获中间段的图像，然后进行自动优化。以前的一些研究中，使用多个SLM进行角度增强，分辨率增强，或者复杂的调制，但是该方法是第一个用于优化图像质量的。下图展示了系统架构，以及图像质量的对比。 论文 天津大学新算法展示浑浊水体成像评论：透过浑浊的水体照一张照片是非常难的一件事情，近期，天津大学的研究者们使用一种新的算法，增强了水下成像的图像质量。传统方法需要知道水体情况，已经背景信息来进行成像，而新方法可以在不知道任何信息的情况下渲染图像。传统的成像方式需要保证散射光部分是偏振的，然后使用偏振相机去成像，这需要有背景信息，然后去估计反向散射的光线。新方法不需要这部分信息，而且可以在水体极度浑浊的情况下工作。通过数学计算，研究者们分析了使用偏振恢复图像的模型，重点研究了正交的两个偏振方向上反向散射光线的强度优化，展示了在数学上，只有一部分“物理上可行”的区域的光强信息可以让一些中间参数不参与计算。这样，他们就去除估计一些参数的需要，这些参数造成了以前的模型的不准确，以及需要成像区域的信息的需求。这种计算开放了可以加速优化和提升优化效果的可能性。最后实验团队展示了使用这种方法得到的结果。 论文 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"TOF系统 第二章 dTOF系统","slug":"TOF系统 第二章 dTOF系统","date":"2021-09-19T14:00:00.000Z","updated":"2021-12-04T11:32:05.726Z","comments":true,"path":"TOFSystem_C2/","link":"","permalink":"https://faster-than-light.net/TOFSystem_C2/","excerpt":"第一章中我们介绍了TOF的基本原理，应用，系统架构和分类。本章和下一章，我们会详细介绍dTOF和iTOF系统，从他们的系统原理，架构和零部件性能出发，分析重要的系统参数，进而理解这两种系统的不同以及其中部件的选择。阅读本章前，请阅读第一章。","text":"第一章中我们介绍了TOF的基本原理，应用，系统架构和分类。本章和下一章，我们会详细介绍dTOF和iTOF系统，从他们的系统原理，架构和零部件性能出发，分析重要的系统参数，进而理解这两种系统的不同以及其中部件的选择。阅读本章前，请阅读第一章。 dTOF基本原理和核心组件如第一章的介绍，dTOF的原理很直接，就是使用时间相关单光子计数法(TCSPC，Time correlated single photon counting)直接测量光飞行的时间。下图展示了一个更具体的dTOF系统图(引用)，以及AMS的一个TOF临近传感器模组1D Proximity Sensor TMF8801，我们可以看到发射端，接收端以及模组的pin脚。根据系统原理图和实际模组，我们来分析一下dTOF的基本原理，核心组件和系统参数。 激光驱动Laser Driver是发射端电路的主要部分，负责驱动Laser，控制电路发出数字脉冲信号，一般使用该信号控制MOSFET进行开关，控制激光发射。 激光器在dTOF中，激光器负责发射激光。采用激光的主要原因是激光光谱窄，能量强度高，调制速度快，而且易于集成。电子消费品的dTOF应用中，主要使用的是垂直腔表面发射激光 Vertical Cavity Surface Emitting Laser (VCSEL)。在一些其他平台或者应用中，尤其是车载激光雷达中，会更多的使用功率更高的EEL（Edge Emitting Laser）和光纤激光器。一般，电子消费品使用的dTOF会选择850nm或者940nm的激光。（根据第一章我们的说明，850nm和940nm处的太阳光谱都有水的吸收峰。940nm的环境光强更小，所以噪声小；但是传感器在850nm的量子效率（QE）是940nm处的两倍，接收信噪比更好。） 数字电路产生的脉冲方波输入给激光驱动，变成实际的光脉冲后，在时域上可以看到由完美方波，变成了不那么完美的方波（图示里是画的比较夸张，实际上，VCSEL的脉冲调制性能已经非常好了）。由于激光驱动的响应速度，这里在时域上产生了一个不确定性的参数，即为δ-laser(图中的δ-t) 发射端光学发射端一般为一个简单的光学镜头，把激光能量发射到需要的视场角内，有一些应用也会使用准直镜+DOE等元器件，把VCSEL发出的光线先准直，然后分成很多束光线指向不同的视场角方向。 接收端光学接收端光学零部件需要的主要是收集期望测量的视场角内的光线，这种镜头F数越小越好，相对照度越高越好，同时镜片上可以进行一定的镀膜增强透光性，同时接收端会使用尽量窄带的滤光片，去滤除其他波长的杂光干扰。 接收传感器SPADdTOF应用中主要使用的接收传感器为single-photon avalanche diode (SPAD)单光子雪崩二极管或Silicon photomultipliers(SiPM)硅光子光电倍增管，他们的主要区别是每一个SiPM像素里包含多个SPAD像素。不同于传统CMOS传感器，对于光的接收时积分形式的，既接收某一时间段内的光强，转换为电流；SPAD如其名字所描述的，可以对单一光子进行相应，只需要一个光子就能触发一次强的雪崩，产生电流信号。可以说，SPAD输出的就是有光1和没光0两种状态（见下图）。SPAD传感器芯片每次被光子激活后，电子淬灭电路降低二极管中的电压使其在短时间内低于阈值电压，因此雪崩停止，经过一段恢复时间，探测器可以探测其它的光子，这个恢复时间决定了传感器的识别速度。 SPAD的像素相对于传统CMOS图像传感器来说还无法做的很小，比如一款传统图像传感器，三星的GN1，50MP，1/1.31”大小，像素大小1.2um。而SPAD的像素大小很大，这是由于其需要各种电路对SPAD进行复位造成的。比如根据机构的分析，iPhone中使用的Lidar是Sony的SPAD传感器，只有30K的像素数，每个像素10um大小。所以SPAD的传感器限制了dTOF的空间分辨率。 信号被SPAD接收后，会再产生一个一个时间不确定性因素δ-tSPAD，这个是SPAD的响应速度决定的。 TDC电路Time-to-digital converter(TDC)，时间数字转换器，是将模拟信号转换成以时间表示的数字信号的电路，TDC输出了每一个脉冲与所设起始点相比被记录下来的时间。这些脉冲被记录下来后，转换成直方图，然后通过比较哪个时间的直方数量最大，确认目标物的位置。TDC电路的精度也会对时域信号产生影响，引入了一个不确定性δ-tTDC。通过TDC电路后的电路，都是数字电路。 系统参数探测距离一款dTOF可以探测多远的距离？根据系统的基本原理，理论上，只要发出去的光子到了目标物上，然后被反射回来，被接收端接收到，并且被最终的算法识别，认定为非噪声的信号即可。所以，理论上，只需要接收端在目标物上看到的该波长的信噪比足够即可。所以，针对于不同探测距离的应用场景，dTOF在发射端或者接收端也可能使用不同的技术方案。比如对于电子消费品，探测距离在5m内，使用VCSEL作为发射端，但是对于车载类应用，探测距离要达到100m甚至更远，VCSEL去照亮整个视场的功率远远不够，这就需要使用EEL或者光纤激光器扫描整个视场，既一个一个点的照亮视场的方式。 最大无歧义探测距离假设我们发射了两个脉冲，第一个脉冲发射的早，但是飞行的远，第二个脉冲发射的晚，但是飞行的近，这样，第二个脉冲回来的早，第一个脉冲回来的晚，识别的时候，我们就会弄混两个脉冲。那如何能尽量分辨两个脉冲呢？最简单的方法就是把两个脉冲的发射间距拉长。其中，不造成混叠的最大无歧义探测距离为c*脉冲间隔/2，也等于c/2f，f为激光的调制频率。假设我们的激光调制在1Mhz，那么最大无歧义探测距离就是150m。所以，探测5m范围的dTOF可以使用更高的调制频率，就是因为探测距离足够小，并不会有脉冲间隔产生的距离歧义问题。 探测距离的精度和误差精度 假设一个脉冲的宽度为Δt，一个激光器把它发射出去后，接收端收到了反射回来的光子，但是接收端无法知道这个光子是来自于脉冲刚刚开始的第一个光子，还是脉冲结束时的最后一个光子，所以即使没有任何噪声或者不确定性的情况下，dTOF的距离探测精度，本质上是受限于脉冲宽度的，距离探测精度ΔR = c*Δt/2。假设每个脉冲宽度为1ns，那么ΔR = 0.15m。VCSEL作为一种半导体激光器，响应速度很快，可以达到ps级，假设脉冲宽度达到0.1ns，那么，ΔR 就可以达到0.015m，既15mm的探测距离精度。通过这个公式，我们可以看到，dTOF的探测距离精度，并不随距离的增加有所下降，这是dTOF一个很大的优势，也是dTOF类型的系统会使用在长距离场景探测的主要原因（车用激光雷达）。 误差 探测距离d = cΔT/2，根据前面一部分的分析我们看到，在发射端到接收端的各种零部件上，在脉冲的时域上产生了很多的不确定参数，其中由数字电路产生的ΔT，经过激光驱动产生的激光脉冲产生了时间不确定参数 δlaser；被SPAD探测到后，SPAD的响应产生了 δSPAD；TDC电路的响应，产生了 δTDC。由此，总计的探测时间不确定RMS如下公式所示，其中δother是系统中的其他统计上独立的不确定参数，可能包括其他电路部分的响应，pixel之间互相的影响等，但是整体上这部分是相对比较小的。那么，测量误差为c*δtotal 降低误差可以使用在发射端放置一个Reference SPAD，接收刚刚发射出去的VCSEL的光线，用以确认发射的时间，以及参考距离0米的位置。 噪声和抗干扰能力背景噪声 背景噪声是TOF需要面对的主要问题，当背景噪声能量大于发射信号能量时，接收端完全无法得到足够的信噪比去发现发射信号。室内和室外的阳光直射，反射能量在一个很大的区间。所以一个dTOF在最初设计阶段，要确认在什么应用场景下，多大的距离范围内有效。一般的电子消费品类的TOF都是定位主要面对室内场景。（见图1左上角） 强光环境下，SPAD很容易就被背景噪声激活过曝，如果我们要在上面增加衰减镀膜，那当我们进入室内，我们自己VCSEL发出的能量也被衰减到没有任何光子进入SPAD了。解决方法之一就是使用多个SPAD像素，比如100个SPAD像素，其中10个像素10%的衰减，10个像素20%的衰减，以此类推。这样，他们就包含了一个可以测量的背景噪声范围，同时增加了像素数量，可以对比各个像素之间的结果用以比对。 前面我们分析了dTOF的探测精度和激光发射脉冲宽度是直接相关的，但是这里我们发现其信噪比和每次发射的能量又是直接相关的。短的脉冲每次发射的能量也会小。所以dTOF希望发射尽量短的高能量的脉冲。但是请注意电子消费品的激光能量要收到IEC60825标准的限制，所以非常高的能量也是不可取的。 串扰Cross-talk 串扰可能产生于相邻SPAD像素之间，解决方案就是对这些像素进行隔离，这样就降低了传感器的filling factor。 串扰可能是发射端的光线在模组内部直接反射进了接收端，解决这种串扰的方法是隔绝开发射端和接收端。 串扰可能是发射端的光线在手机的前玻璃面板中发生了反射，进入了接收端，解决这种串扰的方式是算法以及在发射端放置一颗SPAD芯片作为参考信号或者进行后期的标定和校准。 多路径干扰 dTOF抗多路径干扰的能力很强，通过统计直方图和合适的算法，很容易分辨哪些光子是多路反射回来的，哪些是目标物反射回来的。这是dTOF对比iTOF的一大优势。 空间图像分辨率SPAD传感器的传统工艺是前照式FSI(Front Side Illumination)工艺，如下图左所示，用于吸收光子的厚度非常有限，限制了光子的吸收率，同时SPAD的淬火电路（Quenching circuit）部分占据了很大一部分芯片表面，限制了filling factor。Sony基于自己的CMOS技术开发了背照式的SPAD传感器，见下图中和右，大幅度提升了光子吸收率和filling factor以及吸收厚度。据分析，iPhone中的LiDAR使用的是Sony的0.1MP的SPAD传感器，Sony正在不断提升SPAD传感器的像素数量。当SPAD传感器可以达到和使用CMOS类型的iTOF传感器近似的像素数量时，dTOF会被更多手机厂所选择。 功耗由于dTOF发射的是脉冲，所以功耗上，相对iTOF需要发射连续波以及持续接收，功耗较低。 工艺分析整体控制电路 基于前面的分析，我们发现dTOF整体上需要一个高速电路，设计和制造高速电路也是一个难点。其中包括了高频调制的激光脉冲的发射，SPAD的相关电路，高速信号的分析等。 SPAD 对比起CMOS类型的芯片，可以提供SPAD的供应商很少，其中有AMS，ST，Sony等。SPAD本身需要较高的电压，这也对电路设计是一个挑战。比如dTOF由于工作脉冲很多，所以数据量非常大，这需要在SPAD芯片上直接实现信号处理。其中包括了可能要使用镜片堆叠工艺等实现，进一步增加了工艺难度。 整体来说dTOF的工艺难度和技术壁垒高，成本也高。 dTOF的标定标定dTOF可以使用不同光照条件下，放置在不同距离的不同反射率的标板进行标定。比如参考AMS的TMF8805 dTOF模组，其spec中汇报了以下几种场景的识别准确性，同时也可以用这些场景进行标定： 350 Lux Fluorescent Light and 18% Grey Card 350 Lux Fluorescent Light, 18% Grey Card and Smudge on Glass 1 k Lux Sunlight Represented by 170 Lux Halogen Light and 18% Grey Card 1 k Lux Sunlight Represented by 170 Lux Halogen Light and 90% White Card 5 k Lux Sunlight Represented by 830 Lux Halogen Light and 18% Grey Card 参考模组以下列出一些参考模组，供读者研究学习 ST系列临近传感器 AMS系列的临近传感器：TMD2620, TMD2635,TMD8701,TMD8801,TMD8805 灵明光子ADS3000 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"TOF系统","slug":"TOF系统","permalink":"https://faster-than-light.net/categories/TOF%E7%B3%BB%E7%BB%9F/"}],"tags":[{"name":"TOF","slug":"TOF","permalink":"https://faster-than-light.net/tags/TOF/"},{"name":"专题","slug":"专题","permalink":"https://faster-than-light.net/tags/%E4%B8%93%E9%A2%98/"}]},{"title":"光学新闻 20210918","slug":"OpticsNews20210918","date":"2021-09-18T08:00:00.000Z","updated":"2021-12-04T11:32:05.722Z","comments":true,"path":"OpticsNews20210918/","link":"","permalink":"https://faster-than-light.net/OpticsNews20210918/","excerpt":"本周五篇光学新闻： 小米发布智能眼镜探索版 — 珑璟光电推出二维扩瞳阵列光波导方案 — 3D处方镜片打印公司Luxexcel — 微凹陷界面结构帮助自动驾驶汽车识别路牌 — 拉曼系统用于追踪地雷","text":"本周五篇光学新闻： 小米发布智能眼镜探索版 — 珑璟光电推出二维扩瞳阵列光波导方案 — 3D处方镜片打印公司Luxexcel — 微凹陷界面结构帮助自动驾驶汽车识别路牌 — 拉曼系统用于追踪地雷 小米发布智能眼镜探索版评论：9月14日，小米官方发布了一支智能眼镜的概念视频。叫智能眼镜的主要原因是这次只有显示功能，并无AR功能。眼镜的显示使用的单色MicroLED+光波导形式，使用了一颗ARM的处理器，其他零部件包含触摸板，通信模块，电池等，运行的Android系统，整机重量51g。这次使用的0.13英寸的MicroLED来自于JBD，光波导来自于WaveOptics的一款off-the-shelf产品，看这个光栅耦合的位置，应该是Katana系列的一款光波导，这款光波导能提供21°x21°的视场角。 集成进这些功能，还保持这个重量，很难获得长久的续航，不过作为概念产品，也足够了。个人认为发布这款产品，第一市场营销上在行业占位，先让消费者开始对小米有这样的产品产生概念，而且近期正好Facebook也联合Rayban发布了智能眼镜，可以增强市场营销的效果。第二也是反映了小米的一些硬件思路，既使用各种off-the-shelf的东西，也可以做一款可能会价格合适的好产品。如果未来整个显示模组成本下降，只有显示功能的智能眼镜的应用场景也有很多，包括了国家正在大力支持的对于外卖员等的智能眼镜，也不需要一直常亮，可以设定一些激活条件，可以傻一点，好用就好。 新闻稿 珑璟光电推出二维扩瞳阵列光波导方案评论：第 23 届中国国际光电博览会（CIOE2021）将于2021年9月16-18日在深圳国际会展中心举办！作为一家集技术研发和专业化生产于一体的高科技光电技术公司，珑璟光电将携最新二维扩瞳阵列光波导技术的模组产品参与此次光电博览盛会。珑璟光电的二维扩瞳阵列光波导产品采用了右上角耦入形式，模组重量小于20g，FOV 50°，出瞳距离达20mm以上，眼动范围15x12mm， 畸变&lt;2%，透过率大于85%。 国内外主要有三家做这种阵列式光波导的，Lumus/灵犀微光/珑璟光电。最初的一维扩瞳方式，光机大小和FOV大小成正比关系，所以各家都开发了二维扩瞳的光波导，灵犀微光的产品是42°视场角，Lumus的是50°。阵列式光波导可以在整个FOV提供很好的color uniformity，不过面向超大规模生产还有很多问题需要解决。 新闻稿 3D处方镜片打印公司Luxexcel评论：3D处方镜片打印公司Luxexcel是一家荷兰公司，近期该公司宣布和瑞士镜片分销商Optiswiss 公司合作，以更好地打入AR和智能眼镜领域。两家公司说该合作使用Luxexcel的新款“VisionPlatform 7” 3D镜片打印技术，以及Optiswiss的市场资源，可以让瑞士制造的处方镜片成为智能眼镜设备的理想镜片。 Luxexcel公司的处方镜片3D打印技术是使用该公司开发的3D打印胶水，然后滴落在特定的位置上，一层一层形成镜片。还没有具体研究，不过看起来应该是类似UV Casting的一个过程，不同于传统的UV Casting要使用模具，该种方式不需要模具就可以形成。该种材料的耐高温性能也很好，所以可以进行镀膜。今年早些时候，Luxexcel宣布和WaveOptics合作，提供直接包裹住光波导的处方镜片方案。不过现在不了解的是这个生产速度有多快，而且如果是面向未来的大规模生产，使用传统的UV Casting和模具可能更快，但是该种模式的好处是，可以配合不同的镜框生产不同的外形的镜片，如果未来的光波导是模块化的，一个消费者就可以走进眼镜店，挑选自己需要的光波导，自己需要的镜框，然后像现在配镜一样，打造一款适合自己的AR眼镜或者智能眼镜。 新闻稿 微凹陷界面结构帮助自动驾驶汽车识别路牌评论：Buffalo大学的研究人员使用微凹陷界面结构材料（一种薄膜材料，上面覆盖着一层球形聚合物）来帮助自动驾驶系统识别路牌。这种结构可以形成回射器，白光打在这种材料上会反射回彩虹环形条纹，而单色光（如激光）回射回来，可以产生明暗环形条纹。把这种薄膜贴在交通路牌上，比如STOP Sign上，可以让自动驾驶的车载系统更好的识别，无论是可见光相机还是激光雷达系统，因为这种结构的回射光线包含了更多的特征信息，可以用来进行识别。 新闻稿 拉曼系统用于追踪地雷评论：战争过后未爆炸的地雷是对平民的一种特别严重的潜在伤害，所以对于地雷识别和排雷的技术一直有很高的需求。这次新的研究使用无人机以及拉曼传感器系统，可以在空中就是别地下是否有地雷，排除了需要人工识别的需求。研究是由Robert Gordon University (RGU)大学的Shruti Karnik等人进行的，他说对于地雷的识别，需要高度的准确性，识别在土里的地雷收到不同因素的影响，包括地雷的种类，爆炸物的成分，埋入的方式，地表情况，植被情况，水体情况等。他们的拉曼光谱设备使用不同的技术来增强系统敏感性，包括表面增强拉曼散射技术，和空间偏移拉曼光谱技术等。该团队现在主要进行TNT型的地雷识别，现在针对不同的场景和环境进行研究。 新闻稿 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"光学新闻 20210911","slug":"OpticsNews20210911","date":"2021-09-11T08:30:00.000Z","updated":"2021-12-04T11:32:05.722Z","comments":true,"path":"OpticsNews20210911/","link":"","permalink":"https://faster-than-light.net/OpticsNews20210911/","excerpt":"本周五篇光学新闻： Sony基于事件的图像传感器 — Sony堆叠式SPAD深度传感器 — Vivo首颗自研专业影像芯片 — 光粒发布AR全息智能泳镜Holoswim — OQmented单芯片MEMS激光束扫描解决方案","text":"本周五篇光学新闻： Sony基于事件的图像传感器 — Sony堆叠式SPAD深度传感器 — Vivo首颗自研专业影像芯片 — 光粒发布AR全息智能泳镜Holoswim — OQmented单芯片MEMS激光束扫描解决方案 Sony联合Prophesee开发两款基于事件的图像传感器评论：Sony发布了两款堆叠式，基于事件的图像传感器，这一系列传感器是和西班牙初创公司Prophesee合作开发的。一款为IMX636 1/2.5” 0.92MP，一款为IMX637 1/4.5” 0.33MP。基于事件的图像传感器通过异步检测每个像素的光强变化，只输出变化的数据，结合像素点的位置信息，可以实现高速低延迟的数据输出。下图展示了普通基于帧的图像传感器和基于事件的图像传感器的区别，基于帧的图像传感器需要输出每一帧的所有像素内容，而基于事件的图像传感器只输出变化的像素点的信息，包括位置，时间等，大大降低了输出数据的量。由此基于事件的传感器可以实现高速，高时域分辨率的传感。该种传感器有着非常多的应用场景，包括低光照条件下的运动检测（夜晚道路监控，没有人或者车的时候，并没有大量信息输出，当场景出现运动物体时，才有输出），工业设备监控（机床监控，只输出运动部分的信息），对于电子消费品，VR头盔的SLAM，手柄追踪，眼球追踪可能未来也可以使用这种传感器，不过现阶段该种传感器像素比较低，可能手柄和眼球追踪可以先实现。 新闻稿 Sony发布业界首款面向汽车dToF激光雷达应用的堆叠式SPAD深度传感器评论：Sony发布了IMX459，首款面向激光雷达应用的SPAD深度传感器，该款传感器由10um大小的像素点，1/2.9”大小，0.1MP，使用背照式，堆叠式，索尼的Cu-Cu连接技术，在905nm处可以获得24%的光子检测效率，可以实现在短距离到长距离15cm的深度传感分辨率。该款传感器通过了AEC-Q100 Grade 2自动驾驶电子零部件的信赖性测试。基于该款芯片，索尼还开发了一个机械旋转式的激光雷达参考设计。 新闻稿 Vivo发布首颗自研专业影像芯片评论：Vivo本周发布了vivo X70系列，这次最值得关注的点就是Vivo首次使用了自己的自研专业影响芯片V1。其中X70 Pro+，主摄使用了三星的5000万GN1传感器，1G+6P镜片；超广角使用了Sony的4800万像素的IMX598；人像镜头使用了Sony的IMX663。这次的V1芯片是由vivo与手机SoC厂商深度合作（行业消息称是与联咏合作设计，台积电投产），历时24个月、投入超300人研发而来。通过影像芯片V1与主芯片协作，可以实现高算力、低时延、低功耗的特性。看了一些评测视频，V1芯片对于夜景的拍摄，实时预览，录像防抖等都有很大提升。一般芯片开发周期是两年左右，一旦一家公司的自研芯片路线开始，就会一直走下去，所以我们明年应该可以看到V2芯片。对于国内手机影像方案，自研芯片是差异化竞争及走上高端手机产品线的必经之路。 发布会视频 光粒发布AR全息智能泳镜Holoswim评论：AR智能眼镜公司杭州光粒科技发布了新品——Holoswim™全息智能泳镜。该款产品已经登陆Kickstarter开启众筹，众筹价格为99美元。相同产品有加拿大公司Form AR的产品，不过售价要199美元，这次光粒的价格99美元可能在欧美市场会比较受欢迎。泳镜AR还有一些运动类护目镜AR一直是一个小众赛道，比如自行车，滑雪等。在这些产品里实现AR并不困难，如何让消费者买单是重要的课题。如果可以结合类似GoPro的视频录制功能，可能会更有销路。下面两张图里，上面是光粒科技的产品Holoswim，下面是Form公司的产品。 Kickstarter链接 OQmented推出业界首款基于单芯片MEMS微镜的激光束扫描（LBS）解决方案评论：MEMS微镜技术初创公司OQmented，近日宣布推出业界首款基于单芯片MEMS微镜的激光束扫描（LBS）解决方案。OQmented这款高速LBS解决方案采用晶圆级微型化真空封装，使用了OQmented的Bubble MEMS技术。这种封装形式将MEMS封装在一个真空的半球形盖子中，可以很好滴保证大角度的FOV的扫描（平面封装盖板会造成光损失或者造成整体模组变大，而不用盖板封装可能会造成一些信赖性问题。OQmented成立于2018年，其解决方案的始于德国弗劳恩霍夫研究所。这次的解决方案采用了专有的李萨如扫描（Lissajous scanning）技术，并专门针对AR/VR应用进行了优化。该公司是LaSAR Alliance (Laser Scanning for Augmented Reality)，AR激光扫描联盟的一员，该联盟致力于进行AR相关的制造合作，包括多家企业，其中有：ST，OSRAM，Dispelix，Applied Material等。 新闻稿 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"光学新闻 20210904","slug":"OpticsNews20210904","date":"2021-09-04T09:00:00.000Z","updated":"2021-12-04T11:32:05.722Z","comments":true,"path":"OpticsNews20210904/","link":"","permalink":"https://faster-than-light.net/OpticsNews20210904/","excerpt":"本周五篇光学新闻： 三星发布两款新成像芯片 — Indie收购光子学厂商TeraXion — 纵慧芯光完成数亿元C3轮融资 — Lynred集成ISP到红外相机 — Toptica的引导星激光系统通过了现场测试","text":"本周五篇光学新闻： 三星发布两款新成像芯片 — Indie收购光子学厂商TeraXion — 纵慧芯光完成数亿元C3轮融资 — Lynred集成ISP到红外相机 — Toptica的引导星激光系统通过了现场测试 三星发布两款新图像传感器评论：三星发布了ISOCELL GN5，世界上第一款使用全方位对焦Dual Pixel Pro技术的图像传感器。该芯片为50MP，1um像素点，每个像素由两个感光元件组成。整个芯片上有1百万个相位对焦感光元件，可以在亮光及暗光环境下实现快速的对焦。该芯片还是用了三星的专利技术前向深沟渠隔离技术，用以分隔两个感光元件，以降低两个感光元件之间的串扰。 三星还发布了ISOCELL HP1，业界第一款2亿像素分辨率，0.64um的图像传感器。对于低光照场景，ISOCELL HP1使用了创新的ChemeleonCell技术，使用2x2或者4x4进行像素合并来提高弱光照成像效果。在弱光环境下，该传感器合并16个像素点，提供12.5MP像素的分辨率，强光照环境下，可以完整输出2亿像素。HP1可以实现8K视频的30fps录制， Indie收购光子学厂商TeraXion评论：TeraXion是加拿大的光子学零部件开发商，Indie Semiconductor是美国硅谷生产车用传感器的公司。这次两个公司的合并，Indie将支付1.59亿美元给TeraXion，Indie前一段的上市融资3.5亿美元使其可以拿出这笔资金。这次交易可以进一步巩固Indie公司的计划，既成为一个自动驾驶系统传感器的顶尖方案提供商。TeraXion主要销售红外激光器，可以用于FMCW Lidar，这是对于indie面向高级驾驶辅助系统（ADAS）/自动驾驶激光雷达（LiDAR）解决方案的有力补充。可以看到，今年和激光雷达相关的企业们，都在进行收购，合并，合作以在这个激烈竞争的行业中站稳脚跟。 新闻稿 纵慧芯光完成数亿元C3轮融资评论：近日，国产VCSEL供应商头部企业常州纵慧芯光半导体科技有限公司（以下简称“纵慧芯光”）获数亿元C3轮融资，武岳峰资本领投，比亚迪、CPE源峰、高榕资本、一村资本等跟投。高榕资本曾于2018年投资纵慧芯光B轮融资，并持续参与后续多轮融资。此次融资将加速产品技术的完善升级和布局汽车电子方向。纵慧芯光（Vertilite）成立于2015年，是一家创新型的光电半导体企业，致力于为全球客户提供高功率以及高频率VCSEL（垂直腔面发射激光器）解决方案，主要研发和生产VCSEL芯片、器件及模组等产品。目前纵慧芯光已在常州建设外延产线和封测产线，其中外延产线产能达到每月1000片6寸外延片，明年将达到每月1500片6寸外延片。纵慧芯光从成立之初便着手全球化运营布局，总部位于江苏常州，在美国、韩国、中国台湾地区、上海都设立了办公地点。公司拥有出色的人才储备，团队中20%的成员拥有博士学位，在VCSEL技术领域拥有丰富的学术界和产业界经验。截至目前，纵慧芯光的合作伙伴超过200家，包含国内外知名消费电子公司和各大汽车电子厂商。在消费电子领域，纵慧芯光的产品凭借领先的性能和卓越的可靠性，广泛应用在华为、荣耀、夏普、魅族等手机品牌之上。荣耀新近发布的旗舰机型Magic3，其Face ID VCSEL芯片由纵慧芯光独家供应。今年，纵慧芯光正开拓更多消费电子应用场景，其中扫地机器人业务、智能门锁业务均实现了产品批量交付；接近感应器系列产品也已实现每月百万量级的芯片交付。随着智能驾驶时代的到来，VCSEL芯片作为3D成像和传感系统核心器件，正在从消费级向车规级推进。近期纵慧芯光在汽车电子领域也取得突破。VCSEL在LiDAR（激光雷达）行业被称为下一代激光器解决方案，目前纵慧芯光正与国内外多家一线LiDAR厂商积极合作开发下一代混合固态和固态LiDAR方案。纵慧芯光在2020年已有VCSEL产品通过第三方AEC-Q认证，2021年初公司通过IATF16949认证，为其VCSEL产品在汽车电子领域大规模应用做好了准备，预计将于2021年底在汽车电子领域实现前装量产。在VCSEL传统应用的光通信领域，纵慧芯光已开始送样测试，预计将在2022年开始正式导入量产。 国内市场，电子消费品领域对于VCSEL一直没有很大规模的应用，反而是车用激光雷达领域的需求增多，而且用于激光雷达的激光器价格可以更高，这可能也是该公司进行这些准备的主要原因。 新闻稿 Lynred集成ISP到红外相机评论：Lynred是一家提供红外传感解决方案的法国公司，这次该公司发布了自己的ATI320型号的红外传感器，配合该传感器发布的还有可以选配的镜头。该款16mmx16mm，QVGA的传感器的特别之处是集成了ISP，可以做到即插即用的效果，极大地简化了购买者使用和基于该相机开发应用时的复杂度。 参数 Toptica的引导星激光系统通过了现场测试评论：Toptica Photonics, 一家慕尼黑的激光器和系统开发公司，宣布其用于欧洲航天局自适应光学系统引导星CaNaPy激光系统通过了现场测试，该系统应用于西班牙的光学地面站。用于天文观测的激光引导星系统主要工作原理是将激光发射至大气层，然后通过观测该激光反射信号（地面上看过去就是一个亮点，所以被称为引导星）以确认大气湍流情况，以辅助自适应光学系统进行观测。激光能量需要的很高，使用了频率啁啾系统， 新闻稿 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"光学新闻 20210829","slug":"OpticsNews20210829","date":"2021-08-29T07:00:00.000Z","updated":"2021-12-04T11:32:05.722Z","comments":true,"path":"OpticsNews20210829/","link":"","permalink":"https://faster-than-light.net/OpticsNews20210829/","excerpt":"本周五篇光学新闻： Ouster就收购竞争对手Sense Photonics展开会谈 — Mojo Vision可嵌入隐形眼镜的微显示器原型Mojo Lens — 血液光谱仪展现了Covid-19分诊能力 — 相干TOF实现250um的深度分辨率 — dTOF实现26um深度分辨率","text":"本周五篇光学新闻： Ouster就收购竞争对手Sense Photonics展开会谈 — Mojo Vision可嵌入隐形眼镜的微显示器原型Mojo Lens — 血液光谱仪展现了Covid-19分诊能力 — 相干TOF实现250um的深度分辨率 — dTOF实现26um深度分辨率 Ouster就收购竞争对手Sense Photonics展开会谈评论：激光雷达公司Ouster，在今年初上市后，开始了一些收购和并购行动，现阶段正在和竞争对手Sense Photonics进行谈判，讨论收购事宜，具体的收购价格未知，Ouster的发言人也拒绝评论，Sense Photonics的代表也没有回复问询。作为一家总部在旧金山的激光雷达公司，该公司开发的激光雷达可以提供每秒一千万点数量的点云，其他激光雷达一般每秒可以提供200万点的点云，更多的数据点可以让激光雷达不单追踪车道上的汽车，也帮助其追踪对于自动驾驶极其重要的外部的环境。Sense Photonics声称其公司技术由300份专利保护，同时公司的资金由多家风投公司支持，其中包括Acadia Woods, Congruent Ventures, Prelude Ventures, Samsung Ventures, Shell Ventures, Hemi Ventures，IPD Capital。Ouster和Sense Photonics的激光雷达技术非常类似，合并确实有助于减少竞争，强强联合，因为在激光雷达赛道，还有非常多的其他竞争对手如Velodyne等，在Flash Lidar赛道如果两家公司一直进行竞争有可能最终丧失更大的机会。下图（链接）展示了Sense Photonics宣传中对于激光雷达的分类，其中第一代是机械旋转式，第二代是使用MEMS的半固态激光雷达，第三代是使用光学相控阵方式的固态激光雷达，第四代是Sense Photonics（以及Ouster）开发的Global Shutter Flash型激光雷达 新闻稿 Mojo Vision可嵌入隐形眼镜的微显示器原型Mojo Lens评论：Mojo Vision是一家致力于开发隐形眼镜形态的微型显示器的公司，该公司迄今为止获得了New Enterprise Associates、Liberty Global Ventures和Khosla Ventures等风投机构提供1.59亿美元融资。近期该公司发布了一些信息，展示了最新的进展。下图展示了Mojo Lens的结构，其中包括了环形的电路结构，其中直接包含了一个CMOS传感器，无线模块，电源权利模块，位移传感器等，中间的是关键的六边形显示模块，大小有0.5mm左右，每个像素点只有红细胞的四分之一大，最后设备使用“飞秒投影仪”，一个小型的放大系统，把影像投射到视网膜上。同时该设备还依赖一系列外部模块去控制这个隐形眼镜大小的模块。 Mojo Vision没有透露何时发货，也没有任何实际演示或实机视频。团队正在和日本隐形眼镜厂商Menicon合作进行开发。不过该技术的商用道路还有一段距离，不过可能可以先给弱视等视觉障碍人群提供一些可能性。 新闻稿 血液光谱仪展现了Covid-19分诊能力评论：印度和澳大利亚的研究者们的实验展示了使用红外光谱仪进行血液检测，可以作为一种简单快速地分诊手段，使诊所和医院更容易区分哪些Covid-19的感染者要可能有着更重的症状，需要更多的医疗关注。这个小规模实验使用的是安捷伦公司的傅里叶变换式红外光谱仪FTIR，研究者们通过光谱仪区分轻症和重症患者血液样本的轻微光谱差异。这次实验使用了130个样本去训练算法，然后测试了30个样本。当结合其他参数如年龄或者其他基础疾病和高血压时，这种方法可以确定大部分可能会成为重症的患者。不过FTIR的分诊方法也产生了很多“假阳性”的结果，算法认为这些患者可能会进入重症，但是实际上并没有。研究者们认为测试结果的精准度可以进一步提升，帮助医院来优先处理可能的未来重症患者。 新闻稿 相干iTOF实现250um的深度分辨率评论：加州理工大学的研究者们发表了一篇名为“IQ Photonic Receiver for Coherent Imaging with a Scalable Aperture，正交/同相光子接收器用于可变光圈相干成像”的论文。其中描述了商用iTOF使用光强检测的CCD或者CMOS，这种测量相位计算深度的方式由于噪声等问题有着受限的深度分辨率。使用硅光子（Silicon Photonics, SiP）集成相干图像传感器可以提供更高的灵敏度以及深度分辨率，前一代的SiP传感器受到接收信号和参考信号之间光学相位波动的影响，最终会造成输出信号的结果中有着一些随机想为何强度波动。这限制了系统的SNR和信号获取时间。在本篇论文中，研究者们提出了一种创新的相干传感器系统，使用正交/同相光子接收器，可以抑制光学载波信号并移除参考光路中的非理想因素。同时团队提出了这种传感器系统的行列读出系统和寻址系统的设计方案，可以在N*N的传感器阵列上只使用2N的连接。研究者们使用8 x 8的芯片阵列进行了概念验证，实现了1m距离上250um的深度分辨率。可以看到在学术界，对于深度传感的研究还在向着更高的精度进行，这些技术可能会在未来逐渐商用化。 论文 dTOF实现26um的深度测量准确度评论：科罗拉多大学波德分校的研究者们发表了一篇名为“Time-magnified photon counting with 550-fs resolution，550飞秒分辨率的时间放大光子计数”的论文，展示了进一步提升dTOF（直接飞行时间）深度识别技术深度分辨率的可能性。dTOF深度识别使用的技术被称为时间相关单光子计数法(TCSPC，Time correlated single photon counting)，但是这种方法的单光子时间分辨率被限制在3-100皮秒（转换成距离就是0.9mm-30mm的深度分辨率，这个限制来自于单光子探测器SPAD的极限）。在这篇论文中，研究者提出了一种被称为时间放大时间相关单光子计数法(TM-TCSPC，Time magnified-Time correlated single photon counting)的方法，实现了使用商用单光子探测器实现了单光子时间分辨率550飞秒，这种技术可以对一个130飞秒的脉冲实现22飞秒的准确度，当使用在TOF 3D成像中，该方法可以极大地提升系统准确度（提升99.2%），实现26um的准确度和3um的精密度。具体实现方式读下来应该是可以说让“光多跑一会儿，给传感器留出些时间”，使用的关键元件是量子时域放大器，结合一个基于四波混合布拉格散射的低噪声高效率的光线参数时间透镜，把时域放大130倍。相当于让传感器以更慢的频率接收到信号。参考上一篇文章，可以看到dTOF的研究也在快速的发展。随着集成光子学的发展，我们可能很快就可以看到使用类似方法的小型化设备。不过电子消费品领域暂时还没有对如此高的精度有需求。 论文 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"TOF系统 第一章 系统综述","slug":"TOF系统 第一章 系统综述","date":"2021-08-26T15:45:00.000Z","updated":"2021-12-04T11:32:05.725Z","comments":true,"path":"TOFSystem_C1/","link":"","permalink":"https://faster-than-light.net/TOFSystem_C1/","excerpt":"新开一个专题用于介绍近几年非常流行的TOF系统，这个系列目的是给读者提供一些由浅入深了解TOF系统的文章。内容会包括TOF系统综述；iTOF和dTOF的具体介绍，系统参数，优劣势，算法等；TOF系统中的各个零部件的介绍和特性，如VCSEL，发射和接收镜头，接收端传感器CIS/APD/SPAD/SiPM，驱动电路ASIC等。","text":"新开一个专题用于介绍近几年非常流行的TOF系统，这个系列目的是给读者提供一些由浅入深了解TOF系统的文章。内容会包括TOF系统综述；iTOF和dTOF的具体介绍，系统参数，优劣势，算法等；TOF系统中的各个零部件的介绍和特性，如VCSEL，发射和接收镜头，接收端传感器CIS/APD/SPAD/SiPM，驱动电路ASIC等。 TOF简介基本原理TOF，Time of flight的简写，直译为飞行时间，大部分应用场景是指光学TOF，是测量光在介质中飞行一定距离耗费的时间来进行距离测量的方法。基本原理可以说非常简单，如下图所示，一个光源，发射一束光，记录发射时的时间点，光照射在目标上反射回来，被接收器接收到，记录接收到反射光的时间点，两者的时间差为t，距离d = 光速c * t /2。 TOF应用TOF应用场景非常多，电子消费品领域有人脸识别，照相机辅助对焦，临近传感器，体感互动，手势识别，AR等，扫地机器人避障，无人机避障，3D场景扫描等等；工业和安防领域可以用于自动机器人，人数统计，智能停车场，智能交通，智能仓储，提及测量等；智能驾驶领域的激光雷达LIDAR也属于TOF的范畴（不过我们不在该系列文章中具体讨论）。 TOF系统架构为了实现基本原理描述的距离测量，一个典型的TOF系统由以下几个部分组成： 发射端Tx：包括激光光源，主要是VCSEL；驱动激光的驱动电路ASIC；控制光束的光学零部件，可能是准直镜头或者衍射光学元件等，滤光片。 接收端Rx：接收端包括接收端的镜头，滤光片；传感器，根据不同的TOF系统，可能是CIS、SPAD、SiPM等；专门的图像处理芯片ISP用以处理海量的接收端芯片信息； 电源管理：VCSEL需要稳定的电流控制，SPAD需要高电压等，都需要较好的电源管理。 软件层：包括固件，SDK，OS和应用层等。 可以看到激光光束从VCSEL产生，通过光学元件后射向空间中，有一些光线被目标物反射并由接收端接收到，通过计算这中间的时间，可以获得距离或深度信息。该系统架构里并没有覆盖噪声光路，比如阳光产生的噪声，或者多次反射后返回接收端的光线造成的多径噪声，我们会在后面的内容里具体讨论噪声的课题。 TOF实际模组 根据使用场景和应用不同，TOF系统和模组的大小可能有很大差异，但是系统架构都基本统一，如下图所示，左边是AMS的TMF8805的TOF临近传感器，大小是2.2mm x 3.6mm x 1.0mm，可以看到发射端的类似矩形的孔和接收端的镜头；右边是Leica和PMD出品的TOF参考设计“Holkin”，大小类似于一个手机照相机镜头模组，可以看到发射端是采用了VCSEL+diffuser的形式，接收端是一颗镜头。 下图展示的是微软的Azure Kinect深度相机，可以看到发射端和接收端，发射端为了美观在产品最外侧使用红外透过可见光截止镀膜的保护盖板挡住。 TOF系统分类本节介绍TOF的各种系统以及实现原理，TOF系统常见的分类方式是从获取距离的具体方法进行分类，主要分成dTOF（直接TOF）和iTOF（非直接TOF）。这两种方法在硬件和算法上有很大区别。我们在系统分类这里先简单介绍系统的不同原理，在后面再具体讨论系统优劣势的比较和挑战。讨论dTOF和iTOF的区别前，我们先看看TOF系统主要面临的问题，两种系统的相同点，然后我们可以看到这两种系统是如何通过不同的方法解决这些问题的，进而就可以理解两种系统的区别。 虽然TOF的原理听上去很简单，发出一个光脉冲，然后检测什么时候返回了一个光脉冲，通过计算这个中间经过的时间，就可以知道距离。但是传感器本身是一直在进行接收能量的，如何知道传感器在某个时间点t接收到的光就是发出去的光呢？ 发射足够亮的光（相对于噪声）以达到足够的信噪比，传感器接收到高于环境光的能量就可以知道这是发射出去的光。如果是电子消费品，用于生活环境中，自然环境光强范围十分大，波长范围也很广，同时一个电子消费品很难发射非常强的光强，一方面要考虑激光安全，要根据IEC60825的要求限制激光的能量，另一方面也要考虑耗电的问题。所以选择合适的波长发射光十分重要。 找一个应用场景中不存在的波长或者能量最低的波长，这样就可以在这个波长发射相对弱一些的光脉冲，然后传感器前面放置窄带滤波片，这样，传感器只能收到这个波长的光。 对发射的光进行编码，让其有可以识别的特征，比如发射光亮暗亮暗亮暗，接收端接收到这个形式的光的时候，就知道这是发射出去的光了，这就像黑夜中的SOS手电筒闪烁。 太阳光的光谱如下图所示，黄色为大气层上方的太阳光谱，红色为经过大气吸收后的太阳光谱，在近红外区，可以看到有氧气和水蒸气的吸收峰。这些吸收峰的波长位置理论上都可以作为TOF系统应用的波长。大部分TOF应用都会选择850nm和940nm，一方面这两个波长的发光源器件可以使用VCSEL实现，再长的波长可能需要EEL实现；另一方面，接收端传感器对850nm是最敏感的，可以提供最佳的信噪比，940nm的感光度会比850nm低，如果波长更长，传感器的制造更难，电子消费品中很少选择。 dTOFdirector time of flight，直接测量距离法，顾名思义，是直接测量光子飞行时间的方法。关键元器件是单光子雪崩二极管(Single Photon Avalanche Diode, SPAD) ，简单来说该种传感器具有探测单个光子的灵敏度，只要有一个光子击中SPAD，SPAD就会最终输出一个脉冲。SPAD输出这个脉冲后，可以很快复位，准备接收下一个光子。 可是即使在850nm和940nm，环境光也是存在的，这意味，只要SPAD开始计数，就可能不停的有光子会撞击SPAD并令其激活并输出脉冲，那如何分辨接收到的光子是发射端发出，被目标物反射回来的这个光子呢。首先要使用合适的窄带滤波+衰减，让大部分场景的环境光不能透过滤光片，以降低噪声，但是在850nm的衰减滤波是固定的，不可能满足在所有光照场景下，刚刚好环境光强度不会激发SPAD，然后发射光能量刚好有光子进入；而且依赖于滤光片和衰减，测量误差可能非常大。 dTOF使用的方法叫时间相关单光子计数法(TCSPC，Time correlated single photon counting)，名字听起来很复杂，实际上就是“数光子出现的时间”。具体见下图，假设我们使用发射端VCSEL快速发射100个激光脉冲，记录SPAD每次收到脉冲的时间Δt，我们就有了100个Δt，见左图；把这些不同Δt出现的次数画成直方图，其中某个时间段的Δt出现频率最高，就是最可能的物体位置造成的Δt，而其他的Δt出现的地方可能是SPAD自己的噪声，环境光噪声，光线多径反射后返回传感器的噪声等。在实际应用中，VCSEL可以达到非常高的调制脉冲速度，VCSEL的每个脉冲宽度可以在ps到ns级别；SPAD也可以实现非常快的相应速度。举一个例子，实际模组中，可以实现用200ns发射100个1ns的脉冲，占空比50%；每1ms进行一次这样的发射，得到一个距离结果；每10ms求10次结果的平均反馈给操作系统使用；如此该TOF可以实现100次每秒的测距。 在传感器端，可以使用多个SPAD传感器去增加测量结果的准确性，每个传感器点可以镀膜去实现不同的衰减，用以降低环境光噪声。 iTOFindirect time of flight，非直接测量法TOF，主要方法是测量发射的正弦波/脉冲信号与接收的正弦波/脉冲信号之间的相位差的方法计算出时间，也叫phase-based TOF。在这种TOF系统中，光子的飞行时间t，是关于相位差的函数。因为是测量光强，所以iTOF的硬件可以使用普通的图像传感器架构，传感器输出的是接收到的光强和时间的函数，通过对比该函数和发射端的信号的函数，可以计算出飞行时间。需要注意的是，普通图像传感器的特点就是在一个固定时间收集光子，然后转化成电信号输出。 iTOF再细分，可以按发射光波的调制方式分成连续波调制和脉冲调制，常见的连续波调制使用正弦波信号，常见的脉冲波调制使用方波信号。请注意，如果对所有TOF在发射光波调制方式上进行分类，有些公司和研究机构把dTOF也称之为一种脉冲调制型TOF，不过笔者建议只在iTOF中讨论调制方式的分类。 使用连续波作为调制信号的被称为连续波调制（CW-iTOF） 使用脉冲作为调制信号的被称为脉冲调制（Pulsed-iTOF） 连续波调制(CW-iToF) 如下图所示，灰色正弦曲线是调制的发射的正弦波信号，黑色正弦曲线是接收到的信号（可以看到强度下降了），这两个信号中间有一个时间差，于是产生了一个相位偏移ϕ（0-2π），波长λ = c/ƒ，ƒ为调制频率，于是Δt = ϕ * λ，由此距离d就如图所示。 在接收端，需要做的事情就是确定相位偏移了多少，本质上是一种相位解调方法。对于iTOF，使用相同间隔的积分时间，让传感器每1/4个波长的发射时间内进行积分，接收光线，得到光强数据I1，I2，I3，I4，由此可以得到相位值： 由于相位值在0-2π范围内，所以只靠一次测量，iTOF系统是无法分辨接收到的信号是延迟了ϕ还是ϕ+2π，所以iTOF会用各种方法的测量去消除这种测量同义性，我们会在后面的章节具体讨论。 脉冲调制（Pulsed-iTOF） 脉冲调制是使用方波作为调制信号，在接收端进行信号读取，确认接收到的信号和发射信号的相位偏移。我们看一下iTOF是如何通过这种像素点计算出来相位偏移ϕ的。如下图所示，四个方波分别为发射信号，接收信号，一个传感器A以和发射信号同样频率的波形进行工作，和发射光光波同步进行光信号读取积分。一个传感器B以和发射信号同样频率的波形进行工作，但是在时域上有π的相位偏差，进行光信号读取积分。可以看到传感器A和传感器B在交替开关对接收信号进行积分，他们分别接收到了返回信号的一部分。输出的强度信号B/(A+B) * π既是发射信号和接收信号的相位差ϕ。 实际iTOF传感器是使用类似于照相用图像传感器进行光强的测量，但是成像型图像传感器在进行测量时，是有积分时间，读出时间，静止时间的，所以采样的中间是有间隔的，这无法满足iTOF原理的需求。所以用于iTOF的传感器会在传感器电路上进行一些改变，以一个像素可以实现连续采样的功能。普通的传感器一个像素点（Pixel）对应一个输出，而iTOF的传感器一个像素点对应两个输出（如下图所示），在一个pixel上面接两个开关，一半时间用电流到A端口，一半时间到B端口，这样A端口在进行光子接收时，B端口在这个时间片段内可以进行各种模拟电路的准备操作等，待A端口完成信号接收，断开电路后，B端口进行信号接收，A端口可以用这段时间进行信号输出等事项。这两个端口就可以对应前面的传感器A和传感器B。 再接近实际一些，这些传感器上使用的不是开关，而是电压去操纵像素点里的电流流动，这种被称为电流辅助光子解调像素点(current assisted photonic demodulator pixel)，简称CAPD，我们在后面的章节会进行更具体的说明。下图(链接)比较形象的展示了脉冲调制型iTOF的原理。 dTOF和iTOF比较dTOF和iTOF各有优劣，这需要更具体的了解系统参数，本章主要基本原理介绍，我们在后面的章节具体介绍iTOF和dTOF时再进行更具体分析介绍以及从系统参数的角度出发去比较不同种类TOF系统的优劣。 按信息获取维度分类如果从芯片可以获取信息的程度上，或者说输出信息的复杂性上进行分类，可以分成1DTOF，2DTOF，3DTOF。1DTOF最简单的形态就是一个单点测距的TOF系统，可以只有一个单像素点的芯片，只返回一个距离值。2DTOF最常见在扫地机器人上，可能是有一束激光来回扫描一个区域，然后传感器读取每个位置的距离值，扫地机器人只关心房间下层空间的距离，所以只面前需要一条线上的距离信息。3DTOF就是使用一个2维传感器阵列和成像镜头结合，每个像素对应的是某个视场的距离，这样，整个传感器可以输出一个3D信息。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"TOF系统","slug":"TOF系统","permalink":"https://faster-than-light.net/categories/TOF%E7%B3%BB%E7%BB%9F/"}],"tags":[{"name":"TOF","slug":"TOF","permalink":"https://faster-than-light.net/tags/TOF/"},{"name":"专题","slug":"专题","permalink":"https://faster-than-light.net/tags/%E4%B8%93%E9%A2%98/"}]},{"title":"光学新闻 20210821","slug":"OpticsNews20210821","date":"2021-08-21T10:00:00.000Z","updated":"2021-12-04T11:32:05.721Z","comments":true,"path":"OpticsNews20210821/","link":"","permalink":"https://faster-than-light.net/OpticsNews20210821/","excerpt":"本周五篇光学新闻： OPPO发布多项影像技术 — 美军演示一款用于无人机的激光武器 — 光粒科技全息树脂光波导 — 半导体关键零部件短缺可能造成Lumentum销售预期下降 — 可穿戴设备的超高性能柔性紫外光传感器","text":"本周五篇光学新闻： OPPO发布多项影像技术 — 美军演示一款用于无人机的激光武器 — 光粒科技全息树脂光波导 — 半导体关键零部件短缺可能造成Lumentum销售预期下降 — 可穿戴设备的超高性能柔性紫外光传感器 OPPO发布多项影像技术评论：智能手机品牌OPPO正式举办OPPO未来影像技术发布会，展示了OPPO在手机影像领域的多项技术成果。其中包括RGBW捕光传感器、连续光学变焦模组、五轴运动防抖技术和屏下摄像头解决方案。看了一下发布会，觉得不能算是黑科技，可以说是在oppo的产品策略里的技术选择和oppo是如何思考自己的影像方案及应用的，这个十分重要。比如oppo关注于年轻一代的选择，经常做的事情就是尽量便宜点儿。 RGBW补光传感器：这个W就是不加filter，类似于把华为以前双摄两个镜头RGB+黑白合并进一个镜头里。省钱+1 连续光学变焦：前一段索尼也出品了连续光学变焦，oppo也拿出来了这个方案，感觉这个技术可以拿出来讲讲，但是制造，成本，应用场景等并不明确。这也是很多公司不会去选择该方案的原因。 五轴运动防抖：芯片和镜头都可以动，这个五轴是传感器的位移，旋转加上镜头的旋转，摇摆，位移。然后就得到了一个超级大的模组，这种直接把主摄堆料到头的方案其实挺适合oppo的产品策略的，然后再配个简单长焦的组成个双摄，可以很好地控制成本。 屏下摄像头：oppo提出了硬件上创新的屏幕像素排列，软件上智能去衍射，智能去雾，智能HDR，智能AWB等。做好屏下摄像头主要需要特别精细的影像调教。 发布会视频 美军演示一款用于无人机的激光武器评论：看着真的挺像红警光棱坦克，这种武器被称为下一代的光基定向能武器（laser-based Directed Energy Weapons (DEWs)）。这次展示的这款武器由 ，陆军快速能力和关键技术办公室(Army Rapid Capabilities and Critical Technologies Office(RCCTO))联合空军和导弹防御部队组成的联合团队研发。主要用于对无武装的无人机目标。看这个上面的光棱坦克炮台一样的东西，感觉它可能甚至有多目标同时追踪和击毁的能力，同时如果注意观察这个装甲车侧面，都是散热风扇。 新闻稿 光粒科技全息树脂光波导评论：杭州光粒科技发布了全新的基于树脂基底的全息体光栅技术方案——“全息树脂光波导”，并导入了量产，该系列命名为Holoresin™。该种光波导是使用 树脂基底、树脂镀膜的光波导元件，不同于其他公司开发的玻璃基底的光波导。关于全息树脂光波导的优势，光粒科技创始人及CEO张卓鹏表示：“首先是光学的效能比较高，其次，表面浮雕光栅用的是晶圆玻璃基底，还要配合纳米压印技术，对材质和技术的要求都很高。而全息树脂光波导对材质的要求就没那么高，不管是涂层还是基底，都使用树脂。”，光学效能比较高这个评价是存疑的，因为表面浮雕光栅性能的重要影响参数就是波导的折射率，这也是采用玻璃的重要原因。光粒科技认为全息树脂光波导重量更轻，也更耐摔耐撞，这倒是没什么问题，但是光波导一共就这么大，用玻璃基底多出来的重量不多，而且通过合适的保护，也会比较耐摔耐撞。该公司的后续发展可以继续观察。 杭州光粒科技 半导体关键零部件短缺可能造成Lumentum销售预期下降评论：Lumentum最新一财年的财报显示这是该公司经营最好的一年，但是可能下一个财年的会受到关键零电子零部件短缺的影响。7月3日前的12个月，Lumentum营收17.4亿美元，净利润4亿美元，是历史最高纪录，但是其中有2.07亿美元是来自于Coherent的交给Lumentum的违约金。Lumentum原计划收购Coherent，并达成了协议，但是Coherent终止了收购，并决定接受II-VI的收购，所以Coherent根据协议，要支付Lumentum违约金。新的财年的第一季度显示客户端的需求十分旺盛，但是关键半导体元件的短缺可能会对第一个季度的营业额造成负面的影响，现在的预估为营业额会降低3000万美元。 新闻稿 可穿戴设备的超高性能柔性紫外光传感器评论：南洋理工大学研制出用于可穿戴设备的超高性能柔性紫外光传感器。皮肤癌一直是美国非常常见的一种癌症类型，每五个美国人中的一个在70岁前可能就会患上皮肤癌。主要的皮肤癌种类中，包括最致命的黑色素瘤中的86%，都是由于紫外光对皮肤照射造成的。实际上，一个人经过5次晒伤后，黑色素瘤的可能性就会翻倍。新加坡南洋理工大学的团队创造了一种高性能的柔性UV传感器，可以很方便的集成进任何穿戴设备中。该团队相信，在未来，该种传感器可以比现有的同类型传感器提升25倍的响应速度和330倍的灵敏度。可以用于UV暴露的监控，避免使用者长时间暴露在高UV环境中，降低皮肤癌的发生。南洋理工大学的团队克服传统氮化镓紫外传感器是建立在刚性层上的问题，在直径8英寸的半导体晶片上创建了柔性紫外光传感器，使用独立的氮化镓和铝氮化镓单晶层(AlGaN)，使用由两个不同的薄半导体层(异质结构膜)组成的薄膜。同时，该柔性紫外光传感器使用了新型的AlGaN和GaN组合，具有极高的响应度和灵敏度。经过多次弯曲和高温试验，也保持了良好的性能。 论文 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"光学新闻 20210815","slug":"OpticsNews20210815","date":"2021-08-14T17:00:00.000Z","updated":"2021-12-04T11:32:05.721Z","comments":true,"path":"OpticsNews20210815/","link":"","permalink":"https://faster-than-light.net/OpticsNews20210815/","excerpt":"本周五篇光学新闻： 荣耀发布Magic 3系列手机 — 英飞凌为AR发布全新MEMS扫描仪解决方案 — II-VI年营收首次超过30亿美元，3D传感营收翻倍 — DigiLens发布透明分辨率扩展器，可将波导内投影仪分辨率提高一倍 — UCLA科学家开发出光波长转换新方法","text":"本周五篇光学新闻： 荣耀发布Magic 3系列手机 — 英飞凌为AR发布全新MEMS扫描仪解决方案 — II-VI年营收首次超过30亿美元，3D传感营收翻倍 — DigiLens发布透明分辨率扩展器，可将波导内投影仪分辨率提高一倍 — UCLA科学家开发出光波长转换新方法 荣耀发布Magic 3系列手机评论：2021年8月12日，标志性全能科技旗舰荣耀Magic3系列新品正式发布，荣耀Magic3、荣耀Magic3 Pro、荣耀Magic3 至臻版三款机型集中亮相。这是荣耀脱离华为后第一款真正的旗舰机，技术评论网站Engadget的评价为“除了外型，荣耀 Magic 3 系列还想接过华为的影像大旗”。这次荣耀确实在影像上堆料十足，有四颗影像摄像头，主摄7P，广角7P，长焦用了潜望式，还有最中心的一颗黑白镜头，同时配备了1个辅助对焦dTOF模组。不过，近期美国众议院14名共和党议员要求美国商务部将荣耀列入美政府的制裁名单，也给荣耀的前路蒙上了一层阴霾。 发布会视频 英飞凌为AR发布全新MEMS扫描仪解决方案评论：英飞凌（Infineon Technologies AG ）发布了结合MEMS镜和MEMS驱动整合的全新MEMS扫描仪解决方案，该产品特点是小型化和低功耗，可以用于AR或者车载应用的HUD。英飞凌的MEMS方案是新一代的激光扫描投影系统，对比同类产品，该系统在性能，大小，能耗和成本上有优势。英飞凌正与维也纳初创公司TriLite Technologies GmbH合作。英飞凌负责MEMS扫描仪芯片组，而TriLite负责系统集成和控制算法。TriLite主要产品是其宣称的世界最小的投影显示模组Trixel® 3 ultra-compact display 新闻稿 II-VI年营收首次超过30亿美元，3D传感营收翻倍评论：II-VI发布财报，年营收首次超过30亿美元，其中一部分是来自于2019年收购的子公司Finisar。同时，现阶段II-VI正在进行收购激光巨头Coherent，该收购会在2022年有结果。II-VI的主要营收来自于光子学解决方案和半导体激光元器件（包括VCSEL等）。电子消费品开始大规模使用激光导致各厂商开始进行合并强强联合，扩大生产。 新闻稿 DigiLens发布透明分辨率扩展器，可将波导内投影仪分辨率提高一倍评论：8月10日，DigiLens发布了T-REx(Transparent Resolution Expander)，透明分辨率扩展器。使用固态电子开关式wobulation及决方案，来提升光波导投影系统的最终显示分辨率。Wobulation技术，是指把有着轻微偏移两帧叠合在一起，比如用一帧去轻微偏移，正好填住另一帧像素中间的空间。如果这个过程足够块，人眼无法分辨出有两帧，而是认为有着更多的显示细节。T-REx技术使用了“可开关”光波导， DigiLens宣称T-REx技术主要的优势有： 分辨率提高一倍 低功耗: 19.8mW，如果使用Crystal 50光波导（RGB），每层专门的颜色波导6.6mW 空间小: T-REx光波导集成进Crystal 50光波导中，所以并不增加重量，增加的重量主要是Flex线，只有0.15g多出来的重量。 多种投影系统都可以兼容: 可以兼容 LCoS, µLED, DLP, OLED, LBS 和 WILD等投影系统，只需要这些投影系统可以在时域上产生两个偏移帧。 热和声音: T-REx不产生任何热量，声音和震动，可以一直工作，其他wobulation技术可能会有震动的嗡嗡声，或者可能产生一些热量，或者可能变的很大并十分耗能。 DigiLens并没有具体说明该技术如何工作，但是以行业内的其他类似研究和方案来看，可能是使用电流去控制光波导轻微移动位置，以使wobulation成为可能，但是Digilens又宣称没有震动存在，所以到底是如何实现的，还需要DigiLens披露更多信息。Facebook 的研究者们也在VR系统上证明过相似的系统 mechanically moving displays for reducing the screen-door effect of VR headset. T-REx可作为可选附加组件技术授予DigiLens许可证持有人；或者，客户和合作伙伴可以在定制智能眼镜项目时请求所述功能。 新闻稿 UCLA科学家开发出光波长转换新方法评论：转载加州大学洛杉矶分校（UCLA）萨缪利工程学院的科学家开发出了一种更高效的光波长转换方法，据称有望为成像、传感和通信系统的性能改善打开新大门。加州大学洛杉矶分校萨缪利工程学院的电气和计算机工程教授Mona Jarrahi领导了这项研究，该研究成果已于上周在Nature Communications发表。找到一种有效的方法来转换光的波长，对于许多成像和传感技术的开发至关重要。例如，将入射光转换为太赫兹波，可以实现对光学不透明环境的成像和传感。然而，此前开发的光波长转换框架效率很低，并且需要庞大而复杂的光学装置。 半导体表面态 UCLA领导的研究小组设计出了一种新解决方案，他们通过探索一种通常不受欢迎但却是自然现象的半导体表面态，来提高光波长转换效率。在半导体材料中，表面总会有边界的存在。而在边界处，由于外部已经没有原子与表面硅原子结合，所以处在表面的硅原子会有未配对的电子存在，即有未饱和的键，被称为悬挂键。这些不完整的悬挂键，会阻碍电荷流过半导体器件并影响其性能。UCLA太赫兹电子实验室负责人Jarrahi说：“一直以来，业界付出了很多努力来抑制半导体器件中表面态的影响，但是并没有意识到它们具有的独特电化学特性，可以实现前所未有的器件功能。” 光波长转换 事实上，这些不完整的悬挂键在半导体表面产生了一个浅而巨大的内在电场，研究人员决定利用表面态来改善光的波长转换。入射光击中半导体晶格中的电子，并将它们迁移到更高的能态，此时它们可以在晶格中自由跃迁。半导体表面产生的电场进一步加速了这些光激发的高能电子，然后这些电子以不同的光波长辐射所获得的额外能量，从而实现光波长转换。不过，这种能量交换只能发生在半导体表面。为了解决这个问题，研究小组采用了一种可以弯曲入射光的纳米天线阵列，从而将其限制在半导体的浅表面周围。该研究的主要作者、Jarrahi研究实验室成员Deniz Turan说：“通过这种新的框架，光波长转换变得很容易进行，而且不需要任何额外的能量源。”Deniz Turan最近从UCLA获得了电气工程博士学位。研究人员成功且高效地将1550纳米波长的光转换为波长范围从100微米到1毫米的太赫兹波。该团队通过将这项新技术整合到内窥镜探头中，验证了波长转换效率，该探头可以利用太赫兹波进行详细的体内成像和光谱分析。如果没有新的光波长转换框架，需要100倍的光功率才能达到相同的太赫兹波成像效果，而内窥镜探头中使用的薄光纤无法支持这种功率。这项突破还可以应用于从微波到远红外波长的电磁光谱波长转换。 光纤尖端的纳米天线阵列，可用于太赫兹波长转换 新闻稿 Mona Jarrahi的UCLA太赫兹实验室 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"塑料镜头制造 第九章：设计","slug":"塑料镜头制造 第九章：设计","date":"2021-08-14T07:00:00.000Z","updated":"2021-12-04T11:32:05.727Z","comments":true,"path":"LensMaking_C9/","link":"","permalink":"https://faster-than-light.net/LensMaking_C9/","excerpt":"前面八章讨论了镜头制造的材料，模具，成型，镀膜，评测，信赖性等话题。我们在最后一章：设计中回到镜头开发的源头，介绍如何结合需求设计一款镜头。本章主要讨论从需求到来到设计完成定案中间的设计阶段需要考虑的问题，主要从产品开发的流程方面讨论。以后如果有机会，可能会具体讨论光学设计和结构设计的细节。","text":"前面八章讨论了镜头制造的材料，模具，成型，镀膜，评测，信赖性等话题。我们在最后一章：设计中回到镜头开发的源头，介绍如何结合需求设计一款镜头。本章主要讨论从需求到来到设计完成定案中间的设计阶段需要考虑的问题，主要从产品开发的流程方面讨论。以后如果有机会，可能会具体讨论光学设计和结构设计的细节。 设计需求工厂是面向需求进行生产活动的，这个需求有可能是来自于客户，也有可能是来自于内部产品开发。我们重点讨论客户端需求的产品开发，不过首先简单了解一下内部需求的来源。 内部需求我们首先简单讨论一下来自内部的需求，这些需求可能来自：第一，公司为了开发一些标准品镜头用于展示技术实力，或者进行技术研发和验证；第二，某种镜头应用场景很普遍，或者搭配某种sensor的需求很旺盛，公司开发一款镜头作为标准品销售。标准镜头主要指的是由镜头厂拥有IP的镜头，相对应的是客户定制镜头，镜头厂可以按自己的意愿销售自己拥有IP的镜头，但是不可以随意销售某一客户定制的镜头。 客户需求塑料镜头应用于各个行业，主要是电子消费品，其中最重要的是手机，近些年各种非手机类应用也迅速增加，包括智能家居中的扫地机器人，带显示屏的智能音箱，AR/VR头盔等。不同应用的区别造成了光学系统设计的不同，最终造成了镜头需求的不同。手机中的光学模组有照相模组，其中有主摄像模组，广角镜头模组，长焦镜头模组，长焦折返式镜头模组，前摄自拍镜头模组；3D识别模组，其中有人脸识别模组，TOF红外模组，辅助对焦模组；指纹识别模组；临近传感器模组；闪光灯模组等。扫地机器人里有影像模组，TOF模组，一维扫描识别模组等。AR和VR头盔里有空间识别模组，TOF手部追踪模组。智能家居中有视频通话模组等。 所有的这些不同应用的模组都有自己独特的光学和结构等技术需求，包括不同光学分辨率，传感芯片选择，大小形状需求，信赖性要求等；也包括需求数量，价格，供货周期等非技术的项目需求。 产品开发流程项目的商务信息确认客户会有各种各样的项目需求，首先对接的是一个镜头生产企业的营销和市场部门。最初的接触需要确认的业务层面的事项有： 确认是否该客户的镜头项目是该镜头厂的业务范围。比如如果客户的需求是做一个塑料投影镜头，但是企业的主营业务是小型的手机镜头，那么这就不合适。 客户是谁，大企业希望和大企业合作，保证自己的技术进步以及订单数量，财务上风险也更低 确认客户需求的产品数量，大规模的生产企业希望有相对较大的订单 确认客户需求的产品技术等级，头部的制造企业希望去多生产高端镜头，以获得更高的利润率。比如大立光学更多的项目会去做来自于大手机终端客户主摄镜头，而相对较少的关注小一些终端企业的前摄镜头 确认客户的镜头需求时间和未来需求周期，各公司自己都是由开发周期的，有些时候一款镜头从设计到量产最快也要两个月，短于这个时间是不可能的，而太长的开发周期也对镜头制造厂不利，制造成很难很快的把项目转化为实际的经济效益。 确认销售镜头到何处，下游模组厂是哪家，这里主要是商务相关内容，涉及进出口相关内容。如果是中国的镜头厂销售给中国的模组厂，这都是本地销售；也有可能是国内镜头厂销售给到韩国的模组厂，这就要出口；也有可能是出口到保税区。对于营销部门来说，这是需要提前确认的内容。 价格需求范围 项目的前期技术需求确认商务上如果项目可以继续，镜头制造企业的技术部门会开始和终端客户进行交流。最初的交流一般是进行技术规格的确认，其中包括： 使用的传感器型号，大小，像素数，像素尺寸，芯片的CRA信息（以及可以接受多大的镜头CRA相对芯片CRA的偏移） 像高，像面余量要求 镜头工作距离，工作波长及权重，F/#，FOV（长、宽、对角），EFL，BFL等 镜头长度，大小，期望的镜片数量，镜片材料 不同视场，频率，工作距离下MTF要求，畸变，TV畸变，相对照度RI，色差，场曲要求等 镜筒形态，是用于定焦螺纹组装还是变焦点胶组装。 滤光片在镜头上还是传感器上，滤光片厚度 镜头工作温度，可靠性测试条件 外观需求 其他特殊需求，比如镜筒前端样式，光阑位置，镀膜颜色等。 光学工程师和光机工程师会首先和客户交流这些参数，确认设计需要的基本参数都已经有所说明，同时要和客户交流哪些参数是必须保证的数值，哪些参数是期望的数值，可以接受变动（比如FOV，像高，F/#一般都是客户已经确认的数值，但是MTF的数值可能终端是根据自己的完美优化提出的参考值，并没有完全考虑可制造性）。确认后，即可开始第一阶段的初始光学设计。 光学设计光学设计工程师会使用CodeV，Zemax等光学设计软件进行光学设计的仿真，这其中要考虑的问题有： 客户技术指标 杂散光，鬼像情况 可制造性及良率 专利规避：设计的光学系统结构要避免冲突其他公司的专利，主要使用自己公司已经申请的专利结构，如果发现了新的结构，边进行设计的同时也会进行专利申请 这个阶段的设计，光学工程师会给结构工程师留出结构设计的镜片法兰余量和镜筒厚度余量，这个阶段结构工程师参与较少，主要是在光学设计完成后，进行简单的分析，确认结构设计余量充足，镜片之间间距合适，可以使用标准方法进行镜片镜筒结构构建即可。 对于镜片的可制造性，光学工程师会根据公司内部制程能力对镜片形状进行限制。 设计完成后，光学工程师会输出设计输出表，其中包括了达到指标和客户需求的技术指标的对比。 结构设计结构设计工程师会根据光学工程师的光学镜片参数，形状，通光部分进行结构设计，主要是镜片的法兰形状和各个镜片的配合结构，隔片，隔圈，压圈的设计，镜筒形状和结构，组装方式设计等。根据光学工程师的设计公差，定义各零部件公差和要求。输出每个单独零部件的图纸，3D示意图，已经组装示意图等。 设计迭代高端镜头客户要求往往提的比较高，在进行可制造性和良率的考虑的第一版设计后，有些光学指标可能无法达到客户的需求。这时候会首先开始光学设计迭代，光学部分基本定型后，其他工程师的工作再开始展开，有助于提升效率。但是在这个迭代过程中，也是需要多部门的工程师参与和提出意见，其中包括光学设计工程师，结构设计工程师，模具和成型工程师，镀膜工程师，组装工程师，测试工程师，品质保障工程师等等。迭代过程中，和客户的交流是持续进行的，其中包括了平衡客户需求，技术实现难度，良率，价格等多方面因素。 举例说明： 比如某一款设计MTF未能达标，客户提出希望MTF必须达标，迭代出的光学设计致使某片镜片更薄，这时需要和结构工程师及模具和成型工程师确认，能否实现，预估良率如何等问题。 为实现大视场部分（比如0.9F）的MTF，良率下降很多，导致价格上升，经客户交流后，客户适当降低标准。 报价随着设计逐渐定型，成本部门开始进行成本评估，营销和市场人员根据成本进行价格评估和报价。 成本评估：成本评估包括了一个镜头的物料成本，从最初的各个镜片及零部件的材料费用，考虑各个生产流程的良率如单镜片成型良率，镀膜良率，组装良率后的镜头费用，增加公司的一些基础费用（比如设备折旧）等评估出镜头费用。镜头费用的模型是随着产量增多呈现下降趋势，最终趋于稳定在一个值。同时成本还包括各种模具费用，治工具费用（镀膜治工具费用） 报价：营销和市场人员负责和客户采购进行对接，讨论价格。 全流程设计光学设计基本确定后，镜头制造企业的制造部门的设计会全面展开，在产品真正开模前基本确认全流程的方案，这期间多个部门会在项目管理人员的协调下开展工作，并进行多次讨论会议，确认方案，风险等。各个部门和工程师的职责简单描述如下，具体可以参考前八章内容： 光学设计工程师：光学设计工程师在基本参数确认后，会开始进行杂散光的优化尝试和良率的优化，尝试最大可能性在确认参数范围内确定合适的公差范围，提升良率，优化品质。 结构设计工程师：结构设计工程师会更具体的设计各零部件细节，尝试在镜片法兰制造结构或者粗糙表面，使用隔圈隔片等消除杂散光。 模具和成型工程师：模具和成型工程师对每个单镜片进行模具的设计，成型的仿真，确认成型的风险，针对性的进行模具设计和后期的成型优化，保证单镜片的成型可以达到光学设计需要的公差和比较高的良率。 镀膜工程师：镀膜工程师根据光学工程师提供的入射光线角度，进行镀膜设计，确定镜片的膜层，使用何种镀膜机等问题。 组装工程师：组装工程师设计组装流程，主要是确认可以使用的设备，可能的组装参数，有无特殊组装要求等。 测试工程师：测试工程师主要设计测试方案，包括了部品的测试方案，最重要的是镜头的MTF的检测计划，确认检测视场，提前定制检测用标板（reticle）等。 品质检测工程师：品质保障或者品质检测工程师会进行品质保证计划的编写，确认针对该款产品，品质检测合理，包括了对入料的IQC检测，部品的中间检测方案，最终产品的品质保障方案等。 信赖性测试工程师：确认信赖性要求，保证信赖性测试可以在计划时间点上开展，有设备可用。 项目管理：项目管理人员组织各部门协同工作，制定阶段开发计划和时间表并和客户交流。让客户了解合适可以得到结构样品（人工组装样品，结构件，无光学性能），具备光学性能的性能样品，需要多久进行生产优化，合适可以进行模具扩展和大规模生产等。同时，项目管理也会确认在计划的时间点上，哪个部门需要开展何种工作。 最终设计定案企业和客户确认最终方案后，确认订单量，签订合同后。各技术部门会进行最终的确认会议，确定方案，然后模具部就可以开始进行模具的制造，其他各部门开始按计划准备相应的工作内容。 总结第九章，主要简单介绍设计定案模具开模前的工作。可以看到，前期考虑周到的设计，有助于使项目有序的开展，提前预估技术难度和生产风险等，这对高端塑料镜头尤其重要。其中光学和结构设计工程师需要了解制造上的各种限制和需求，才能设计出可制造的镜头。同时，设计阶段是多部门合作的工程，需要各部门和多种职能的工程师参与。 塑料镜头的设计和制造技术也在需求的提升下不停的更新和提升，这需要公司关注客户需求，关注市场动态，提前进行设计探索以及制造技术的提升。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"塑料镜头制造","slug":"塑料镜头制造","permalink":"https://faster-than-light.net/categories/%E5%A1%91%E6%96%99%E9%95%9C%E5%A4%B4%E5%88%B6%E9%80%A0/"}],"tags":[{"name":"镜头","slug":"镜头","permalink":"https://faster-than-light.net/tags/%E9%95%9C%E5%A4%B4/"},{"name":"专题","slug":"专题","permalink":"https://faster-than-light.net/tags/%E4%B8%93%E9%A2%98/"}]},{"title":"光学新闻 20210807","slug":"OpticsNews20210807","date":"2021-08-07T08:00:00.000Z","updated":"2021-12-04T11:32:05.721Z","comments":true,"path":"OpticsNews20210807/","link":"","permalink":"https://faster-than-light.net/OpticsNews20210807/","excerpt":"本周五篇光学新闻： 高光谱传感器的开发公司Spectricity融资1600万美元 — ToF传感器厂商聚芯微电子完成数亿元C轮融资 — 美军寻求“第四代”红外解决方案 — Quanergy展示了基于光学相控阵技术，探测距离达100m的固态激光雷达— 偏振三维成像技术的原理和研究进展","text":"本周五篇光学新闻： 高光谱传感器的开发公司Spectricity融资1600万美元 — ToF传感器厂商聚芯微电子完成数亿元C轮融资 — 美军寻求“第四代”红外解决方案 — Quanergy展示了基于光学相控阵技术，探测距离达100m的固态激光雷达— 偏振三维成像技术的原理和研究进展 高光谱传感器的开发公司Spectricity融资1600万美元评论：致力于为移动和消费类设备提供高光谱传感解决方案的领先供应商Spectricity，近日宣布完成1600万美元B轮融资，以进一步加快高光谱传感器的开发和大规模量产，用于从可穿戴到智能手机和物联网领域的大批量、低成本应用。Spectricity是一家fabless公司，总部在比利时，2017年建立，致力于开发可以用在移动设备上的高光谱传感解决方案。Atlantic Bridge、Capricorn Fusion中国基金和上海半导体装备和材料基金（SSMEF）等全球领先投资者参与了Spectricity此轮融资，此前的A轮投资者imec.xpand和XTRION也继续跟投了本轮融资。此轮融资完成后，Spectricity的融资总额已经达到2400万美元。 光谱成像技术，其本质是充分利用了物质对不同电磁波谱的吸收或辐射特性，在普通的二维空间成像的基础上，增加了一维的光谱信息。成像光谱可以同时获取影像信息与像元的光谱信息，根据光谱分辨率不同介绍下多光谱成像、高光谱成像技术； 多光谱技术（Multispectral）：目标物波段数在3-30之间（通常大于等于3个）；高光谱成像（Hypespectral）：目标物波段数在100-300之间，光谱分辨率一般会更精细。 对于Spectricity的产品，哪家手机公司会去尝鲜，以及Spectricity或者手机终端公司基于这种技术能开发出何种应用，以及搭配该应用的算法都十分重要。根据2021年3月发布的一篇关于紧凑型光谱仪市场的文章，到2024年，新兴的芯片级光谱仪年出货量将增长至超过3亿颗。新型光谱仪的尺寸将缩小至半导体芯片的尺寸。 新闻稿 ToF传感器厂商聚芯微电子完成数亿元C轮融资评论：模拟与混合信号芯片设计公司聚芯微电子宣布完成数亿元C轮融资。本轮融资由多家知名半导体产业资本联合投资，包括小米长江产业基金、华为哈勃投资、华业天成（老股东增持）、恒信华业以及一家行业顶尖的产业链基金。结合此前几轮OPPO战投、和利资本、源码资本、湖杉资本、将门创投等专业机构的加持，聚芯微电子成为获得了三大手机品牌战略投资的模拟与混合信号芯片设计公司。 武汉市聚芯微电子有限责任公司成立于2016年1月，是一家专注于高性能模拟与混合信号芯片设计的创新型高科技公司，总部位于武汉光谷未来科技城，并在欧洲、深圳和上海设立有研发中心。公司由多位在欧美拥有丰富半导体行业经验的留学归国人员创办，核心团队聚集了在企业管理、产品研发、市场销售、财务管理和生产制造等各环节拥有卓越业绩的行业精英。 公司拥有3D光学和智能音频两大产品线，其中智能音频功放凭借差异化的产品及优秀的性价比已得到主流手机厂商的认可，而用于3D成像的飞行时间（Time-of-Flight）传感器采用了背照式（BSI）技术，具有高精度、小像素尺寸、高分辨率、低功耗、全集成等特点，打破欧美国际厂商的垄断，可广泛应用于人工智能、人脸识别、自动驾驶、AR/VR、3D建模、动作捕捉、机器视觉等领域，在手机、安防、汽车等主流市场拥有光明的商业落地前景。在过往的经历中，聚芯微电子的团队拥有多项业界“第一”：开发出国内首款基于BSI（背照式）工艺的高分辨率ToF图像传感器；开发并量产了业内第一款模拟输入的智能音频功放产品，以及行业最低噪声的传感器信号调理芯片。 模拟与混合信号芯片设计近些年是电子消费品的一个重要竞争领域，近期美国对高端芯片制造的各种封锁也让中国企业开始重视投资中国芯片设计公司。国际上类似公司有TI，Analog Device，AMS，ST等公司。 新闻稿 美军寻求“第四代”红外解决方案评论：在近期圣地亚哥举办的SPIE Optics + Photonics会议上，来自美军C5ISR Center’s Night Vision and Electronic Sensors Directorate （C51SR夜视和电子传感董事会）的Nibir Dhar做了题目为“Infrared technology: What is on the Horizon?”的演讲。主题主要是下一代红外传感技术。他提出红外传感关注的6个重点领域，其中包括长距离精确打击，下一代战场载具，垂直起降航空器，网络技术，航空和导弹防御，最大化致死，他提出红外技术可以极大辅助这些领域。前三代的军用红外技术为： 1970s-1980s：扫描MWIR和冷却LWIR传感器 1990s：结合了长线性TDI PV扫描阵列的扫描MWIR和小型MW/LW Staring array 2000s：双波段LW/MW大型多功能阵列，包括片上处理和高工作温度 他认为下一个系统主要包含这些需要提升的方面：规模性，传感，渲染，速度，融合和处理。包括系统小型化和更高的处理速度。 新闻稿 Quanergy展示了基于光学相控阵技术，探测距离达100m的固态激光雷达评论：Quanergy，总部在Sunnyvale的激光雷达公司，近期展示了基于光学相控阵（optical phased array，OPA）的最新开发的固态激光雷达。这次发布的S3系列激光雷达，使用了OPA技术和CMOS解决方案，可以实现大规模生产。该公司的测试和Zero Electric Vehicle（ZEV）公司合作进行，ZEV公司是提供电动汽车电器控制平台的公司。S3系列相控阵型固态激光雷达完全没有移动部件，依赖相控阵技术调制光线指向方向，系统的抗震动抗撞击和信赖性比起普通的使用旋转方案或者MEMS反射镜的方案都大大提升，这次该公司把探测距离提升至100m可以算是很大的一步。该系列达到了了10万小时平均失效时间，目标价格要小于$500美元。不过其他探测性能对比使用其他方案如何需要具体研究该种雷达的spec。 新闻稿 偏振三维成像技术的原理和研究进展评论：西安电子科技大学，西安市计算成像重点实验室的几位作者，四月在红外和毫米波学报上发布了“偏振三维成像技术的原理和研究进展”，摘要如下：近年来偏振三维成像技术因具有精度高、作用距离远和受杂散光影响小等特点得以蓬勃发展，但利用目标反射光偏振特性进行法向量精确求解的问题一直没有真正得到解决，成为制约该技术发展的瓶颈。此外，由于目标表面镜面反射光与漫反射光间的相互干扰，造成高精度偏振三维成像实现困难。该综述介绍了偏振三维成像物理机理、目标表面出射光偏振特性，以及偏振三维成像研究进展。最后总结了目前偏振三维成像面临的问题和未来的发展方向。 文章主要说明的就是使用偏振三维成像可以实现更高精度的三维成像，而且有各种优势。近些年小型化偏振传感器的发展和VCSEL的发展都很迅速，可能我们很快就能看到一些电子消费品类的应用了。 论文 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"光学新闻 20210801","slug":"OpticsNews20210801","date":"2021-08-01T09:30:00.000Z","updated":"2021-12-04T11:32:05.720Z","comments":true,"path":"OpticsNews20210801/","link":"","permalink":"https://faster-than-light.net/OpticsNews20210801/","excerpt":"本周五篇光学新闻： 华为P50系列全球首发XD Optics计算光学 — PhotonicLEAP 光子学封装项目获欧盟500万欧元资助 — 伯克利大学的高能激光光束测量新方法 — 国内首个拉曼光谱仪通用标准制定，12月1日开始实施 — 华中科技大学研发用于气体传感的多光谱窄带热探测器","text":"本周五篇光学新闻： 华为P50系列全球首发XD Optics计算光学 — PhotonicLEAP 光子学封装项目获欧盟500万欧元资助 — 伯克利大学的高能激光光束测量新方法 — 国内首个拉曼光谱仪通用标准制定，12月1日开始实施 — 华中科技大学研发用于气体传感的多光谱窄带热探测器 华为P50系列全球首发XD Optics计算光学评论：华为新品发布会上，华为P50系列引入XD Optics计算光学，突破光学系统物理边界。同时，业界首创“全局式”图像信息复原系统，在光学成像阶段修正光学误差、还原原始图像信息。结合新一代XD Fusion Pro图像引擎，可还原更多画面细节，纤毫毕现。据介绍，XD Optics计算光学为业界首创的移动影像技术，突破物理极限，打造“全局式”图像信息复原系统，保留了81%的图像信息。通过修正光线误差、还原细节，使P50 Pro 3.5倍光学变焦镜头实现了不亚于10倍物理光学变焦的成像效果。此外，华为P50系列的XD Fusion Pro新引入超级滤光系统、原色引擎和超动态范围。 从介绍图上看，猜测是通过测量镜头的像差，然后在ISP里进行了处理。猜测实现方式可能是在镜头组装进模组前，进行点扩散函数的测量。最可能的实现位置就是AA组装前。或者也可能是组装后，通过进行一系列图像，对焦位置的成像信息收集，然后使用算法实现预先修正。不过这个效果和只使用ISP，以及ISP本身算法好坏有多大关系还需要再思考一下。 发布会视频 PhotonicLEAP 光子学封装项目获欧盟500万欧元资助评论：PhotonicLEAP是欧洲的一个合作项目，由爱尔兰的Tyndall National Institute领头，该项目得到了欧盟500万欧元的支持，用以开发光子学生产的颠覆性技术。光子学市场2026年会增长到8500亿欧元，所以对大规模生产技术有着很大的需求，这些包括了自动驾驶，IOT，光通信等需要的集成光子电路。该项目将开发创新的表面封装技术集成光子电路（Surface Mount Technology (SMT) PIC ），把多个光子学元件和电路封装在一起。该项目将使用尖端技术样例来验证这些技术，包括了一个高速光通信模组和一个用于心血管检测的便携式医疗设备。该技术将会被应用在欧洲PIC Packaging Pilot Line, PIXAPP上进行商业化。该项目包括了多家知名研究机构和公司，包括Fraunhofer institutes (IZM &amp; HHI), LPKF Laser &amp; Electronic, ficonTEC Ireland, SUSS MicroOptics, BOSCH, Eindhoven University of Technology – TU/e and Interuniversitair Micro-Electronica Centrum – imec as well as Tyndall National Institute. 新闻稿 伯克利大学的高能激光光束测量新方法评论：隶属于劳伦斯伯克利国家实验室下的伯克利大学激光加速实验室开发了一种可以精确测量和控制高能激光光束指向位置和角度的光学系统，而无需截断或者干扰光束。高能激光的传统测量方式要么是截断部分光束降低能量然后测量，但是这不是直接测量光束，并不准确。该实验室的方式主要是把光束分束，然后测量低能量的那部分。如下图所示，整个系统包含三部分关键元件，首先，激光每秒发射5个高能脉冲和上千个低能脉冲，都在一个光路上，然后高能和低能的脉冲在光路上将会被整形到同样的大小和发散角；最后，使用一个前后两面都有镀膜的楔形镜，1%的能量会穿过楔形镜的上表面，然后被下表面反射，成为被观测的光束，主要测量该光束。近期的一个目标是使用这种技术去作为激光的位置和角度的测量反馈系统，前期的100太瓦的实验证明了该方法的可行性。 新闻稿 国内首个拉曼光谱仪通用标准制定，12月1日开始实施评论：市场监管总局(国家标准委)批准发布386项推荐性国家标准和3项国家标准修改单。其中，《拉曼光谱仪通用规范》（GB/T 40219-2021）是首次制定，2021年12月1日实施。《拉曼光谱仪通用规范》标准规定了拉曼光谱仪的术语和定义、分类、要求、试验方法、检验规则、标志、包装、运输和贮存，适用于采用激光为激发光源的拉曼光谱仪，其他光源的仪器可参考执行。据悉，本标准的制定将结束国内外没有拉曼光谱仪标准的历史，其发布实施不仅规范了拉曼光谱仪生产厂家的生产检验标准，使得进入市场的产品品质更有保障，促进国内拉曼光谱仪产业更健康有序的发展，同时也提高了与国际同类产品的整体竞争水平。本标准由中国机械工业联合会提出，全国分析仪器标准化分技术委员会( SAC/TC124/SC6)归口管理，主要起草单位为福建省计量科学研究院 、厦门大学 、厦门市普识纳米科技有限公司 、福建师范大学 、同方威视技术股份有限公司 、北京卓立汉光仪器有限公司 、北京华泰诺安探测技术有限公司 、北京市计量检测科学研究院 、中国科学院物理研究所 、奥谱天成(厦门)光电有限公司 、北京雪迪龙科技股份有限公司 、北京北分瑞利分析仪器(集团)有限责任公司 、上海如海光电科技有限公司 、天美仪拓实验室设备(上海)有限公司 、上海仪电分析仪器有限公司 、上海市计量测试技术研究院 、福州云石科技有限公司 、北京华夏科创仪器股份有限公司 、浙江同创海诚科技有限公司 、屹谱仪器制造(上海)有限公司 、劢强科技(上海)有限公司 、济宁市计量测试所 、浙江谱创仪器有限公司 、北京鉴知技术有限公司 。这些机构和公司可以作为以后查找拉曼设备的参考。 随着光源技术和纳米增强基质的发展与应用，基于拉曼光谱的检测技术已被广泛用于食品安全、环境科学、公共安全、生物医药等领域的定性定量分析，成为检测市场的一个热点。不过，相对于拉曼光谱仪目前的应用领域和未来亟待拓展的应用方向，相关的标准还不够。现阶段，拉曼光谱仪，特别是手持/便携拉曼光谱在应用拓展方面正在寻求新的应用“爆发点”，而标准的滞后也在一定程度上限制了该类仪器的推广应用。 拉曼光谱仪通用规范 华中科技大学研发用于气体传感的多光谱窄带热探测器评论：主要创新点是通过超表面结构进行滤光，然后可以实现多通道气体检测。主要优势是用超表面维纳架构代替滤光片，去除了单独的滤光片的制造和封装成本，可以在晶圆上进行大规模生产。但是，个人认为最后工业界的选择可能会多种多样，因为很多滤光本身现在是直接在晶圆上进行filter镀膜，也没有封装成本。超表面的制造比直接镀膜要复杂一些，有可能还增加了成本。同时对于工业化的使用，超表面各个order反射出来的杂光对测量精度的影响也要分析。 论文 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"光学新闻 20210725","slug":"OpticsNews20210725","date":"2021-07-25T05:00:00.000Z","updated":"2021-12-04T11:32:05.720Z","comments":true,"path":"OpticsNews20210725/","link":"","permalink":"https://faster-than-light.net/OpticsNews20210725/","excerpt":"本周五篇光学新闻： 阿尔卑斯山脉上巨型太瓦级激光引导闪电— Luminar 收购其激光雷达芯片供应商OptoGration — Velodyne CEO卸任 — Rockley Photonics发布穿戴健康监控技术 — 新加坡南洋理工大学可编程的彩虹激光器","text":"本周五篇光学新闻： 阿尔卑斯山脉上巨型太瓦级激光引导闪电— Luminar 收购其激光雷达芯片供应商OptoGration — Velodyne CEO卸任 — Rockley Photonics发布穿戴健康监控技术 — 新加坡南洋理工大学可编程的彩虹激光器 阿尔卑斯山脉上巨型太瓦级激光引导闪电评论：这是我今年看到过的最科幻的新闻了，TRUMPF公司报道他们进行了第一次欧盟激光闪电棒项目实验，该项目是和日内瓦大学合作，使用一个太瓦级高脉冲率激光，该激光被放置在阿尔卑斯山脉的Säntis山山顶。该项目的目标是使用激光去进行一系列天气实验，主要是控制暴风雨云团中的闪电打击位置，不让其造成伤害。激光会在暴风云团中制造出一个通道，被称为激光纤维或者激光灯丝，当闪电放电开始时，这个通道会保证闪电沿着这个通道进行打击。这简直就是红色警戒里的超级武器闪电风暴的变种或者是《球状闪电》里描写的前苏联的闪电实验。 新闻稿 Luminar 收购其激光雷达芯片供应商OptoGration评论：Luminar Technologies将收购为其供应 InGaAs 芯片的设计合作伙伴和制造商 OptoGration Inc。在过去五年中，Luminar 一直与 OptoGration 密切合作，开发、迭代和完善 1550nm 激光雷达所需的专用 InGaAs 光电探测器技术。OptoGration 有能力在其位于马萨诸塞州威尔明顿的专业制造工厂每年生产大约 100 万个采用 Luminar 设计的 InGaAs 芯片，并有机会扩大到每年 1000 万个。Luminar公司和大多数激光雷达传感器供应商之间的主要区别在于：Luminar使用的是在磷化铟（InP）晶圆上制造的1550nm波长的激光器。这个波段可以使用更强的能量，用以探测更远的或者更低反照率的物体，但是1550nm对于雨雾的透过性没有905nm强。这次的收购一个是技术层面上的能力结合，同时，个人认为还有很大程度的资本运营的影子，用以推高整体公司市值。OptoGration即使能一年生产100万个芯片，Luminar现阶段也用不掉这个产能。 新闻稿 Velodyne CEO卸任评论：6月6日的新闻报道了“David Hall, Velodyne Lidar公司的创始人，写公开信要求董事会主席Brad Culkin和CEO Anand Copalan下台”，7月19日，公司宣布CEO Anand Copalan将在7月30日正式卸任CEO职位。为了应对这个状况，公司组建了一个执行长办公室来处理公司业务，包括一些主要的功能领导，COO，CFO，首席人力，商务总监。Copalan的辞职主要是公司内部斗争的结果，不过他还会继续给公司提供一些咨询支持。不知道David Hall这次斗争后会出现在哪个位置，我们拭目以待。 新闻稿 Rockley Photonics发布穿戴健康监控技术评论：Rockley Photonics发布了“手腕上的诊所”集成解决方案，包括硬件，应用固件和云分析服务。Rockley Photonics是国际领先的光子技术公司，这次发布的可穿戴式传感新系统可以监控多项生物指标，包括提问，血压，身体含水量，酒精，乳酸，血糖等。该项技术将在未来的数月进行更多的人体试验。这项技术提供连续的非侵入式的生物指标监控，突破了传统便携式健康监控设备的各种挑战。普通的可穿戴设备使用的都是绿色LED进行心率监控，或者一些广谱光源对皮肤进行照射，然后收集返回信号，但是Rockley Photonics使用的红外光谱光子仪可以监控更多的生物指标，该公司使用离散的多波长激光光源对皮肤进行照射，然后使用自己的红外光谱光子仪进行检测，可以实现更好的信噪比（而传统的使用这种方法的设备可能要很大）。3月份，Rockley Photonics已经和SC Health Corp达成协议，SC Health Corp是一家SPAC公司，通过合并，Rockley Photonics将实现上市（NYSE：RKLY） 新闻稿 新加坡南洋理工大学可编程的彩虹激光器评论：新加坡南洋理工大学Yu-Cheng Chen教授课题组开发了一种可编程的彩虹激光器。该激光器基于光纤光流体技术平台与液晶球回音壁微腔相结合。该课题组提出通过控制液晶球拓扑结构对激光波长进行调控的概念，通过对不同拓扑结构的四种颜色的液晶球（红R绿G蓝B黄Y）之间的相互组合，实现高度可控的全色调控。研究者制备了微米量级的液晶球，以空心光纤为载体，通过将不同拓扑结构的RGBY液晶球有控制的填入光纤中来实现光纤光流体彩虹激光器。研究者通过在液晶球中掺入不同浓度的手性分子，制造出具有不同拓扑结构的液晶球，进而调控出12种不同的激光波长。由于可见光的波长与人眼可识别的颜色一一对应，通过从这12种液晶球中挑出选取两个或三个进行组合，可实现298种不同的颜色。这项研究的意义在于利用简单的空心光纤提供了一种微型全彩可编程激光器的新思路, 可用于结构复杂的光纤并能够实现更为精准的颜色控制, 促进小型化全色激光源的发展，为未来可编程化微型光源的发展提供新思路。 论文 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"塑料镜头制造 第八章：信赖性测试","slug":"塑料镜头制造 第八章：信赖性测试","date":"2021-07-21T09:00:00.000Z","updated":"2021-12-04T11:32:05.729Z","comments":true,"path":"LensMaking_C8/","link":"","permalink":"https://faster-than-light.net/LensMaking_C8/","excerpt":"信赖性（可靠性）工程是所有产品的制造中的重要工程项目，对于被大规模人群，在全球各种环境下，长时间使用的电子消费品来说尤其重要。一个产品如果没法长时间在各种环境保证功能，这个产品无法取得成功。定义上，信赖性工程是系统工程的子学科，强调一个设备可以无失效的工作的能力。信赖性描述了一个系统，或者零部件可以在特定的时间长度和特定的条件下可以正常工作的能力。对于手机等电子消费品，信赖性测试是这些产品在各种环境下，设计寿命里的工作能力。信赖性测试有助于在开发阶段发现产品的不足并加以修改，保证最终产品的信赖性，也用于在产品的生产中持续进行抽样信赖性测试保证批次产品的信赖性。本章主要介绍塑料镜头的信赖性测试的种类，测试项目，测试设备。","text":"信赖性（可靠性）工程是所有产品的制造中的重要工程项目，对于被大规模人群，在全球各种环境下，长时间使用的电子消费品来说尤其重要。一个产品如果没法长时间在各种环境保证功能，这个产品无法取得成功。定义上，信赖性工程是系统工程的子学科，强调一个设备可以无失效的工作的能力。信赖性描述了一个系统，或者零部件可以在特定的时间长度和特定的条件下可以正常工作的能力。对于手机等电子消费品，信赖性测试是这些产品在各种环境下，设计寿命里的工作能力。信赖性测试有助于在开发阶段发现产品的不足并加以修改，保证最终产品的信赖性，也用于在产品的生产中持续进行抽样信赖性测试保证批次产品的信赖性。本章主要介绍塑料镜头的信赖性测试的种类，测试项目，测试设备。 信赖性测试项目不同的产品有不同的信赖性测试项目和要求，根源都是实际的使用场景。比如对于电子显示屏，模拟持续的点击和滑动是必须的；对于汽车用镜头，高强度持久的震动测试是显而易见的；对于电池，要进行持续充电实验等。 对于手机类塑料镜头，由于其组成的材料和结构，光学成像的原理，其最易收到震动，冲击，温度变化，化学制品的影响，所以塑料镜头的最主要的信赖性测试项目为：跌落实验，震动实验，高温高湿，湿热循环，热冲击，以及这些项目的混合测试等。 跌落测试跌落实验一般是把镜头从某一高度跌落，模拟手机从高处跌落的场景，一般为1.5m。实验设备相对简单，既为一个可以在固定高度释放样品的测试平台，底座可以为大理石。 机械震动测试机械震动测试模拟镜头在各种震动场景下的表现，生活中可以产生震动的场景非常多，手机本身自己就有震动马达，汽车等场景也会有各种频率的震动。机械震动测试一般在震动平台上测试，以某个加速度进行震动，震动一定次数。 高温高湿测试把镜头置于相对高温度高湿度的测试箱中，比如85℃，85%相对湿度，每隔一段时间（100小时，200小时，500小时，1000小时）取出检查。模拟镜头长时间处于一个高温高湿环境中的性能，也是模拟老化的手段。 湿热循环测试把镜头置于环境测试箱中，从高温高湿条件停留2个小时，相对缓慢降低到低温停留2个小时，再缓慢上升至高温高湿反复循环，模拟环境的变化。测试条件会定义温度湿度，循环次数，升温降温速率等。 热冲击测试把镜头置于环境测试箱中，进行快速的温度变化，比如从-30°C到80℃，一分钟20℃的速率反复变化，做1000个循环。这是模拟环境温度的剧烈变化，比如冬天从室外到室内，手机从最热的使用状态进入到室外，手机从夏天的车里拿入空调房等场景。 热盘测试将镜头放置在100度以上的热盘上加热一段时间，这是模拟维修时为了开启后盖手机被热风枪或者热盘加热到一个较高温度的场景。 高海拔，低海拔测试将镜头置于密封腔中，进行加压或者降压，用以模拟手机的使用和运输的各种海拔环境。 UV老化实验使用一定功率UV灯照射镜头一定时间，模拟塑料镜头长时间被太阳光照射后的发黄老化。 化学侵蚀实验如果镜头暴露在外（有一些镜头的第一片没有额外保护），需要考虑各种化学品的侵蚀，用过涂抹各种化学品进行测试。 瀑布测试结合两种或以上信赖性试验按顺序进行测试，比如先进行一定循环数的热冲击测试，再进行跌落测试。 采样/标准/失效分析采样采样一般按每个Config（镜头搭配）进行，根据样品数量，依照AQL (可接受质量限制Acceptable Quality Limit) 中描述的方法采样， 标准进行信赖性测试的样品测试前会经过各种光学性能测量，外观记录等（或使用同等性能的Golden Sample进行测试）。进行测试的过程中及测试完成后会再根据要求进行相应的测量和观察记录。其中包括镜头的MTF性能，焦距，场曲，外观，杂光等，基本要求是没有性能偏差，要能通过出货标准。随着高端镜头片数越来越多，镜片越来越薄，口径越来越大，镜头面向信赖性的设计越来越重要。一方面，要镜片装得紧，保证镜片在跌落和震动中不会位移，另一方面镜片和镜片之间又不能太紧，防止在高温高湿的过程中变形产生应力。所以镜头设计的机械组装结构设计是高端镜头非常重要的一个课题。 失效分析如果镜头进行信赖性测试后出现了问题，需要进行失效分析（FA）和后续DOE的实验发现问题，一般FA实验室会配备各种设备，比如用于观察的光学显微镜，扫描结构的X光机和CT设备，进行表面扫描的SEM/EDS，进行物质成分分析的FTIR，以及各种我们提到过的光学零部件测试设备如UA3P或者Trioptics ImageMaster® HR等。对于塑料镜头来说，常用的分析手段有： 使用Trioptics ImageMaster® HR进行光学品质分析，通过MTF曲线的变化分析镜头内部发生的变化； 使用CT设备扫描内部结构，观察是否有镜片位移； 镜头拆开，使用UA3P对每个镜片进行面型测量，观察是否经过信赖性测试，镜片由于应力发生了形变，面型发生了变化。 持续信赖性测试工艺参数的稳定和锁定不变对信赖性的稳定至关重要。但是光学镜头生产中，工艺变化时有发生（比如镜片旋转的角度）。持续信赖性测试，ORT(On-going Reliability Testing)是指在大规模量产进行的过程中，不停的对产品抽样并投入信赖性测试，用以监控量产产品的信赖性。根据生产的规模，工艺的稳定性，会定义不同的采样频率，数量和测试项目及测试要求。随着生产，如果持续性信赖性测试的结果良好，可以逐渐降低采样数量或者采样频率。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"塑料镜头制造","slug":"塑料镜头制造","permalink":"https://faster-than-light.net/categories/%E5%A1%91%E6%96%99%E9%95%9C%E5%A4%B4%E5%88%B6%E9%80%A0/"}],"tags":[{"name":"镜头","slug":"镜头","permalink":"https://faster-than-light.net/tags/%E9%95%9C%E5%A4%B4/"},{"name":"专题","slug":"专题","permalink":"https://faster-than-light.net/tags/%E4%B8%93%E9%A2%98/"}]},{"title":"光学新闻 20210718","slug":"OpticsNews20210718","date":"2021-07-18T04:00:00.000Z","updated":"2021-12-04T11:32:05.720Z","comments":true,"path":"OpticsNews20210718/","link":"","permalink":"https://faster-than-light.net/OpticsNews20210718/","excerpt":"本周五篇光学新闻： Looking Glass 发布第二代全息显示器产品：Looking Glass 4K和 8K— 三星发布车用HDR-LFM应用CornerPixel传感器 — 特斯拉完全移除雷达，使用纯视觉自动驾驶 — DigiLens宣布与三菱化学合作，推出高性能低成本塑料波导 — 华中科技大学学者制造出一种分级结构的超材料织物，穿上它可降温近5 ℃","text":"本周五篇光学新闻： Looking Glass 发布第二代全息显示器产品：Looking Glass 4K和 8K— 三星发布车用HDR-LFM应用CornerPixel传感器 — 特斯拉完全移除雷达，使用纯视觉自动驾驶 — DigiLens宣布与三菱化学合作，推出高性能低成本塑料波导 — 华中科技大学学者制造出一种分级结构的超材料织物，穿上它可降温近5 ℃ Looking Glass 发布第二代全息显示器产品：Looking Glass 4K和 8K评论：Looking Glass Factory是一家专注于制作裸眼全息显示的公司，该公司开始专注于商用的大型全息显示，2020年发布了低价的入门级全息相框，今年再次更新了自己的高端全新显示产品，发布了第二代15.6英寸的Looking Glass 4K和32英寸的 Looking Glass 8K，售价分别为3000美元和15000美元。这篇文章分析了该公司入门级全息相框的光学显示原理。该公司逐渐在打磨自己的产品，越来越易用和简单。 三星发布车用HDR-LFM应用CornerPixel解决方案评论：三星这次发布的CornerPixel解决方案在3um大像素边上放上1um的小像素，大像素用于低光照场景，小像素用于高亮场景，结合起来实现了120dB的高动态范围HDR同时可以降低LED闪烁（LFM）带来的影响（通过增加小像素曝光时间减弱交通信号灯和LED路灯的在相机上的闪烁效果）。 新闻稿 特斯拉完全移除雷达，使用纯视觉自动驾驶评论：这里移除的是毫米波雷达，从下图可以看到，该雷达主要是覆盖前向。是技术上，特斯拉依靠大规模数据和机器学习，训练自己的自动驾驶系统，这个雷达的作用估计是越来越低。同时，只使用纯视觉系统确实可以再便宜一些。对于激光雷达，特斯拉一定有很多现阶段不使用激光雷达的理由。比如在特斯拉这个大规模的销量下，激光雷达产品的性能均一性可能还不够达到他们的要求，很多东西可能都没有搞清楚，真的不一定比纯视觉系统好用。特斯拉出事故的撞上白色货车这种场景，未来通过使用偏振图像传感器也是可以实现分辨的。特斯拉这种使用纯视觉自动驾驶对于制造车载模组的厂商们是个利好，同时也对镜头的性能和价格提出了更高的要求。也许，车用摄像头也会和手机镜头一样，开始一轮军备竞赛。同时，会有各种企业尝试进入这条赛道。 新闻稿 DigiLens宣布与三菱化学合作，推出高性能低成本塑料波导评论：根据Diamond Edge Ventures(三菱化学的投资公司)的主题Patrick Suel说明，由于Digilens使用自己专利的感光树脂和制程，使其成为唯一一种可以在塑料基底上制作光波导的制程。这种制程不需要光刻，这提供给了智能眼镜OEM厂商一个基于塑料基底的选择。根据新闻稿，这种解决方案的性能和使用玻璃基底的性能在同一水平上，同时降低了重量和长期生产的价格。另一个优势是由于不使用玻璃，降低了碎裂等造成的安全风险。对于这个解决方案，作者保持观望态度，Digilens的制程让它的性能和玻璃基底的性能一样，不代表性能可以达到第一梯队，同时价格的降低不一定有很大优势，现阶段高折射率玻璃基底随着扩大生产，价格越来越低，玻璃基底在未来可能也会非常便宜，而且玻璃的炼制可以基于一炉一炉的方式。而如果这种塑料基底只有三菱化学可以生产，只有digilens可以基于这种材料制作，那么化工上很难有动力去改造设备放大生产，降低价格。 下图展示了使用玻璃和塑料的光波导厚度和重量的区别。 新闻稿 华中科技大学学者制造出一种分级结构的超材料织物，穿上它可降温近5 ℃评论：华中科技大学陶光明团队与多个科研单位交叉学科创新，突破性地研发了一种具有形态分级结构、可大批量制备的光学超材料织物（简称超材料织物），相较于白色棉织物，该织物对人体体表降温近 5 ℃，具有优异的可穿戴性，并与整个纺织行业相兼容，适合大规模推广制备和产业化应用。基于辐射制冷的原理和形态分级的设计理念，团队提出了一种形态分级结构的超材料织物，根据织物空间结构、纤维结构、以及纤维内部纳米结构，在不同空间、不同尺度上进行分级，形成了一种宏观有序、微观随机的形态学分级体系。根据该结构设计，将从太阳辐射波段到中红外波段 （0.3-25 μ m） 的光谱分为三段，交由超材料织物中的不同级次响应，最终实现紫外、可见－近红外及中红外波段的宽光谱精准调控，有效避免不同波段光谱的串扰，优化光谱响应效率。研究团队将光学超材料技术与批量纤维制备技术相结合，选用绿色环保、生物可降解的聚乳酸为纤维原料，获得均匀连续地超材料纤维。在此基础上，进一步利用纺纱织造和层压技术，得到的超材料织物在太阳光波段 （0.3-2.5 μ m） 具有 92.4% 反射率、在中红外波段 （8-13 μ m） 具有 94.5% 发射率，并且具有低成本、绿色环保、可产业化等优势。经严格的测试，在无源条件下，超材料织物可实现全天低于环境温度 2-10 ℃的良好制冷效果。借助大气透明窗口 （8-13 μ m） 增强热量与外部寒冷空间的热交换，并对整个太阳辐射波段 （0.3-2.5 μ m） 实现高效的阻挡。在正午时段的模拟人体皮肤测试中，相较于同色的商用织物（棉、氨纶、雪纺、麻），超材料织物下的模拟皮肤温度可低 5-7 ℃。在对汽车模型的降温测试中，覆盖超材料织物的模型内部温度相较于市售车罩可降温 27 ℃，相较于无织物覆盖的模型可降温 30 ℃。 新闻稿 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"塑料镜头制造 第七章：性能检测","slug":"塑料镜头制造 第七章：性能检测","date":"2021-07-15T10:00:00.000Z","updated":"2021-12-04T11:32:05.727Z","comments":true,"path":"LensMaking_C7/","link":"","permalink":"https://faster-than-light.net/LensMaking_C7/","excerpt":"镜头组装完成后，要通过各种检测才能出货。其中包括光学性能检测，外观检测和各种信赖性测试。其中光学性能检测主要检测产品的光学性能，包括镜头的MTF，杂光；外观检测主要检测产品的外观，包括镜头表面及内部的各种缺陷和尘埃；信赖性测试主要测试镜头在长时间各种可能的环境中使用后依然能保证其功能。我们本章主要说明光学性能检测和外观检测部分，下一章重点关注信赖性测试。","text":"镜头组装完成后，要通过各种检测才能出货。其中包括光学性能检测，外观检测和各种信赖性测试。其中光学性能检测主要检测产品的光学性能，包括镜头的MTF，杂光；外观检测主要检测产品的外观，包括镜头表面及内部的各种缺陷和尘埃；信赖性测试主要测试镜头在长时间各种可能的环境中使用后依然能保证其功能。我们本章主要说明光学性能检测和外观检测部分，下一章重点关注信赖性测试。 光学性能检测一颗镜头生产出来后，主要要检测其各项光学指标是否和设计一致，其中包括焦距EFL，法兰距FFL，F/#，各种像差参数如畸变，色差，场曲，色散等，镜头的CRA，以及最重要的镜头调制传输函数MTF，包括各个视场的MTF以及离焦曲线。 镜头光学性能检测设备从测试需求角度可以分成两种： 用于精细检测的研究型设备，这种设备可以完整地以很高精度和解析度测试一颗镜头的各种参数，但是速度较慢，主要用于设计验证等工作。代表性设备有Trioptics公司的ImageMaster® HR系列等。 用于量产检测的快速测试设备，这种设备可以快速测出一颗镜头某些视场的MTF值和一些关键参数，主要用于量产产线的光学性能100%测试。代表性设备有Trioptics公司的ImageMaster® Pro系列等。 一个公司根据自己的产能情况只需要相对较少数量的精密检测设备，同时配备大量的量产检测设备（对于头部企业来说，可能会有几百台）。 下面用Trioptics公司的这两个系列的设备，结合一些其他公司的设备为例说明两种测试设备的设备结构，原理，性能和使用场景。 精密测试设备Trioptics ImageMaster® HR Trioptics ImageMaster® HR系列测试设备是Trioptics公司开发的用于镜头光学性能测试的设备，该系列设备具有相当多的功能，可以实现精确的光学测试，同时包括了很多不同型号和适配模块，用以满足客户对于不同应用镜头的测试（不同大小的镜头，不同视场角，不同应用波段，有限距/无限距等）。系列中包含了HR VIS（可见光波段普通版本），HR UltraPrecision（超高精度款），HR MAX（宽光谱测试版，近紫外到近红外），HR MAX IR（近紫外到深红外），HR TempControl（测试镜头温度可调，-40℃到120℃）。同时该公司提供对应软件，可以很容易实现自动化测试流程和输出报告。 以基础版本的ImageMaster® HR为例，该设备可以测试：轴上/轴外视场MTF，EFL，畸变，场曲，色散，像散，CRA，点扩散函数，杂光（Veiling glare)，离焦曲线，视场角，FFL（法兰焦距），相对照度（RI）。该设备是手机镜头光学制造企业的主要研究型测试设备型号，用来对镜头进行各种精密测量。 设备结构设备的基本结构如下两图所示，两张图的左侧都是展示了实际设备形态和主要结构，右侧是展示了测试原理： 1）标板（Target）模块：标板模块包括光源，标板，平行光管和摆臂。光源的作用是提供测试用波长。标板的作用是作为物存在，一般是由某个光源照射的一个目标物（透明狭缝/十字/小孔，标板其他部分不透光）。平行光管的作用是提供无限物距测量，用以投射标板图像，如果是有限物距测试，直接使用标板和光源放置在需要的物距位置；摆臂的作用是可以进行不同视场角的测量 2）样品承台和被测样品镜头：样品承台提供镜头的放置平台，该平台可以旋转，结合摆臂可以满足测量镜头不同视场角不同位置的光学性能； 3）图像分析模块：在最下面，主要由一个CCD相机和Relay Optics组成，这个Relay Optics一般是一个显微镜的物镜镜头。右侧的图展示了测量轴上和轴外MTF时摆臂，被测镜头，图像分析模块的状态。这种测量方式就是模拟镜头的实际使用状态，物体在物方，成像到成像面，然后被读取。 4）其他各种精密移动模块，驱动设备 测试原理MTF测试 Trioptics ImageMaster® HR使用的MTF测试方法基于ISO 9334标准。根据傅里叶综合，一个狭缝可以被认为是所有强度=1的频率的和。这个狭缝通过被测镜头，由于各种像差的存在会模糊变宽，展示出来的就是线传递函数（Line Spread Function ，LSF），LSF经过一维傅里叶变换后就是MTF。所以MTF测试使用的标板可以是一个在不透光的板子上开一个透光狭缝。但是更多的情况是使用十字（cross-hair）作为标板，这样可以同时得到S和T方向的MTF值。有些时候也会使用pinhole（小孔），直接得到点扩散函数（Point Spread Function，PSF），二维傅里叶变换既得到OTF，取强度值既MTF信息，这种情况得到的信息很多时候太多了，并不是很需要，所以一般十字型就足够进行分析了。 通过摆臂和样品旋转平台进行扫描式测试，Trioptics ImageMaster® HR就可以得到镜头不同位置，不同视场角的MTF性能。 EFL和畸变测试 首先测量某个选定频率的轴上MTF，确定近轴焦平面，然后摆臂开始根据设定扫描选定的视场角，在每个视场角，测量像高，EFL由h/tan(α)得出，然后通过拟合确认阿尔法=0时的EFL，最后根据ISO 9039:2008描述的方法，计算近轴焦距和轴上焦距确认畸变值。 离焦曲线测试 离焦曲线测试只需要上下移动传感器模块，在成像面一定距离内再进行多次测试。 相对照度（RI）测试 根据ISO 13653:1996，设备测试轴上光强和轴外光强，最后计算相对照度。 场曲 场曲可以使用离焦曲线的结果计算得出。 主光线角CRA 在不同视场角，平行光管发出的平行光通过被测镜头，达到像面，传感器通过扫描最强光线的位置，传感器的纵向和横向移动可以计算出主光线和光轴的夹角既CRA。 F/# F数定义为EFL和入瞳直径的比值，ImageMaster®系列设备使用ISO-517描述的方法，首先测量EFL，然后样品翻转，使入瞳朝向传感器侧，传感器对焦在入瞳上，测量入瞳的大小。通过选择合适的配合传感器的镜头，即使入瞳位置在被测镜头内部很深的位置，也是可以测量到。 色差 ImageMaster®设备有着不同的滤光片，通过更换滤光片，确定镜头在轴上不同波长下的像面位置，以确认轴向色差（axial），如下图；通过不同视场角下的成像位置，确认横向色差（Lateral）。 其他设备Trioptics除了ImageMaster® HR系列，也有横向形态的MTF测试设备等，Optikos公司也有自己生产的MTF测试设备LensCheck。但是对于手机类镜头，ImageMaster® HR系列是行业共识的标准设备，所以基本上主要的制造企业都配备了该型号设备。 量产测试设备Trioptics ImageMaster® PROImageMaster® PRO系列测试设备是用于进行量产MTF检测的设备，对比ImageMaster® HR系列，ImageMaster® PRO只能测试某些设定点的MTF，但是这些点的MTF值可以同时测试。经过多年的发展，该系列存在用于测试普通手机镜头的最初的Pro 1型号一直到最新的Pro 10等型号，PRO X Compact（小型化型号），PRO 10 Wafer（用于测试晶圆级镜头WLO），ProSort 10（测试+镜头挑选自动化款），FingerPrint（小有限物距测试，主要用于指纹识别镜头测试，FOD (Finger-on-Display). ）。HR设备进行一颗镜头的MTF多个角度扫描完整测试可能要进行30分钟，但是Pro 10可以同时测试27个视场的MTF，每小时可以测试2700颗镜头。 ImageMaster® PRO可以测试不同频率的轴上，轴外MTF，最佳MTF位置，EFL，FFL，场曲，像面倾斜，离焦曲线，对焦位置，像散，畸变，相对照度等。根据产品模组的需求以及模组端制程选择，会测量不同的项目。最主要的还是MTF离焦曲线，确认镜头在像面一定范围内性能达标。 设备结构下面两张图展示了Pro 10设备的结构和测试原理，对比ImageMaster® HR系列，Pro系列的测试方式并没有本质区别，但是可以说是“反过来”的，主要包括 1）测试标板和光源：作为测试的物存在，但是不同于HR系列，Pro系列的测试标板和光源是在镜头的像面侧； 2）测试平台和被测镜头：测试平台由可动承台和镜头托盘组成，两者三点接触，由于是用于量产测试，所以托盘是一个可以放置多颗镜头（Pro 10是148颗），承台在测试中可以在x,y方向移动，用以对不同的镜头进行测试； 3）测试传感器模块：由固定这些传感器的穹顶，传感器相机，Telescope和用于准直的自准直镜组成。 原理Pro系列的MTF测试原理和HR系列相同，同样是使用十字型分划板作为标板（由于用在透射条件，所以使用负性分划板，紫外熔融石英作为基底[紫外熔融石英可以从红外到紫外波段都具有出色的透射率]，将基质全都镀上铬金属[挡光]，但是将图案留空。十字线的位置既为测试的像高/视场角位置）。 首先测试托盘放置到位，设备开始对每个镜头进行测试，每个镜头MTF测试完成后，软件会进行一些倾斜补偿，更好地反应出真实MTF。得到MTF后，根据设备的设定，设备会标注出每个镜头是否通过测试门槛，也可能是把镜头性能分成A，B，NG，这取决于各公司需求。这些信息会记录在数据库中，最后会用这些信息进行镜头分拣。 镜头分拣一般单独使用一台机器进行，量产MTF测试完成后，把托盘取出，放入镜头分拣设备，该设备会读取Pro 10输出的数据，把OK的镜头放入一个托盘，NG的镜头放入一个托盘。Trioptics也有自己的全自动设备ProSort 10（测试+镜头挑选自动化款）。 其他设备镜头的量产使用ImageMaster® PRO系列测试机台已经是行业标准，但是各个光学制造企业也会使用自己公司开发的产品，或者使用其他公司的测试。主要原因是价格，Trioptics的产能，以及技术原因。 1）Trioptics Pro系列的设备价格较高，有些公司会生产自己的替代性测试机台或者使用其他品牌的测试机台，如果终端客户不要求使用Pro系列进行测试，或者本身镜头是标准品，生产企业自己制定测试标准的情况，同时Pro系列的设备没有产能，会使用其他设备测试产品。实际上，通过标准的合致流程，这些设备也能实现和Pro系列几乎一样的性能。 2）Trioptics作为一家德国公司，设备生产能力也有限，前几年光学企业大规模扩大生产规模的时候，Trioptics的产能无法满足这些企业的需求，企业不得不使用各种设备区满足量产检测需求。 3）Pro系列是为了手机镜头中的大类标准镜头开发的，标准款可以处理的视场角&lt;100°。同时，设备最多只能使用27个telescope，再多就放不下了。所以，对于有一些广角镜头或者需要更多测试点的情况，Pro系列无法满足，需要使用类似于HR系列的测试原理，或者增加设备大小（覆增大相机固定穹顶用以覆盖更大的视场）。所以，有一些量产检测设备是基于HR系列的测试原理开发的，既在被测镜头物方布置标板，像方布置传感器模块。这种设备的好处一个是可以布置更多的检测点，更自由的覆盖更多的视场范围，也包括更便宜的价格，因为只需要在被测镜头像方布置传感器，所以只需要一个传感器，而Pro系列有27个传感器相机。当然这种方式也会有精度上和测试速度上的损失。 不过，这些年Trioptics公司也在持续开发适用于现阶段各种应用条件的测试设备，不但是面向手机镜头，还包括逐渐流行的AR，VR类光学产品。比如Trioptics推出了用于VR显示镜片量产检测的ImageMaster® PRO VR和用于AR光学组件检测的ImageMaster® Lab AR。 杂光检测杂光的评价相对主观，各公司有自己的评价标准，所以杂光测试行业内并没有标准化设备，各个企业根据内部测试需求及外部不同客户的需求，使用不同的设备和标准。设备原理比较简单，既在镜头的被测视场内或者视场外建立强光光源（点光源，线光源灯），在被测镜头像方设置传感器测试杂光强度。有一些标准也定义了杂光测试和计算方法，比如ISO 9358:1994(en), Optics and optical instruments — Veiling glare of image forming systems — Definitions and methods of measurement同样，类似于MTF检测，杂光检测设备也可以有研发使用的精密测试设备和量产使用的量产测试设备两种形态。 精密测试设备：单镜头测试，可以用摆臂带动一个强光源扫描需要测量的镜头视场范围 量产测试设备：在测试视场点布置一系列强光LED，测试时根据测试需求同时或者分时打开。 外观检测镜头的外观检测主要检测包括镜头的所有外表面以及各个镜片内表面，缺陷包括划伤，灰尘，脱模，溢胶，膜裂，脏污等等。这些外观不良可能会造成很多问题，包括信赖性问题（比如脱模可能造成镜头开裂），模组传感器污染（镜头上的灰尘在模组组装时掉落在传感器上），美观损失（镜头上表面缺陷从外面可以被看到）。 主要检测方法有人工和自动化，近年来由于技术进步，标准更加严格，全自动化的外观检测逐渐在各镜头生产企业占据更多的比重，但是人工检测或者抽检依然不可或缺。自动化测试设备主要是工业机器视觉范畴，使用不同的光照条件和镜头去发现镜头内外的外观不良，比如对于镜头内侧，可以使用变焦镜头对焦到镜头内部镜片的各个表面，发现灰尘。 下图展示了舜宇仪器公司生产的一款镜头外观和内尘检测设备和该设备机器视觉的拍下来的实际照片。 OQC和出货最后镜头还会经过OQC的抽检检测等标准化质量监控体系流程，最终完成包装和出货。 模组入料检测最后简单对模组入料检测进行一些说明，因为镜头制造企业是输出镜头给下游模组厂，下游的标准（模组厂和终端客户）最终决定了镜头厂的标准。理论上，只要模组入料完成，就代表这一批次镜头模组厂接受了，后面如果出了问题，就不完全是镜头厂的问题了（比如保存不当）。IQC是划分了镜头厂和模组厂对镜头的品质的管理的所有权。 镜头厂的OQC和模组的入料IQC会进行MTF抽检，也会使用Trioptics ImageMaster@ Pro系列产品，测试标准会经过终端客户，模组厂和镜头厂的共同确认，一般镜头厂的OQC和模组端的IQC检测各视场的OK/NG阈值会比镜头厂的生产MTF全检检测阈值要低一点，把测试误差和波动性考虑进去。 模组IQC也会进行外观检测，使用和镜头厂出货标准同样的标准。 一般模组厂会有镜头厂的驻场FAE或者镜头厂的专门FAE代表，如果有问题可以及时以镜头厂立场进行交流并协助模组厂解决问题。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"塑料镜头制造","slug":"塑料镜头制造","permalink":"https://faster-than-light.net/categories/%E5%A1%91%E6%96%99%E9%95%9C%E5%A4%B4%E5%88%B6%E9%80%A0/"}],"tags":[{"name":"镜头","slug":"镜头","permalink":"https://faster-than-light.net/tags/%E9%95%9C%E5%A4%B4/"},{"name":"专题","slug":"专题","permalink":"https://faster-than-light.net/tags/%E4%B8%93%E9%A2%98/"}]},{"title":"光学新闻 20210710","slug":"OpticsNews20210710","date":"2021-07-10T09:00:00.000Z","updated":"2021-12-04T11:32:05.719Z","comments":true,"path":"OpticsNews20210710/","link":"","permalink":"https://faster-than-light.net/OpticsNews20210710/","excerpt":"本周五篇光学新闻： Prophesee获得小米，韦豪创新， 创新工场投资 — AT&amp;S实现世界上最小的照相机 — Fraunhofer ENAS开发了用于集成到手机中的1g光谱仪 — 光学活体组织检查可以实时发现肺部肿瘤 — 起拍价16.66亿，评估价23亿多，淮阴一半导体项目破产拍卖","text":"本周五篇光学新闻： Prophesee获得小米，韦豪创新， 创新工场投资 — AT&amp;S实现世界上最小的照相机 — Fraunhofer ENAS开发了用于集成到手机中的1g光谱仪 — 光学活体组织检查可以实时发现肺部肿瘤 — 起拍价16.66亿，评估价23亿多，淮阴一半导体项目破产拍卖 Prophesee获得小米，韦豪创新， 创新工场投资评论：Prophesee是一家提供神经视觉解决方案的公司，具体说是AI光学传感器公司，传统图像传感器是frame base（基于帧）的，Prophesee的传感器是event base（基于发生事件）的。在0620光学新闻中也介绍过这家公司。这次该公司宣布获得小米，韦豪创新， 创新工场投资，创新工场是国内的头部投资机构，小米不用多说，韦豪创新是韦尔半导体的投资公司，韦尔半导体是现在OmniVision的母公司。Prophesse已经获得北美，欧洲和日本的大笔投资，这次又获得了中国的投资，看起来技术上有一些拿得出手的东西。 新闻稿 AT&amp;S实现世界上最小的照相机评论：奥地利公司AT&amp;S和OSRAM合作，使用 ECP(Embedded Component Packaging) 技术实现了一个10万像素，1mm²大小，重 1 gram的照相机。AT&amp;S是一家开发PCB技术的公司，这次该公司通过NanEye项目和OSRAM合作，使用ECP技术，这种技术可以把主动或者被动元件集成到覆盖式基底当中，比如高级PCB当中。意思是，这些元件不是在PCB上面，而是在PCB里面。 新闻稿 Fraunhofer ENAS开发了用于集成到手机中的1g光谱仪评论：Fraunhofer ENAS是德国夫良和费大学的一个学院，Fraunhofer Institute for Electronic Nano Systems (ENAS)纳米电子学院。该团队目标是把这个光谱仪的量产价格降低到1欧元左右，传统的红外光谱仪一般都重几公斤，并且价值上千欧元，不过Fraunhofer毕竟是学院，实现产业化的道路还是有一段要走的。 新闻稿 光学活体组织检查可以实时发现肺部肿瘤评论：法国公司 Mauna Kea Technologies公司开发的Cellvizio平台可以实现恶性肿瘤识别，该设备使用confocal laser endomicroscopy(nCLE)（激光共焦内窥显微镜）实现。在小范围的26个潜在患者的检测实验中，该设备可以更快得到检测将诶过。该设备发现了有肿瘤的23个患者中的22位。 新闻稿 起拍价16.66亿，评估价23亿多，淮阴一半导体项目破产拍卖评论：扬子晚报网7月9日讯（记者 朱鼎兆）号称年产 24 万片的 12 吋晶圆，填补中国传感器自主芯片设计、制造空白的淮安德淮半导体有限公司曾在淮安市淮阴区刮起一阵“芯片”旋风。宣称总投资450亿，当初作为招引的明星项目如今已是“凤凰脱毛”：破产并已进入资产处置环节。2021年7月6日，德淮破产管理人在京东拍卖发布竞买公告，将以评估价23亿余元拍卖德淮半导体有限公司整体资产（全部动产和不动产，不含芯片成品和芯片原材料）。记者在京东拍卖平台注意到，截至9日上午10时许，无人报名竞拍，也暂无优先购买权人，但该拍卖信息已有8000多人围观，70人关注提醒。据公开资料显示，德淮半导体成立于2016年1月，上海码扬与淮安市淮阴区合作，成立了公司首个国内项目——淮安德科码，之后更名为德淮半导体。项目总投资450亿元，其中，一期投资120亿元，主要产品是定位于千元机的CIS（图像传感器）芯片产品，但是根据《淮安市2020年重大项目投资计划》显示，截至2019年底，德淮半导体项目仅实际投资46亿元。 根据拍卖清单显示，此次拍卖的德淮半导体有限公司整体资产包含生产车间、办公楼等19处房屋建筑物以及171265.90㎡的工业用地，还有机器设备、电子设备、车辆、原材料等物品。 再加上近期清华紫光破产重组，行业洗牌开始了，希望这次洗牌后是一个更加健康的中国芯片行业。 新闻稿 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"塑料镜头制造 第六章：组装","slug":"塑料镜头制造 第六章：组装","date":"2021-07-06T13:00:00.000Z","updated":"2022-01-05T13:57:15.093Z","comments":true,"path":"LensMaking_C6/","link":"","permalink":"https://faster-than-light.net/LensMaking_C6/","excerpt":"在前面几章我们已经了解了镜头中各个零部件制造的关键步骤和参数，下一步就需要把各个零部件组装在一起，这就是镜头组装。镜筒组装的最终目的是完成整个镜头的制造，实现光学性能，同时达到该镜头需要的外观及信赖性要求。前面几章介绍的材料，模具，注塑成型，镀膜和其中包含的各种检测工序都是为了最大程度的实现部品的高精度和部品之间高均一性，但是，部品依然是不完美的，存在一定公差。在镜头组装的环节，这些公差会相互作用，降低镜头光学品质和信赖性。通过在镜头组装阶段采用各种方法控制这些公差，最终可以实现高品质，高良率的镜头。","text":"在前面几章我们已经了解了镜头中各个零部件制造的关键步骤和参数，下一步就需要把各个零部件组装在一起，这就是镜头组装。镜筒组装的最终目的是完成整个镜头的制造，实现光学性能，同时达到该镜头需要的外观及信赖性要求。前面几章介绍的材料，模具，注塑成型，镀膜和其中包含的各种检测工序都是为了最大程度的实现部品的高精度和部品之间高均一性，但是，部品依然是不完美的，存在一定公差。在镜头组装的环节，这些公差会相互作用，降低镜头光学品质和信赖性。通过在镜头组装阶段采用各种方法控制这些公差，最终可以实现高品质，高良率的镜头。 镜头组装流程及设备讨论公差控制前，我们先简单介绍组装的基本流程和设备。镜头组装的基本零部件是镜筒，镜片，隔片和隔圈。镜筒承担着整体支架的作用，用于承载所有其他零部件。由于体积限制，制造工序的优化需求，手机塑料镜头的组装相对比较简单，基本都是从一个方向把所有零部件按顺序放入镜筒。如下图所示，镜筒前端朝下平放，镜片，隔圈，隔片，压圈等被按顺序组装进入镜筒，然后点胶固定。根据镜头具体设计不同，也会有从镜头前端组装，或者从镜头两侧分别组装的方式（先组装完一侧，然后镜筒翻转，从另一侧继续组装。该视频是韩国KIT公司展示镜筒组装设备的视频，其中展示了零部件组装和点胶固定的流程。 镜筒排盘组装的第一个步骤是进行镜筒排盘，既把镜筒排布在组装托盘中。镜筒生产出来后的传送托盘一般为塑料托盘，主要用于转运镜筒，精度较低，不适合用于组装，组装时需要把镜筒放置入高精度组装托盘中。组装托盘一般会采用精密加工的方式进行加工，以达到高度的平整度以及光洁度。用以保证组装精度及镜筒表面光洁度。 镜片组装镜片，隔圈，隔片，压圈组装都是由自动化完成，主要流程为排盘-&gt;图像识别-&gt;吸取-&gt;图像识别-&gt;旋转/移动-&gt;组装。 1）首先这些零部件也会经过排盘，镜片会由简易的塑料传送托盘中被转移到组装托盘中，用以保证被吸取时的平行度。隔圈，隔片，压圈会被确认朝向后，放置入组装托盘中等待被吸取。 2）图像识别系统会定位待组装镜筒的位置和旋转角度，镜片/隔圈/隔片/压圈的位置和旋转角度 3）识别后，由吸嘴移动到镜片/隔圈/隔片/压圈上方吸取零件 4）吸嘴再次移动到一个图像识别照相机上方，确认零件在吸嘴的位置和角度然后根据设定，把零件相对于镜筒的角度进行一定旋转（为什么要进行旋转我们在后面良率控制会进行解释）并移动到镜筒上方 5）吸嘴下压组装进镜筒。 这个过程中精度控制十分重要，同时有一些设备也会有同心度检测，如果发现组装偏移，下一个部件的组装就会略过这个镜头，不再进行下一个阶段的组装。 固定最后的压圈组装完成后，会进行整体的固定工序。这一步的实现方式主要是通过点胶。胶水的种类主要有UV胶（点胶完成后使用UV光照射固化），热固胶（通过提高温度固化），双固化胶水（点胶完成后先进行UV照射，部分固化，再通过烘烤提高温度，彻底固化，优点是在刚组装好后就可以进行部分固化，避免了移动带来的镜片位置变化，同时又通过热固定实现了最终的高牢固度）等。 设备整体设备分为流水线式组装机和一体式组装机。 流水线式组装线：是流水线形式的设备，每一个单台设备实现一个或者两个单一步骤，比如第一台机器负责镜筒排盘，第二台机器负责组装镜片1到镜筒，第三台机器负责组装隔片1到镜筒，以此类推，最后一台机器负责点胶固定。流水线式的组装UPH（UPH，unit per hour）较高，每台机器各司其职，单独开发调试。但是流水线式的组装设备，组装托盘由操作员在各设备中进行移动或者是在设备中通过传送带或者传送机构进行传送，这个过程中会产生可能的震动，造成镜片位移，造成镜头组装品质下降，所以要特别控制传送中产生的震动。下面两张图示韩国KIT公司生产的组装产线，可以看到每一台机器都可以组装一个镜片加一个隔圈/隔片/压圈，以此类推。下面展示的两种设备的区别很小，第一张图是人工进行镜头在设备到设备间的传送，第二张图是完全自动化从第一台机器一直传送到最后一台机器。 一体式组装机：一台设备形式，所有物料在一台机器内，这台机器包含了镜筒排盘，零件组装和固定所有工序。优点是非常适合试做阶段，同时由于镜筒托盘进入机器后不会再次移动，不会产生由于镜筒托盘移动产生的位移，组装时设备稳定性好。缺点是一体式组装UPH较低，同时组装的吸嘴为了配合不同物料可能有多个，成一列分布。 组装设备相关参考公司网页：韩国Zeroneco，鸿辅科技，AKIM等 MTF良率控制手机镜头组装后要进行光学性能检测，外观检测和信赖性测试，通过这些检测的镜头才能出货，未通过的镜头为不良品，会被废弃。手机镜头整个生产流程上有多道良率分析，成型良率，镀膜良率，组装后镜头光学性能良率，组装后镜头外观良率等。这里我们主要讨论组装后光学性能良率控制，或者称为MTF良率。 良率控制的关键是了解公差，公差控制/补偿以及检测手段，既了解当前零部件有哪些公差，这些公差是如何分布的，是如何作用到光学性能上的，有哪些手段可以控制，调整，补偿以及检测。 公差及对成像的影响首先我们可以把公差分为两组，一组为零件本身的公差，一组为零件和零件相互作用可能产生的公差。这些公差都会降低光学性能。（我们在这里尝试较少讨论公差具体会如何影响光学性能，比如具体时间如何影响MTF等，更多的从如何做一个更接近设计图纸的镜头去思考这个问题）。 零件本身的公差：镜片中厚，镜片法兰厚度，镜片外径及圆度，镜片面间偏心，镜片面型，镜筒内径及圆度，隔圈厚度。这些公差的分布都是来源于零部件制造，模具到模具之间，模具的每个穴之间，公差的具体值不同。 零件之间的公差：镜片之间的组装偏心，镜片之间的倾斜，镜片之间的空气间隙，镜片外径到镜筒内径之间的距离。这些公差的最终分布取决于组装流程的参数控制。 偏心控制是塑料镜片生产中的最重要的课题之一。 公差控制及补偿对于零件本身的公差，控制方式自然是尽量把零部件制造的符合设计，收窄分布。需要注意的是，公差永远无法完全消除，降低公差在逐渐接近极限的过程中，会极大地增加成本。 在本章，我们假设我们的零部件已经达到设计公差，此时这些零部件是不完美的，由于大部分是注塑成型零件，这些零部件模具和模具之间，穴与穴之间都是有轻微不同的。我们重点讨论如何通过零部件之间的搭配和镜片旋转搭配来实现最终的光学性能提升。对于如何通过设计，在设计阶段更好的实现后道制程的公差控制和公差分配，我们会在第八章再去讨论。 零部件搭配我们首先用一个例子说明零部件搭配的概念，假设我们一批镜筒和镜片，他们都是是由两穴模具制造出来的。镜筒内径和镜片外径的设计值都是5mm，公差±2um。对于镜筒，1号穴的内径成型后稳定为4.999mm，2号穴的内径成型后稳定为5.002mm。对于镜片，1号穴的内径成型后稳定为5.001mm，2号穴的内径成型后稳定为4.998mm。可以看到，如果我们就是随意去组装的话，1号穴的镜片如果装入1号穴的镜筒，大一些的镜片对小一些的镜筒，镜片会产生较大应力，而如果2号穴的镜片装入2号穴的镜筒，小一些的镜片对大一些的镜筒可能在里面会有位移。但是如果1号穴的镜筒和2号穴的镜片组装，2号穴的镜筒和1号穴的镜片组装，那么两种的组合都可以实现很好的最终结果。 类似的例子有： 1）法兰厚度搭配，L1镜片法兰偏厚，可以用L2镜片法兰偏薄的和其配合组装，用以保证镜片间的空气间隙。 2）面型搭配，两个不完美的镜片面型可能搭配起来会被混装产生更好一些的光学性能。 3）镜片偏心搭配，来自于不同的穴的镜片，偏心值不同，偏心方向不同（相对于镜片浇口的方向）。对于镜片偏心搭配，要结合镜片旋转组装来实现更好的性能。 镜片旋转搭配组装假设我们有一个2P的镜头，L1和L2都是由两穴模具生产出来的。 对于L1的镜片，来自于1号穴的镜片偏心为1um，光轴是偏向镜片料口方向，来自2号穴的镜片偏心为2um，光轴是偏向料口对侧方向。 对于L2的镜片，来自于1号穴的镜片偏心为1um，光轴是偏向镜片料口对侧方向，来自2号穴的镜片偏心为2um，光轴是偏向料口方向45°。 首先，要做的是穴的搭配，我们使用来自于1号穴的L1和来自于1号穴的L2进行组装，然后是旋转搭配。 如下图所示，紫色的是L1镜片，绿色的是L2镜片，其中镜片的机械重心是黑色圆点，镜片的光学中心是橙色圆点。对于L1-1和L2-1的组合，在组装时，L1会被旋转180°，和L2的光轴对准组装进镜片。对于L1-2和L2-2的组合，L1会被旋转135°，和L2的光轴对准组装进镜片。这样就保证了镜片的光轴是对准的。实际组装中，图像识别系统识别镜片的注塑料口确认镜片的旋转方向，然后组装吸嘴进行相应的设定角度旋转，再进行组装。 下图展示了未通过旋转组装的镜头的MTF离焦曲线和进行了旋转搭配组装后的MTF离焦曲线的区别。可以看到，不经过光轴对准组装的镜头在0视场MTF最高时，轴外视场MTF并未达到最高值，而是有各种偏移。通过光轴对准，可以消除这种影响。 旋转哪片或者哪几片镜片是要根据实际生产情况和公差分析决定。比如设计上，L6本身的偏心对镜头整体品质影响并不大，就可以不进行旋转。 在生产过程中，镜片的注塑成型会出现偏移，造成偏心的大小和角度发生变化，组装镜头品质下降，此时就需要根据镜头的检测结果，进行旋转角度的调整。 搭配的确认现代大规模生产中，对于一个7P的镜头，可能会有很多套模具，模具上根据镜片大小不同，可能从16穴到32穴不等。如此，有非常多的组合方式。如何快速地找到合适的搭配，提高镜头良率，是一项非常重要的工作，每个公司有自己公司的方法论和方法流程。比如尽量把各个零件生产的很好，用所有的1号穴进行组合，只进行旋转搭配。寻找搭配是在有限的时间内，找到尽量多的可以稳定生产的搭配。对于镜头的良率，从30%提升到80%非常有必要，可能需要10位各部门的工程师一起工作1个月时间；但是从80%提升到85%，可能需要这10位工程师再一起工作1个月，那么考虑综合经济效益，这些工程师会被指派其他任务，镜头良率优化暂停。 组装过程中检测有一些镜头的组装过程中也会进行偏心检测，对于照相机镜头等使用人工组装的镜头，组装中进行对心是非常常见的步骤，对于手机类镜头，由于需要达到很高的UPH，并不会进行动态的偏心检测和动态调整。这里的检测如图所示，主要是使用激光偏心测量的方式确认没有很大的偏心发生（比如镜片装倾斜），如果有很严重的组装倾斜发生，该镜筒就可以在后面的组装中被忽略不进行下一个镜片的组装，以节约成本。 镜头设计和组装镜头的设计以及公差分析对于镜头的组装至关重要，设计是和组装流程互相影响的，这里我们举一个简单的例子进行说明，具体的设计讨论会在第八章进行。 对于镜头的结构设计，镜片如何组装在镜筒中有多种设计方式，其中有堆叠式，扣合式和混合式。堆叠式既镜片的法兰一片一片叠合在一起，镜片外径和镜筒内径接触，这种方式镜片间的偏心位置可能不好控制，镜片和镜筒之间可能有空洞。扣合式是用镜片和镜片的法兰结构进行配合接触，用一个镜片去保证另一个镜片的相对位置，优点是组装较低依赖镜筒内径精度，镜片的精度较高，可以很好地控制对准，但是如果镜片到镜片之间的距离过大，这种方式无法实现，还是需要使用隔圈等进行堆叠组装。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"塑料镜头制造","slug":"塑料镜头制造","permalink":"https://faster-than-light.net/categories/%E5%A1%91%E6%96%99%E9%95%9C%E5%A4%B4%E5%88%B6%E9%80%A0/"}],"tags":[{"name":"镜头","slug":"镜头","permalink":"https://faster-than-light.net/tags/%E9%95%9C%E5%A4%B4/"},{"name":"专题","slug":"专题","permalink":"https://faster-than-light.net/tags/%E4%B8%93%E9%A2%98/"}]},{"title":"光学新闻 20210704","slug":"OpticsNews20210704","date":"2021-07-04T09:00:00.000Z","updated":"2021-12-04T11:32:05.719Z","comments":true,"path":"OpticsNews20210704/","link":"","permalink":"https://faster-than-light.net/OpticsNews20210704/","excerpt":"本周五篇光学新闻： II-VI推出高效多功能超透镜用于小型化光学传感 — MKS 收购化学制品公司Atotech — 屏下指纹识别技术公司Isorg C轮融资1600万欧元 — 新型OLED电极极大提升光效率 — Kopin开发用于AR的最高亮度绿色OLED显示屏","text":"本周五篇光学新闻： II-VI推出高效多功能超透镜用于小型化光学传感 — MKS 收购化学制品公司Atotech — 屏下指纹识别技术公司Isorg C轮融资1600万欧元 — 新型OLED电极极大提升光效率 — Kopin开发用于AR的最高亮度绿色OLED显示屏 II-VI推出高效多功能超透镜用于小型化光学传感评论：II-VI公司6月23日发布了一款基于自己公司IP的高效，多功能超透镜，用以实现小型化的光学传感。在一个应用中，这款超透镜可以准直VCSEL发出的光线并且进行分光。这个DOE或者超透镜实现的功能并不稀奇，需要关注的是现阶段各个半导体传感的制造型企业，在通过超透镜的技术，尝试向系统端进军，用DOE，超透镜，微透镜阵列，diffuser等取代模组厂的部分工作，直接提供一站式解决方案。 新闻稿 MKS 收购化学制品公司Atotech评论：MKS计划收购Atotech，总价为51亿美元。MKS是设备制造商，Atotech是化学制品和高级电镀技术开发商。据MKS公司CEO所述，两家公司的技术结合可以优化PCB interconnect，是实现下一代小型化和复杂化高级电路的重要技术。MKS的买买买之路一直在前进，2016年以大概9亿美元收购Newport。现阶段，MKS，Newport，Spectra-Physics，Ophir，ESI，ATOTECH共同组成了MKS集团。 新闻稿 屏下指纹识别技术公司Isorg C轮融资1600万欧元评论：Isorg是一家法国公司，致力于提供全屏幕屏下指纹识别技术。全面屏指纹识别的优势是可以不限位置进行指纹识别，也可以进行多指识别，大大增强了安全性。使用的技术是OPD（optical photodiode），在手机应用里，这层识别模组有0.3mm的厚度。这次的融资由Sumitomo化学和Mitsubishi领投，一家希腊公司和5家法国公司跟投。至今该公司已经总计获得4780万欧元的投资。近几个月，Isorg计划在亚洲建立一个新的公司，开发手掌大小的模组，开发血管识别模组等。通过视频可以看到，该公司已经在法国有了一个设备比较晚上的fab，下一阶段，还是要把自己的技术和产品卖向市场。 新闻稿 新型OLED电极极大提升光效率评论：密歇根大学的研究者开发了一种更高效的OLED，可以提供20%发光效率。这种新型的OLED主要是使用了一种超薄的透明银膜作为电极，以代替传统的ITO薄膜电极（indium tin oxide掺锡氧化铟）。这种电极价格不高也易于生产，很容易集成进现阶段的OLED生产技术中。OLED的内量子效率接近100%，意味着几乎所有的电能都被转化成了光能，但是它的外量子效率只有20%，只有20%的光可以被发出。在典型的PLED中，如果光线不是垂直发射出去的，就会在OLED中被反射，在这个过程中，由于内反射，波导效应等问题，光被损失掉了。科学家们使用各种方式尝试提升这部分效率，包括使用各种错综复杂的结构，有一些可能很大的增加成本，而且会和OLED的电路有冲突。这次的研究工作，科学家使用一层5nm的银膜，代替ITO电极层。这层银膜足够薄，可以几乎完全去除掉waveguide mode损失的光线。 感觉很有意思，如果这个可以真的大规模应用，OLED会进步一大截。不过不知道实际的工业界转换会遇到什么问题。传统OLED 的基本结构是在铟锡氧化物(ITO)玻璃上制作一层几十纳米厚的有机发光材料作发光层，发光层上方有一层低功函数的金属电极，构成如三明治的结构。如果替换成银，要是大规模生产，不知道这个成本增加会如何。不过对于极端依赖光效率的应用，使用这种技术肯定有很大的好处，比如AR等设备，希望越省电越好。但是电视机这些产品可以使用传统技术。 论文链接 Kopin开发用于AR的最高亮度绿色OLED显示屏评论：Kopin正在开发全世界首款用于AR的35,000nits的绿色OLED显示屏，这款显示屏是1280 x 1024 pixel，主要使用的是Kopin的双层OLED结构，以及一种正在申请专利的可以实现14bit高动态范围的像素结构及背板架构。这种高亮度，高动态范围显示屏可以让AR头盔可以在从黑夜到白天室外使用。Kopin正在开发100,000nits的显示屏。 新闻稿 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"光学新闻 20210626","slug":"OpticsNews20210626","date":"2021-06-26T10:00:00.000Z","updated":"2021-12-04T11:32:05.719Z","comments":true,"path":"OpticsNews20210626/","link":"","permalink":"https://faster-than-light.net/OpticsNews20210626/","excerpt":"本周五篇光学新闻： Laser Focus World文章：让超透镜变的更现实 — PhotonicSens公司单镜头3D成像模组 — Infineon，PMD和ArcSoft一起开发推出屏下TOF解决方案 — 中国科学家成功将光存储1小时 — 金属3D打印公司Seurat获得4100万美元B轮投资","text":"本周五篇光学新闻： Laser Focus World文章：让超透镜变的更现实 — PhotonicSens公司单镜头3D成像模组 — Infineon，PMD和ArcSoft一起开发推出屏下TOF解决方案 — 中国科学家成功将光存储1小时 — 金属3D打印公司Seurat获得4100万美元B轮投资 让超透镜变的更现实评论：Laser Focus World刊登了一篇文章：让超透镜变的更现实。文章介绍了超表面透镜的基本信息，性能优势，制程优势和展望。文章认为超表面透镜持续在一些应用中展现出比传统透镜更好的性能的潜力，这些潜在的可能性开始让工业界重视突破超表面透镜的制造挑战。多家大学的研究机构正在进行相关的研究，同时，工业界里Metalenz，Tunoptics，Lumotive是几家有代表性的公司。最著名的还是由哈佛大学超表面研究的创始人Capasso教授的实验室发展出来的Metalenz公司。 新闻稿 PhotonicSens公司单镜头3D成像模组评论：PhotonicSens公司是一家西班牙公司，该公司推出的主要产品就是只依靠单镜头进行3D成像（无红外光源）。该公司和高通合作，依靠该公司的apiCAM技术，推出的该款模组可以同时提供RGB图像和1.4MP（30fps）的深度信息。官网上信息没有说具体是如何实现的，公司声称“photonicSENS’ single Lens Depth Camera Technology combines our innovative optics &amp; sophisticated algorithms to enable cutting-edge 3D vision applications”是通过创新的光学技术和复杂的算法实现的。看着这颗模组的形态，感觉更多要依赖算法。这个不好说，希望后续有更具体的信息。下周的在巴塞罗那的 Mobile World Congress 2021 大会上，该公司会在**Hall 3 (3H52MR)**进行产品展示。 Infineon，PMD和ArcSoft一起开发推出屏下TOF解决方案评论：三家强强联手，一家作为高端半导体制造企业，一家作为TOF专家企业，一家作为高端算法企业，共同推出直接可用的屏下TOF整体解决方案，非常令人期待。新的方案将在今年的MWC上推出（6月28日到7月1日），并在2021年第三季度商业化。 新闻稿 中国科学家成功将光存储1小时评论：李传锋、周宗权研究组2015年自制光学拉曼外差探测核磁共振谱仪，专门用于稀土离子掺杂晶体的能级结构分析。依托该仪器，他们精确刻画了掺铕硅酸钇晶体光学跃迁的完整哈密顿量，并在理论上预测了一阶塞曼效应为零（ZEFOZ）磁场下的能级结构。近期，该课题组结合理论预言首次实验测定掺铕硅酸钇晶体在ZEFOZ磁场下的完整能级结构，并结合原子频率梳（AFC）量子存储方案以及ZEFOZ技术，成功实现光信号的长寿命存储。实验中，光信号首先被AFC吸收成为铕离子系综的光学激发，接着被转移为自旋激发，经历一系列自旋保护脉冲操作后，最终被读取为光信号，总存储时间长达1小时，且光的相位存储保真度高达96.4 ± 2.5%。“简单来说，我们就是用一块晶体把光‘存起来’，一个小时后取出来发现，它的相位、偏振等状态信息还保存得很好。”李传锋说，光的状态信息很容易消失，这个研究大大延长了保存的时间，也因此有望催生一系列创新应用。比如，将两台相距较远的望远镜捕捉到的光，保存后放到一起进行“干涉”处理，可以突破单个望远镜的尺寸局限，大幅提升观测的精度。量子U盘在全球卫星量子通信、甚长基线干涉天文测量系统等领域均具有广泛应用。这一成果将光存储时间从分钟量级推进至小时量级，满足了量子U盘对光存储寿命指标的基本需求。接下来，他们将通过优化存储效率及信噪比，有望实现量子U盘，从而可以基于经典运输工具实现量子信息的传输，建立一种全新的量子信道。 根据周宗权教授视频中介绍：光储存的第一步是慢光，慢光的关键在于人工调控介质的折射率，使光在介质中的传播速度降低。第二步是停光，把光场的激发转变成原子的激发，被俘获的光子的能量被晶体中的原子吸收，转化为原子振荡。2013年德国研究人员实现了60秒的停光，再长就信号失真了，这次中国团队再次刷新了记录。 论文链接 金属3D打印公司Seurat获得4100万美元投资评论：Seurat Technologies这次获得的是来自Capricorn’s Technology Impact Fund的B轮投资，A轮融资它获得了1350万美元由True Ventures的投资。Seurat公司在马塞诸塞州的Wilmington，公司根据法国后印象派画家Georges Seurat命名（乔治-修拉，画作有大碗岛的星期天下午等）。该公司开发的技术被称作Area Printing（区域打印），不同于以前的金属激光打印技术，该技术是通过2百万束激光聚焦在金属粉末上，每束激光的能量和脉冲长度都可以被控制，进而制造出打印元件。根据公司CEO，James DeMuth的评论：“我们给市场带来的是完全革命性的技术，想象从写字到印刷术的出现。”。 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"光学新闻 20210620","slug":"OpticsNews20210620","date":"2021-06-20T10:00:00.000Z","updated":"2021-12-04T11:32:05.719Z","comments":true,"path":"OpticsNews20210620/","link":"","permalink":"https://faster-than-light.net/OpticsNews20210620/","excerpt":"本周五篇光学新闻： 东芝推出新款固态激光雷达，扩展到交通基础设施监测领域 — Prophesee公司预测基于事件的传感器2030年会占据CIS市场的9% — 液晶+超透镜实现电控变焦 — 莱卡推出首款电话Leitz Phone 1 — 中国空间站巡天望远镜计划于2024年发射","text":"本周五篇光学新闻： 东芝推出新款固态激光雷达，扩展到交通基础设施监测领域 — Prophesee公司预测基于事件的传感器2030年会占据CIS市场的9% — 液晶+超透镜实现电控变焦 — 莱卡推出首款电话Leitz Phone 1 — 中国空间站巡天望远镜计划于2024年发射 东芝推出新款固态激光雷达评论：Toshiba发布了一款升级的固态雷达，实现最大200m的探测距离，高解析度。Toshiba宣称在同等大小芯片场景下，这款Lidar是世界上最小的一款。Toshiba希望该设备可以助力自动驾驶和交通监控。这款Lidar的关键点是小型化和新的sensor技术。从下图可以看出该Lidar确实对比起其他Lidar非常小，同时Toshiba继续升级了该公司的SiPM（silicon photo-multiplier (SiPM)）传感器芯片，使用感光元件间的绝缘沟槽代替原有的缓冲层，成功降低了75%的大小，并提高了50%的感光度（对比2020年7月的产品） 公司新闻稿 Prophesee公司预测基于事件的传感器2030年会占据CIS市场的9%评论：Prophesee公司看起来是一家AI光学传感器公司，传统图像传感器是frame base（基于帧）的，Prophesee的传感器是event base（基于发生事件）的。基于事件的image sensor每个pixel独立，如果这个pixel没有事件，它的数据不会被采集和传输。该公司已经融资了6800万美元，团队100+人。生产sensor主要是和Sony合作。该份调研可以说是自己给自己站台，不过基于事件的image sensor概念确实有很多应用场景。 液晶+超透镜实现电控变焦评论：康奈尔和三星高级技术研究所的科学家们结合超透镜和液晶实现电控变焦。使用的形式是液晶浸润的超透镜，在液晶上加上电压，即可改变液晶的折射率实现变焦，最多可以实现20%的焦距变化。理论上这个变焦和超透镜没什么关系，但是两种制程都是平面制程，这次的概念实现可以很大的扩展超透镜的使用场景。这可能是该研究最大的意义。 论文链接 莱卡推出首款电话Leitz Phone 1评论：莱卡推出首款电话Leitz Phone 1（由日本软银发布），主打照相，配有一颗1英寸传感器的2020万像素主摄，支持19mm超广角、24mm广角和152mm长焦。另外，手机背部配备一颗景深镜头，以及前置1260万像素镜头。这个硬件配置并没有什么特别,可能算是一款情怀产品吧。同时，莱卡推出了一款镜头保护盖的配件（非常困惑），或者说是“这是莱卡电话”配件。 新闻稿 中国空间站巡天望远镜计划于2024年发射评论：期待！根据中国科学院的网站文章：“在它搭载的第一代仪器中，占据最主要观测时间的是巡天模块。这是一个视野极为宽阔的相机，视场达到1.1x1.2平方度。在成像质量和哈勃望远镜相当的情况下，巡天空间望远镜的视场达到了哈勃望远镜的300倍。为了能够接收广阔视场的信息，巡天空间望远镜在巡天相机上安置了30块探测器，总像素达到25亿。其中18块探测器上设置有不同的滤光片，这使得它可以获得宇宙天体在不同波段的图像，带给我们彩色的宇宙样貌；另外12块探测器则用于无缝光谱观测，每次曝光可以获得至少1000个天体的光谱信息。 巡天空间望远镜在巡天模式下的观测每次曝光约为150秒，对于巡天中的每个观测天区会进行两次曝光。天文上一般以星等表示天体的明暗，星等越大表示天体越暗，每相差5个星等，天体之间的亮度相差100倍。天上的织女星大约是0星等左右，人眼能够看到最暗的恒星是6星等。巡天空间望远镜在总共短短300秒的曝光时间，就可以获得低至26星等左右（不同波段具体数值有差别）的天体图像，这要比人眼能够看到的最暗的恒星还要暗上1亿倍。在这样的观测深度上，研究者可以在每个平方角分看到30个左右的星系。在整个巡天周期里，巡天模块将会覆盖17500平方度的天区，是整个天空面积的40%，积累近20亿星系的高质量数据。” 巡天空间望远镜：将伴“天和”探太空 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"塑料镜头制造 第五章：镀膜","slug":"塑料镜头制造 第五章：镀膜","date":"2021-06-15T17:00:00.000Z","updated":"2021-12-04T11:32:05.728Z","comments":true,"path":"LensMaking_C5/","link":"","permalink":"https://faster-than-light.net/LensMaking_C5/","excerpt":"光学镀膜是一层或数层薄膜附着在光学零件表面上，用以改变其对光的反射或者折射，薄膜光学主要是研究光在薄膜间的干涉作用。常见的镀膜种类有镜面膜，增透膜，带通膜，半透半反膜等，更加复杂的镀膜会可以对于不同偏振态的光表现出不同的反射和透射数值等。本文将主要讨论在手机塑料镜头上最主要应用的增透膜（减反膜，AR Coating），不过基本上各种种类的镀膜的考虑都是一样的，只是因为功能不同名字也不同。除了手机镜头，滤光片等各种成像光学领域，光学镀膜广泛应用于显示屏制造，眼镜制造等领域。","text":"光学镀膜是一层或数层薄膜附着在光学零件表面上，用以改变其对光的反射或者折射，薄膜光学主要是研究光在薄膜间的干涉作用。常见的镀膜种类有镜面膜，增透膜，带通膜，半透半反膜等，更加复杂的镀膜会可以对于不同偏振态的光表现出不同的反射和透射数值等。本文将主要讨论在手机塑料镜头上最主要应用的增透膜（减反膜，AR Coating），不过基本上各种种类的镀膜的考虑都是一样的，只是因为功能不同名字也不同。除了手机镜头，滤光片等各种成像光学领域，光学镀膜广泛应用于显示屏制造，眼镜制造等领域。 塑料镜片镀膜种类和作用减反膜（AR）手机镜头使用最多的镀膜是减反膜（增透膜，AR Coating），更准确说叫可见光波段减反膜，主要作用就是降低可见光波段的反射率，增加可见光波段的透过率。多层镀膜的AR膜可以将透过率增加到99%以上。带通类膜可以算是增透膜的特殊种类：红外带通主要就是增强红外的透过率。可见光红外双波段带通就是尽量优化增强可见光+近红外（850nm或940nm）的透过率。可见光波段应用的镜片的红外波段一般不做特别的截止处理设计，因为截止带通主要是由滤光片进行，因为滤光片是平的，玻璃基底，在滤光片上实现带通功能更加方便高效。 在第二章：材料中，我们看到大部分光学塑料的透过率在90%左右，虽然也不错，但是对比一些玻璃可见光波段99%的透过率还是有很大差距。增透膜的作用很大，第一增加透过率可以很好地提升光学成像质量，第二，降低反射也可以同时非常好地降低杂光，现代手机镜头多至7片~8片的镜片间及镜片和非光学结构间的反射造成的鬼像和杂光非常严重，一些可以通过对光学面型及结构优化处理掉，另一些就需要尽量降低杂光能量，其中镀膜是重要的降低杂光方法。 颜色手机镜头为了美观，有一些会进行一些颜色处理，主要方式就是略微增加某个颜色的反射率，让手机镜头外观显现出某种颜色（或者不做特别处理，就使用优化后显现出来的颜色即可）。可以对单镜片进行这种处理，选择哪个镜片进行这种取决于从外面看到的效果。颜色算是AR镀膜的副产品。 防指纹，防刮膜这种膜镀在镜头最外面一片上用以疏水和防指纹。 总体上来说现代手机镀膜主要是AR膜，最上层防水防指纹，同时带有一定颜色。 镀膜设计本文会简单介绍一下镀膜设计，文章重点还主要是制造。Field Guide to Optical Thin Films里总结说的很好：基本上所有电介质光学膜的基础都是控制反射，透过率，光密度等参数都是副产品。（ Reflection control is the basis of essentially all dielectric optical coatings; and transmittance, optical density, etc., are byproducts of reflection (and absorption)。） 理论基础主要是菲涅尔方程，当光从一种折射率为n1的介质向另一种折射率为n2的介质传播时，在两者的交界处（通常称作界面）可能会同时发生光的反射和折射。菲涅尔方程描述了光波的不同分量被折射和反射的情况，也描述了波反射时的相变。 方程成立的条件是：界面是光滑平面，入射光是平面波，边际效应可被忽略。对于大部分光学讨论的范畴，S和P偏振光在界面上的反射可以描述为以下公式，同时反射R+透射T+吸收A=1： 折射率匹配膜最简单的AR镀膜是瑞利（瑞利散射那个瑞利）在1886年发现的。那个年代的玻璃镜片时间长了表面会出现污迹层，类似于油污的样子，是由金属和非金属化学反应产生的（可能是当年的玻璃纯度很差的原因）。瑞利在测试一些有轻微污迹层的镜片时发现这些镜片透过率比新的干净的镜片还要高。这层污迹层把原来的空气-玻璃界面分成了空气-污迹界面和污迹-玻璃界面。然后这层污迹的折射率在空气和玻璃折射率中间，每一个分别层的反射率都比空气-玻璃层的反射率低。 当光垂直入射时，根据菲涅尔方程r = (n1 – n2)/(n1 + n2)，带入一层界面：空气vs玻璃，以及两层界面：空气vs膜层vs玻璃就很容易算出两层界面的整体反射率降低了，这解释了瑞利遇到的现象。瑞利这种看到的这种增透作用主要是折射率匹配的原理，使用这种原理的有连续渐变折射率GRIN AR coating，不过本文不会详细讨论该种镀膜。 单层AR干涉膜干涉型减反膜是使用光的干涉原理，下面的左图很好地表达的什么是干涉型AR膜，当一束光入射一个薄层时，如果该薄层厚度被非常精确地控制，正好等于该光束波长的1/4，那么在上下个界面反射的光线互相之间正好有1/2波长的相位差，如果他们的强度还相等，那么他们就可以互相干涉相消。下图右图展示了更实际的情况，光线会在薄层中进行多次反射，最终形非常多的反射光线。 这种简单形式构成的镀膜的0°入射角的反射性能如下图(a)曲线展示的反射率曲线，由于只有一层薄膜，所以它只对一个波长的光是1/4波片。所以可以看到远离中心波长的部分反射率逐渐上升。同时，对于不同入射角，反射率同样逐渐上升。根据上面的场景，需要计算出r1和r2强度相等时的折射率n，选择近似这种折射率的材料，然后精确地制造这层薄膜。实际生产中，MgF2在玻璃和塑料镀膜中被广泛应用，折射率为1.38，使用物理蒸发式镀膜方式可以很好地附着在基底上。 多层AR干涉膜上面的单层镀膜根据相同原理，如果我们增加薄膜的层数，通过计算和优化，可以实现在更广的波长范围，更广的入射角的覆盖范围尽量降低折射率。如下图所示，两层的镀膜使用两种材料，可以实现如上图（b）所示折射率曲线，被称为V型镀膜，两层镀膜就可以把中心波长0°入射角的反射率降低到0。三层的镀膜可以实现如上图（c）所示折射率曲线，可以看到已经可以实现相对比较宽波段的反射率降低。 微结构镀膜在镜片表面实现特定的微结构，可以极大优化高入射角的镀膜性能，降低反射率。 镀膜仿真工具镀膜常用的仿真工具是 MACLEOD（Thin Film Center Inc.），可以很好地进行优化和分析。 镜片镀膜的方法和材料制造薄膜的主要技术是沉积技术（Deposition），将薄层沉积到衬底或之前获得的薄层的技术称为表面沉积，从大类上分主要是物理方法和化学方法，还有。这里的“薄”是一个相对的概念，但大多数的沉积技术都可以将薄层厚度控制在几个到几十纳米尺度的范围内，分子束外延技术可以得到单一原子层的结构。 物理气相沉积物理沉积技术就是使用机械方法，电动力方法，热动力方法在衬底上形成一层薄层，最简单的日常例子就是玻璃上雾或者汽车喷漆。这里的物理是相对于化学来说，是利用物理过程来沉积薄膜的技术，意思就是被沉积的物质和基底没有发生化学反应。而物理气相沉积（PVD: Physical vapor deposition）指的是膜材料（固态或者液态）被某种方式转化成气态，然后沉积在基底上再转化到固态的方法。常见的PVD方法有以下几种： 蒸发（Evaporation）：蒸发是将膜层材料加热，使材料蒸发雾化并沉积的工艺，根据蒸发膜层材料的熔点所选用的方法不同，主要有电阻蒸发、激光束蒸发、电磁感应蒸发，电子束蒸发等。 溅射（Sputtering）：这种工艺是通过溅射使涂层材料雾化而沉积涂层的工艺。当入射离子(或粒子)轰击靶材表面时，使靶材表面原子飞逸出来的过程称为溅射。它具有可溅射的材料广泛、沉积离子能量大、设备简单、工艺不复杂等特点，可用来沉积各种金属膜和氧化物膜。溅射有直流溅射，射频溅射，等离子溅射，磁控溅射等方法。 离子镀（Ion plating, plasma ion assisted deposition, PIAD）：离子镀又称等离子辅助物理气相沉积或离子气相沉积，是指被沉积物体（基底）在沉积前或 沉积过程中，受到高动能离子和非带电粒子的轰击，主要实现方式时使用离子源。1）沉积前的轰击是采用惰性气体等离子体(氩气)按溅射机理清洗表面，2）在沉积过程中，膜层原子和剩余的气体原子继续带着高动能轰击表面，这导致了基材与膜层原子在界面上的混合，从而增加了结合力， 改善了膜层结构。 分子束外延（Molecular-beam epitaxy）：在超高真空条件下，由装有各种所需组分的炉子加热而产生的蒸气，经小孔准直后形成的分子束或原子束，直接喷射到适当温度的单晶基片上，同时控制分子束对衬底扫描，就可使分子或原子按晶体排列一层层地“长”在基片上形成薄膜。 [参考：现代表面处理新工艺、新技术与新标准（金海波）] 化学沉积相对于物理气相沉积，化学气相沉积是使用化学方法将镀膜物质和基底反应生成薄膜的方法。根据发生的环境化学沉积分为化学气相沉积（CVD）和化学液相沉积，也包括原子层沉积(ALD)等方法。 塑料镜片镀膜：离子源辅助物理气相沉积从前面的镀膜方法可以看到，镀膜主要是把一种材料附着到另一种材料上，镀膜的牢固程度主要靠增加材料的动能。由于塑料材料的温度限制，镀膜环境基本要小于120℃，这使得普通的蒸镀等需要基底加热增加膜层牢固性的方法或者增加腔内温度的方法无法实施。所以塑料镜片的镀膜主要采用的是离子辅助式镀膜，镀膜机会装备有蒸镀的各种装置，也同时装备有离子源。其中蒸镀的加热设备使用哪种，取决于镀膜材料的熔点，其中像一些高熔点SiO2, TiO2等塑料镜片常用镀膜氧化物材料会使用电子束蒸发的方法，电子束能量密度高，可以将膜材加热至3000-6000度。而对于低熔点金属和氟化物，可以使用电阻丝蒸发的方法。如下图所示（图片来源Edmund），中间的E-Gun既电子束蒸发，左下的ION Gun为离子源进行辅助，增加膜材动能，离子源可以提供100-1000eV的能量（具体请参考实际参数）。同时，镀膜机器内部需要抽真空，保证没有其他非膜材分子在其中有干扰，保证膜材直接运动到基底上。 镀膜材料常用的手机镜片UV-NIR（400nm-1100nm）镀膜材料有 氟化物：AlF3, CeF3, Chiolite, Cryolite, GdF3, LaF3, MgF2, NdF3, PbF2, YbF3, YF3 氧化物：Al2O3, HfO2, Nb2O5, SiO2, TiO, Ti2O3, Ti3O5, TIO S, TiO2, Ta2O5, Y2O3, ZrO2 混合氧化物：Merck公司的Patinal®系列H1, H2, H4, H8, L5, M1, M2, M3, M5, ITO。比如H4材料是由氧化钛和氧化镧组成，最终形成LaTiO3 硫化物：ZnS 金属：Ag, Cr 疏水疏油：Merck公司的WR1, WR4 根据折射率的高中低分类： n&lt;1.6: SiO2(1.474), MgF2(1.386) 1.6&lt;n&lt;1.8: Al2O3(1.67), M2(1.68) n≈2: Ta2O5(2.25), Nb2O5(2.36), H4(≈2)，Ti3O5(2.31) 生产镀膜基材的公司有德国Merck，佳能Optron等，这些link里有更多的镀膜材料可以参考。根据使用的镀膜方法不同，材料的形态也不同，主要有粒状，药丸状等。 镀膜机镀膜机结构了解了镀膜的设计，方法和材料后，我们就更容易理解镀膜设备，镀膜设备主要包括：腔体，在镀膜机下方的蒸发源和离子源，在镀膜机上方的镀膜工件架，镜片都承载在工件架上，在镀膜机腔体后方或者下方的真空泵，以及膜厚监控设备等其他设备。下左图所示是Shincron公司的MIC-1350镀膜机，右图所示是一台镀膜机打开腔体的样子。镀膜机可以根据需求选配不同的配件。 腔体：腔体是整个镀膜机的内部空间，腔体的大小决定了镀膜机一次可以实现的镀膜数量。当然这取决于被镀膜工件的大小和排列。 蒸发源：根据我们前面所述，取决于蒸发方式，蒸发源可能是电阻蒸发、激光束蒸发、电磁感应蒸发，电子束蒸发等。如下图所示，左图展示了电子束蒸发源，右图是电阻蒸发。蒸发结构基本都是上面是坩埚，用以防止镀膜材料，下方是加热设备，然后可能会包含遮挡机构用以镀膜时防止材料互相污染。下图左图里可以看到有6个坩埚放置了镀膜材料。 离子源：如前文介绍，离子源用于辅助蒸发式镀膜，提升镀膜性能。如下图所示，是MIC-1350镀膜机的内置式RF(Radio Frequency)激励型离子源 NIS-175。大小Φ310 * H210，可以产生100-1000eV的离子能量。 镀膜工件架：镀膜工件架是承载镀膜件的机构，一般呈伞状，也被成为钟罩式，有一定弧度（见上文打开腔体图）。这样的结构设计是为了尽量让蒸发源到被镀膜件的距离和角度一致，保证镀膜件在腔体内部不同位置都可以获得尽量一致的膜厚。同时，镀膜时，由于蒸发源无法保证各个角度都是均匀蒸发，镀膜伞会进行旋转，增强膜厚一致性。如果追求更高程度的均一性，还会使用行星式镀膜工架，既镀膜伞主轴旋转，镀膜伞上还有小型的圆盘形工架，也进行旋转，这样可以最大程度的保证不同工件的均一性。（见前文塑料镜片镀膜章节的示意图，就是一个简单的行星式镀膜工架）。对于塑料镜片镀膜，由于塑料镜片非常小，镜片会首先被放置进镀膜托盘中，然后托盘会被固定到镀膜伞架的扇形板上，一个伞架可能由几个或者十几个扇形板组成，由操作人员把这些扇形板逐个安装至镀膜机伞架框上。如下图所示是一个扇形板，中间的六边形空间可以用来防止镜片托盘，也可能是圆形或者方形空间，取决于各公司自己的托盘设计。 真空泵：真空泵用以对镀膜机抽真空，比如对于MIC-1350镀膜机，其达到2×10-2Pa不超过10分钟(在基片温度250℃、清洗、无负荷的条件下)。真空泵性能对于大规模生产效率很重要。 膜厚监控设备：膜厚监控设备用以监控镀膜的厚度，有水晶式膜厚计和光学式膜厚计。 镀膜流程生产过程中，先由操作人员把镜片托盘组装到镀膜扇形板上，然后把扇形板固定至伞架上，关闭腔体，开始抽真空。达到真空后，镀膜开始，根据不同的膜层，镀膜机转换不同的蒸发参数和离子束参数，加热不同的镀膜材料，同时设备持续监控镀膜的厚度和光学性能直至完成所有设计镀膜层被加工完成。完成的镜片会经过清洗甩干/烘干流程，进入下一步组装流程。 镀膜机品牌由于镀膜广泛应用于各个行业，所以有非常多的镀膜机品牌，对于塑料镜片镀膜，常见的镀膜机品牌有Showa, Shincron, Optorun, Buhler, Satis等。 镀膜性能参数，检测及评价镀膜的性能包括光学性能，牢固度和持久性，以及均一度。 光学性能光学性能包括在各个波长和入射角度范围内的反射率和透过率，颜色参数。常用设备有Olympus RU-W，Hitachi U4150，评价颜色可以使用 镀膜的牢固度和持久性镀膜的牢固度和持久性测试是为了保证镀膜在设计环境和寿命情况内没有问题。其中测试方法可以参考标准： ISO 9211-4:2012, Optics and photonics — Optical coatings — Part 4: Specific test methods。其中描述了四个测试，分别是： 抗磨损测试（Abrasion resistance tests）：用以测试镀膜在被摩擦的条件下的机械性能，具体方法是使用某种材料（比如布）以一定力量反复擦拭镜片镀膜。 附着力测试（Adhesion tests）：用以测试镀膜在拉力和剪切力作用下的机械性能，具体方法是使用特定胶带以特定速度角度撕拉膜层。 网格测试（Crosshatch test）：用以测试镀膜被划伤影响后的附着力，具体方法是在一定区域划伤镀膜，划成网格状，然后再使用附着力测试中的方法去测试。 可溶性测试（Solubility test）：用以测试镀膜在蒸馏水，去离子水或者盐水溶液中镀膜的性能，具体方法是使用特定溶液特定温度水煮镀膜然后对镀膜外观和性能进行评估。 均一性对于镜片镀膜的均一性，需要比较在同一批次在镀膜机不同位置的镜片的镀膜性能，不同批次之间镜片镀膜的性能。 镀膜车间经济性：光学工厂生产要兼顾性能和成本，所以要求镀膜要又快又好，可以使用的方法有，定制更大的镀膜腔体，加快抽真空速度，设计时减少膜层数量，增加离子源加速镀膜速度，生产流程优化等。 洁净度：由于镀膜会产生微小颗粒，所以镀膜车间要和光学生产的其他车间分隔开，离开镀膜车间的物料要经过清洁，以防对下一步的组装流程产生污染。可用的方法有对镀膜后镜片进行水洗然后甩干，烘干。 镜筒镀膜为了美观，手机镜头的镜筒前端都希望做的越黑越好，实现这种方式同样可以通过对镜筒端面镀膜降低反射率实现，另一种实现方式时通过涂覆工艺涂上特殊涂料。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"塑料镜头制造","slug":"塑料镜头制造","permalink":"https://faster-than-light.net/categories/%E5%A1%91%E6%96%99%E9%95%9C%E5%A4%B4%E5%88%B6%E9%80%A0/"}],"tags":[{"name":"镜头","slug":"镜头","permalink":"https://faster-than-light.net/tags/%E9%95%9C%E5%A4%B4/"},{"name":"专题","slug":"专题","permalink":"https://faster-than-light.net/tags/%E4%B8%93%E9%A2%98/"}]},{"title":"光学新闻 20210613","slug":"OpticsNews20210613","date":"2021-06-13T13:00:00.000Z","updated":"2021-12-04T11:32:05.718Z","comments":true,"path":"OpticsNews20210613/","link":"","permalink":"https://faster-than-light.net/OpticsNews20210613/","excerpt":"本周五篇光学新闻： 2021年波导型光学显示元件市场报告— Sony展示了一个视频Demo，使用智能AI芯片IMX500进行工作监控和培训— Honeywell和剑桥量子计算合并成立量子计算巨头— 台积电正在调研在熊本县建立一个靠近索尼的新厂— First Solar计划投资6.8亿美元用以增强美国本土光伏太阳能产能","text":"本周五篇光学新闻： 2021年波导型光学显示元件市场报告— Sony展示了一个视频Demo，使用智能AI芯片IMX500进行工作监控和培训— Honeywell和剑桥量子计算合并成立量子计算巨头— 台积电正在调研在熊本县建立一个靠近索尼的新厂— First Solar计划投资6.8亿美元用以增强美国本土光伏太阳能产能 2021年波导型光学显示元件市场报告评论：Market Insight出品了一份134页的报告（价格$3360)，详细分析了市场增长因素，并分析了市场规模、最新趋势、按地区划分的 SWOT 分析以及到 2025 年的预测市场研究数据。波导型光学显示器元素市场报告研究了市场中的关键机会和对业务有用的影响因素。该报告还描绘了各种市场因素的定性和定量影响，如宏观经济指标、购买力平价、流行病学数据、保险方案以及专利和知识产权信息、政府政策和商业法规以及每个细分市场的市场吸引力。波导型光学显示元件市场报告还介绍了市场竞争格局以及对市场上主要供应商/制造商的相应详细分析。本报告涵盖的主要制造商：Microsoft HoloLens、Magic Leap One、Digilens、Vuzix、Waveoptics、Lumus、Apple (Akonia Holographics)、TruLifeOptics Global Waveguide-Type Optical Display Element Market Growth 2020-2025 Sony展示了一个视频Demo，使用智能AI芯片IMX500进行工作监控和培训评论：IMX500 AI智能图像芯片在2020年5月就发布了，这次的视频是展示了一个工作监控和培训的场景。新一代的图像芯片融合更多的AI算法，并集成进ISP。传统的AI图像是使用云上AI，图像和视频流通过互联网上云，识别计算后传回，这种方式的问题有延迟问题，隐私问题，耗能/成本问题。智能图像芯片的思路是丛云上走下来，这些计算都在片上进行。应用场景智慧商店（识别性别，年龄，产品），智能音响（识别人物，谁在对它说话），智能驾驶的驾驶员识别等。这种尝试第一是市场需求驱动，第二也是硬件商在AI市场中竞争的一个方向，在自己的产品中附加更多的价值。 Honeywell和剑桥量子计算合并成立量子计算巨头评论：美国的Honeywell的量子解决方案部门和英国的剑桥量子计算公司合并成一家公司，新公司将有300人左右，新公司CEO将由剑桥量子计算的创始人和CEO Ilyas Khan担任。这次合并交易包括了投资3亿美元在基于激光控制的离子阱技术。这种技术使用电磁场控制每个离子，然后使用激光编码。量子计算的开发需要原子物理，光学，低温学，激光，电磁学，高真空和精密控制系统等学科的支持。Honeywell就是那种你觉得它是做家用电器的，但是其实它是从飞机到量子计算机什么都做的公司， 新闻稿 台积电正在调研在熊本县建立一个靠近索尼的新厂评论：台积电的新厂会靠近索尼的一个厂，主要是提供对于图像传感器的知识，汽车芯片的支持等。该计划是由日本政府提出的，台积电正在考虑。计划是建造一个12英寸晶元厂，使用28nm和16nm制程。看来大家都在各种扩产。 新闻稿 First Solar计划投资6.8亿美元用以增强美国本土光伏太阳能产能评论：First solar计划将美国本土的光伏产能提高每年3.3GW，根据计算每瓦投入成本为0.2美元，所以算出来是6.8亿美元。新厂房将在俄亥俄，2023年中期投产。该计划会使First Solar达到6 GWDC（千兆瓦）的装机容量（装机容量，全称“发电厂装机容量”，亦称“电站容量”。 指电站中所装有的全部发电机组额定功率的总和），中国外最大的太阳能垂直整合生产基地。又看了下中国的太阳能产业，2016年12月8日，国家能源局下发了《太阳能发展“十三五”规划》提出，到2021年底，太阳能发电装机达到1.1亿千瓦以上，其中，光伏发电装机达到1.05亿千瓦以上，既105GWDC。国内最大的光伏生产商晶科能源，拥有垂直一体化的产能，截止至2020年12月31日单晶硅片产能达到约22吉瓦（GWDC）。First Solar此举很明显是配合拜登的基建计划，估计可能从政府拿到补助和优惠政策。 新闻稿 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"光学新闻 20210606","slug":"OpticsNews20210606","date":"2021-06-06T13:00:00.000Z","updated":"2021-12-04T11:32:05.718Z","comments":true,"path":"OpticsNews20210606/","link":"","permalink":"https://faster-than-light.net/OpticsNews20210606/","excerpt":"本周五篇光学新闻： 意法半导体（ST）和Metalenz合作— Sony发布了一篇介绍偏振传感器的技术文章— 新一代金星探测器会搭载一个自由曲面光学设备— 各种新式应用加速硅光子学工业界发展— Velodyne Lidar公司的创始人写公开信要求董事会主席和CEO下台","text":"本周五篇光学新闻： 意法半导体（ST）和Metalenz合作— Sony发布了一篇介绍偏振传感器的技术文章— 新一代金星探测器会搭载一个自由曲面光学设备— 各种新式应用加速硅光子学工业界发展— Velodyne Lidar公司的创始人写公开信要求董事会主席和CEO下台 意法半导体（ST）和Metalenz合作进行Metalens的工艺开发，工业化和技术授权评论：Metalenz和ST合作确实是一步好棋，ST对于各种制程的掌握可能可以很快工业化Metalenz的各种技术优势。ST已经在红外光学传感有一席之地，由此ST也可能会进入到更多光学传感领域或者占据更好的技术优势。超表面透镜可以对复杂光学系统带来性能，功耗，大小和价格上的优化。 新闻稿 Sony发布了一篇介绍偏振传感器的技术文章，介绍了偏振传感器和其中的挑战。评论：该传感器由Sony的半导体解决方案部门Sony Semiconductor Solutions Group (SSS Group)开发，部门名字SSS很棒。偏振图像传感器一定在各种识别上会有很多应用，尤其是对于自动驾驶，偏振图像传感器可以很好地识别背景和前车的区别而不像普通图像传感器会把二者混为一谈。文章介绍了制程，设计，以及trade-off上的各种考虑。 新闻稿 新一代金星探测器会搭载一个自由曲面光学设备评论：NASA计划在2028-2030年发射一颗金星探测器DAVINCI+，该探测器搭载的传感器之一是一个被称为紧凑型紫外光到可见光图像光谱仪，该设备将由NASA Goddard太空飞行中心制造，将会使用自由曲面光学。可以看到自由曲面光学可以很好的把光学系统做小。 新闻稿 各种新式应用加速硅光子学工业界发展评论：Yole发布的调研预估2020年到2026年的硅光子晶元市场会获得强劲增长，达到每年49%的CAGR。从2020年的8700万美元的市场规模增加到11亿美元的市场规模。主要的增长点在自动驾驶LiDAR，电子消费品的健康相关功能，以及光子计算上。这么看来，是光子学行业的又一春。 David Hall, Velodyne Lidar公司的创始人，写公开信要求董事会主席Brad Culkin和CEO Anand Copalan下台评论：文章中David认为现在公司的领导人对公司方向把握有问题，除了董事会主席和CEO以外，David还点名了几个总监，也认为他们应该退出公司管理和运营。最开始Velodyne上市时是通过SPAC方式和Graf Industrial公司合并，当时指定的CEO和董事会主席。David认为这些人都很不合格，从Copalan开始作为CEO时，Velodyne的营收就开始下降，而董事会主席Culkin只会附和CEO。 公司的倒塌很多是从内部开始的，Velodyne掌握的技术逐渐被其他公司效仿甚至超越，以至于内部的矛盾也开始放大。最近Velodyne的股价已经跌至上市价格。 新闻稿 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"塑料镜头制造 第四章：成型","slug":"塑料镜头制造 第四章：成型","date":"2021-06-03T13:00:00.000Z","updated":"2021-12-04T11:32:05.729Z","comments":true,"path":"LensMaking_C4/","link":"","permalink":"https://faster-than-light.net/LensMaking_C4/","excerpt":"成型是塑料镜头制造中重要的一步，成型件的精度一部分取决于产品形状设计和模具，另一部分取决于成型过程中的参数调节和成型后的精密检测。在塑胶镜头系列文章的第二章：材料中，已经介绍了多种热塑型塑料材料，这些材料的性质以及它们的来料形式（以塑料颗粒的形式入料进入成型机）。第三章中我们重点介绍了模具，塑料熔融材料流入模具型腔冷却后形成我们想要的形状。本章中我们会重点介绍注塑成型设备，注塑成型的流程，参数，以及它们对最终成型件（精品）的影响，成型后镜片的检测等内容。","text":"成型是塑料镜头制造中重要的一步，成型件的精度一部分取决于产品形状设计和模具，另一部分取决于成型过程中的参数调节和成型后的精密检测。在塑胶镜头系列文章的第二章：材料中，已经介绍了多种热塑型塑料材料，这些材料的性质以及它们的来料形式（以塑料颗粒的形式入料进入成型机）。第三章中我们重点介绍了模具，塑料熔融材料流入模具型腔冷却后形成我们想要的形状。本章中我们会重点介绍注塑成型设备，注塑成型的流程，参数，以及它们对最终成型件（精品）的影响，成型后镜片的检测等内容。 注塑成型机历史，种类及厂家历史第一款人造塑料是由亚历山大·帕克斯（Alexander Parkes）于1855年发明的，他称这个塑料帕克西林（Parkesine）。1868年，美国发明家John Wesley Hyatt发明了一种使用注塑赛璐珞制造台球的方法（替代以前使用象牙制造台球的方法），1872年他和他的哥哥Isaiah Hyatt正式申请了该种方法的注塑机专利。最初的注塑机还非常原始，类似于大号的针管，但是已经可以很好的实现设计功能了。这个注塑机包括了一个柱塞（F），通过一个加热的圆柱（B），把塑料注入最下面的模具。 1946年美国James Hendry设计建造了第一款螺杆式注塑机，使用一个置于圆柱空腔内的螺杆，通过旋转把塑料材料前推和注入模具。旋转的螺杆提供了非常好的注入速度控制，可以进行材料混色等。今天95%的注塑成型机都是使用这种技术。 1956年W. H. Willert进一步优化了螺杆式注塑机，增加了往复挤出系统，在注塑成型的的阶段，熔融的塑料通过螺杆逐渐融化，被送入最前端，然后整个螺杆向前推送，把最前端的塑料注塑模具，然后后退，再把新一批熔融塑料送入前端。 注塑成型历史参考 种类按螺杆运动轴线和模板运动轴线相对位置分类，注塑成型机有卧式成型机（Horizontal），立式成型机（Vertical），角式成型机。 螺杆运动轴线和模板运动轴线在水平方向的是卧式成型机，在垂直方向的是立式成型机，螺杆运动轴线和模板运动轴线垂直的是角式成型机。三种成型机各有优劣，要根据生产产品的不同进行选择。 卧式成型机：成型机高度不高，厂房高度要求低，填料容易，但是占地空间大。模具横向移动，开模后产品直接掉落，需要机械手辅助取出。 立式成型机：高度高，填料麻烦，占地小。模具纵向移动，容易保持各个模穴的均一性。 角式成型机：优缺点介于立式与卧式之间。 厂家用于手机镜头光学注塑成型的设备厂家主要有： Sumitomo (SHI) Demag住友-德玛格 Sumitomo (SHI) Demag塑料机械有限公司是全球最大的塑料加工注塑机制造商之一。这家日本—德国公司于2008年春季成立，合并了住友重工（SHI）和德马格塑料集团的注塑成型业务。Sumitomo (SHI) Demag在全球的开发和生产网络包括日本，德国和中国的四家工厂，员工人数超过3000人。该产品组合包括全电动，液压和混合注塑机，锁模力在180和15,000 kN之间。住友（SHI）德马格在全球所有重要市场均设有超过100,000台机器。每年售出超过5000台机器，Sumitomo (SHI) Demag的塑料机械业务已成为全球最大的注塑机制造商之一。 Fanuc发那科 Fanuc发那科，是一间提供如机器人和电脑数控机床等自动化产品服务的公司，主要由日本“发那科公司”（日语：ファナック株式会社 Fanakku Kabushikigaisha）、美国密歇根州罗切斯特山的“美国发那科公司”以及卢森堡的“欧洲发那科公司”组成。 发那科是世界上最大的工业机器人制造商之一，公司名称是富士自动化数控（Fuji Automatic Numerical Control）的英文缩写。最早期的发那科公司是富士通开发的早期数字控制和伺服系统公司的一部分。 考虑到手机光学镜片注塑成型需要的锁模力相对较小，一般使用的都是30T或者50T的机型。 注塑成型机结构前文我们讨论了注塑成型机的历史，了解了注塑成型机的主要结构，在这一节中我们在具体讨论这些结构，参数以及注塑成型机的参数对于光学产品的影响。下图展示了一台卧式注塑成型机的结构，蓝色上部右侧是最注塑结构，主要包括料筒，螺杆等，蓝色上部左侧是模具和锁模机构位置，模具的固定侧固定在靠右侧的螺杆处，左侧的锁模机构带动模具可动侧进行模具的开合。整个注塑成型机的下部是控制设备和承台等结构。 注塑成型流程Polyplastic这张动图，很好展示了注塑成型机的流程和螺杆的结构。基本流程包括原料处理，合模，注塑，V/P转换，保压，冷却，开模，顶出，制品取出，我们在下面详细讨论这些流程。 塑料原材料干燥塑料原材料是需要干燥后才能进入注塑流程的，如下图Zeonex的说明所列，需要通过预先干燥4-10小时去除溶解的空气中的水分以防止成品颜色灰暗，产生碳化物及空隙。 注塑氮气保护进行注塑成型的时候，要进行氮气保护以防止出现碳化，烧焦，变色等情况。 合模模具闭合，模具的可动侧由注塑机带动和固定侧锁闭。注塑成型机的锁闭机构，控制机构，模具机座结构都会对塑胶镜片的制造精度产生影响。 注射，V/P转换及保压料筒中的塑料颗粒进入螺杆，螺杆旋转把所料颗粒前送，随着塑料颗粒经过加热段，逐渐变成熔融态，被推入最前射出段，整个螺杆前送，推送最前端的塑料进入模具（此时料筒停止供料），而后螺杆后退，螺杆旋转准备再次送料。这个步骤看起来简单，但是其实包含了几个分解步骤，而且也是成型参数中最重要的部分。其中有注射阶段，V/P转换阶段和保压阶段。一般使用压力，速度曲线来描述这一过程。同时，成型机上对于不同的步骤都可以进行分别的设置。 注射 注射过程指的是螺杆前推把熔融塑料推入模具的过程，该过程不是以一个固定速度进行的，而是分几个步骤，在不同阶段使用不同的注射速度完成对模具型腔的填充。比如对于一台五速四段成型机，在注射设置中，就会有五个匀速运动状态。见上图绿色曲线的前五个定值，就是螺杆前进的五个速度。对于小型塑料镜片注塑来说，首先第一个速度是熔融塑料快速被推入主流道，第二个速度是塑料到达主流道末端开始进入分流道，第三个最低速度是塑料通过浇口（防止出现喷射纹以及浇口雾斑等现象），然后进行一个高速注入（以减小腔内熔料温差，改善压力传递效果，得到密度均匀，内应力小的镜片，提高熔接缝强度等作用）。这部分对应的压力曲线可以看到是一直上升的。最后的低速是V/P切换后的速度。这里的设置主要有螺杆4个位置的设置，和到每个位置螺杆运动的速度（共5个）。 V/P转换（Velocity/Pressure Switch） 前面的注塑流程上主要负责把塑料注入模具型腔，填充满。在这个过程中，螺杆的运动主要是通过控制前进速度来完成，当模具型腔快要填满时，就需要开始控制型腔内塑料的压力，要防止压力太大造成飞边，内应力过高等问题。这时，螺杆的运动就由流动速率控制转换到压力控制，这个转化点被称为保压切换控制点，既V/P转换点。切换方式一般有三种，为压力切换，时间切换和位置切换。压力切换就是当机器检测到射出压力达到设定压力时，转换为压力传感器控制螺杆运动；位置切换为当螺杆运动到某一设定位置时，转换为压力控制传感器控制螺杆运动；时间切换为当注射开始一段特定的时间后，转换为压力控制传感器控制螺杆运动。 保压 V/P转换后，螺杆会通过继续前移，填充满模具并达到一个设定的保压压力。保压压力也会有几个阶段，可以从曲线看到，这里保压压力有三个阶段，随着成型件冷却固化，逐渐降低保压压力。 冷却产品在模具中冷却，直至达到设计的冷却时间。冷却时间是决定注塑生产效率的重要参数。 开模，制品顶出及取出模具打开，制品被顶出，然后被机械臂取出。模具合模进行下一次注塑。 剪切被机械臂取出的多穴镜片会放置在剪切机上，由热刀和流道分离，并自动化装盘。 烘烤镜片剪切装入镜片托盘后，为了进一步降低内应力，优化镜片的性能（MTF及信赖性），会进行烘烤。烘烤的实现主要是把镜片放置入特定温度的烤箱中一定时间自然冷却或者控制温度逐渐降低退火。比如放置入75℃-95℃的烤箱中3-5小时，然后自然冷却。 模流分析注射成型过程会影响光学零部件表面面形精度，由于材料在成型过程中的流动模式和冷却，固化收缩，光学零件的面形精度会受到影响。现代塑料成型的模具和成型参数设计都先使用计算机辅助设计来进行模流分析，如Autodesk Moldflow Adavisor，Autodesk MoldFlow Plastics Insight (MPI)，Moldex3D等。这些软件可以通过3D建模，然后输入成型注塑的速度温度等参数，然后分析塑料在模具内流动情况，填充情况（填充度，熔接痕），填充压力，填充时间，冷却时间，压力变化，锁模力需求，模具困气等。实际开发中，会在仿真中先一步优化成型产品的形状控制，应力分布，折射率分布，优化成型时间，直到模流分析显示出较好的结果，然后镜片的设计优化确认后，模具的生产才会开始，这样可以避免后面对模具进行重新设计或进行大的修改。 下面的动图展示了常见的模流分析软件进行分析后生成的动图，在这个看起来像是注塑乐高拼图的模流分析中，用户可以看到塑料在模具中的流动状况，在这个图里，还可以看到颜色代表的温度的动态变化。 对于光学部品，主要要分析的是形状（尺寸相关参数）以及外观，模流分析主要针对以下几点进行分析，这里主要对需要注意的问题进行简单介绍，注塑成型的具体细节可以咨询成型工程师。以下以镜片成型为例子，镜筒成型考虑的问题类似： 以下所有参数在不同模穴的分布情况（有一些流道设计可以多模穴很均匀，有些则不然） 填充是否饱满：这决定了产品形状 面型：影响成像质量 熔接痕：熔接痕是熔融塑料交汇的位置，对于有些形状的镜片，如下图所示Link，展示了两种成型条件下的模流分析和熔接痕情况。左边的一组显示注入的塑料可能分成两路最终在浇口对侧汇聚，这时可能会形成熔接痕，而右边的是优化过后的成型状态。熔接痕的长度和位置都很重要，如果在镜片的有效径内，影响光学性能，造成杂光；在有效径外也可能造成杂光或者影响组装精度，不好的熔接痕也可能造成信赖性后的镜片开裂。 飞边：飞边产生于模具的两侧接缝处，如果此处闭合不严，或者模具打开时模具内压力还比较高，或者锁模力不足都可能造成一些塑料溢出形成飞边。飞边会影响塑料镜片的外周精度，影响组装；同时飞边可能非常小，在微米级别，可能会掉落污染镜头或者产线，造成外观不良。 困气：因为模具闭合很严，当塑料注入时，模具内的剩余气体被压缩，可能在塑料最终到达的位置无法排出，造成困气，进而造成填充不满。解决困气需要设置模具排气或者抽真空。 气泡 ：许多工艺参数对产生气泡及真空泡都有直接的影响。如果注射压力太低，注射速度太快，注射时间和周期太短，加料量过多或过少，保压不足，冷却不均匀或冷却不足，以及料温及模温控制不当，都会引起塑件内产生气泡。高速注射时，模具内的气体来不及排出，导致熔料内残留气体太多，如果速度降得太多，注射压力太低，则难以将熔料内的气体排尽，也很容易产生气泡以及凹陷和填充不均匀。Link 白斑，流痕：温度不够，压力不够可能会产生白斑；射速太高可能会产生流痕问题。 应力分布：见下图左，Moldex3D模流分析可以展示出应力的分布。应力会造成应力双折射，影响光学性能，也会造成可能的信赖性问题（开裂等）。 折射率分布：见下图中，Moldex3D模流分析可以展示出成型后的折射率的分布。 翘曲：见下图右，Moldex3D模流分析可以展示出镜片的翘曲情况。 成型品的最终状态由产品设计（产品形状），模具设计（流道，浇口大小及形状，排气，加热/冷却设计，顶出）和成型参数（前文注塑成型流程中所述参数）共同决定。我们会在最后一章，设计中再次列出这里所有需要考虑的参数。 成型后的检测成型后剪切下来的镜片会进行各种参数的测定，其中包括面型，偏心，应力双折射，透过率，外观等。 面型检测精确的面型检测对于现在手机镜头镜片尤其重要，现在手机镜头厂的标准配置设备是Panasonic UA3P轮廓仪。该系列设备使用原子扫描方法，可以达到非常高的面型和偏心测量精度。比如标准设备UA3P-300在最大30°的表面轮廓下，30mm x 30mm x 20mm的范围内，往复测量精度为±0.05um。同时UA3P提供了很多配套软件进行面型的分析。 读者如果感兴趣，可以阅读设备的简介，UA3P系列英文介绍 偏心检测偏心检测主要检测镜片的面间偏心，常用的设备有UA3P和Trioptics OptiCentric系列。如今的手机镜头镜片偏心值非常小(1um~2um)，需要设备精度和设备间均一性很好。使用UA3P进行偏心测量，是通过测量镜片机械重心和光学重心，确认偏心值。使用Trioptics是把镜片放置到治具上进行旋转测定。两种方法各有优劣，比如UA3P可以进行编程对一个托盘的镜片进行面型和偏心测量，不需要单个镜片人工测试。 中厚检测镜片的厚度是重要的光学参数，可以使用激光测厚仪来进行测量。比如Trioptics的OptiSurf，厚度测量精度可以达到1um。 应力双折射检测多种设备可以进行应力双折射的检测，如Photonic Lattice的WPA系列，Thorlabs的LCC7201等。 透过率检测透过率检测主要是确认成型后镜片达到该种材料的成型后透过率标准，发现人眼无法发现的透过率损失。 外观检测外观检测主要检测成型品是否有熔接痕，白点/黑点，雾面，杂质，困气，飞边等等外观问题。外观检测主要通过肉眼及显微镜等设备进行。 镜筒的检测镜筒的检测主要是尺寸检测和外观检测，尺寸检测主要使用各种三坐标设备，外观检测主要使用显微镜等设备。 成型车间的生产流程实际生产中，首先的设计阶段会进行镜头镜片结构设计，模具设计和模流分析，然后进行多轮设计优化。产品定型后，开始模具加工，模具加工完成后，会进行单穴，双穴或者四穴成型调试，然后会进行测量，测量数据返回设计部门进行公差分析，再进行进一步调试达到设计公差范围内。都达到标准后，模具扩穴（开始使用所有模穴），进一步进行调试，直到参数稳定，最终开始进行大规模生产。生产中的成型参数可能也需要进行微调。一个光学镜头制造工厂的成型部门接受的输入是镜片设计和公差要求，输出的是为下游提供合格的单镜片零件。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"塑料镜头制造","slug":"塑料镜头制造","permalink":"https://faster-than-light.net/categories/%E5%A1%91%E6%96%99%E9%95%9C%E5%A4%B4%E5%88%B6%E9%80%A0/"}],"tags":[{"name":"镜头","slug":"镜头","permalink":"https://faster-than-light.net/tags/%E9%95%9C%E5%A4%B4/"},{"name":"专题","slug":"专题","permalink":"https://faster-than-light.net/tags/%E4%B8%93%E9%A2%98/"}]},{"title":"法国CEA-Leti超低功耗识别设备","slug":"OpticsNews20210525","date":"2021-05-25T13:00:00.000Z","updated":"2021-12-04T11:32:05.718Z","comments":true,"path":"OpticsNews20210525/","link":"","permalink":"https://faster-than-light.net/OpticsNews20210525/","excerpt":"法国CEA-Leti发布世界上首个用于手机，智能家居和汽车的“自主成像器”，可以做面部识别和其他特定图案识别。这个设备叫µWAI ，硬币大小，非常低功耗，而且成本很低，基于它创新的设计架构，AI和算法，这个设备可以使用非常少的能量来完成准确的识别。它可以工作在基本所有光照条件下，有88dB的动态范围。对比起其他应用，该设备使用的能量小1万倍。这个设备的特点有：","text":"法国CEA-Leti发布世界上首个用于手机，智能家居和汽车的“自主成像器”，可以做面部识别和其他特定图案识别。这个设备叫µWAI ，硬币大小，非常低功耗，而且成本很低，基于它创新的设计架构，AI和算法，这个设备可以使用非常少的能量来完成准确的识别。它可以工作在基本所有光照条件下，有88dB的动态范围。对比起其他应用，该设备使用的能量小1万倍。这个设备的特点有： 高能量效率：比其他识别设备小1万倍的能耗，用CR1025纽扣电池（这个有点儿crazy），5年always-on寿命，3-6uW功耗 隐私保护，AI基础识别：临近人类识别95准确度 各种光照环境都有很高的识别能力 可以把这个设备理解成新时代的卫生间灯开关传感器（卫生间有人经过就亮灯），不同的是该设备可以识别出这是不是人，或者它可以识别一辆车的模式，或者专门用来识别箱子，或者某种pattern。而且这个低功耗和低成本可能会在很多物联网设备上有广阔应用。 该产品是CEA-Leti和ST合作开发的。该公司会在6月22日的活动上具体介绍该产品， Leti Innovation Days。 通讯稿Link 这里记录值得分享的光学科技内容，欢迎投稿或推荐科技内容。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"}]},{"title":"塑料镜头制造 第三章：模具","slug":"塑料镜头制造 第三章：模具","date":"2021-05-24T14:00:00.000Z","updated":"2021-12-04T11:32:05.727Z","comments":true,"path":"LensMaking_C3/","link":"","permalink":"https://faster-than-light.net/LensMaking_C3/","excerpt":"模具是现代工业中非常常见的一种工器具。模具虽然分类为很多种类，但是总而言之它们的作用都是相近的：依赖它们自身的形状，通过一定手段使得具有一定塑性或流动性的工料也成为特定的形状。通常意义上的模具是指的三类模具：铸造模具、金属塑性成形模具和注塑模具。 本章我们主要简单讨论和塑料镜片成型相关的一些模具知识，包括注塑模具的基本结构，光学模具的结构和设计，模流分析，模具加工，模具检测和模具维护等内容，重点介绍光学镜片的模具重点，下一章我们会介绍注塑成型的内容。","text":"模具是现代工业中非常常见的一种工器具。模具虽然分类为很多种类，但是总而言之它们的作用都是相近的：依赖它们自身的形状，通过一定手段使得具有一定塑性或流动性的工料也成为特定的形状。通常意义上的模具是指的三类模具：铸造模具、金属塑性成形模具和注塑模具。 本章我们主要简单讨论和塑料镜片成型相关的一些模具知识，包括注塑模具的基本结构，光学模具的结构和设计，模流分析，模具加工，模具检测和模具维护等内容，重点介绍光学镜片的模具重点，下一章我们会介绍注塑成型的内容。 注塑模具的基本结构我们从最简单的设计开始，一步一步逐渐复杂化，了解现代化精密模具的各个组成部分和他们的作用，读者会发现，看起来很复杂的模具结构其实很大一部分都是很直觉的合理化设计。然后我们再讨论光学模具和普通的塑料制品模具的不同。 假设我们想成型一个直径10mm，双凸，如图所示的镜片（侧截面和俯视图），我们需要什么样子的模具？ 首先，我们已经了解了热塑型塑料的特性，经过玻璃转化温度Tg温度后，塑料会成为高弹态，温度更高会变成粘流态，或者简单思考，变成了“液态”。待温度降低到Tg温度下，又会变回玻璃态（固态）。那类似于我们小时候在沙滩做城堡或者玩泥巴的经验，我们把沙子或者黄泥倒入到各种形状的模子，然后扣在地上，我们就制成了我们想要的形状。同样，为了做一个镜片，我们可以把液态的塑料注入一个模子中，然后冷却就形成了我们要的形状。那第一步，我们要有一个最简单的模子。一半一半，两个凹下去的坑，然后留一个口，让塑料“液体”从侧面一个小孔流进去，冷却就好了。冷却后，我们就有了一个柄上带着一个小镜片。只要把它切下来我们就有了我们的镜片了。现在我们已经有个一个模具最重要的几部分：模具的两半，模穴型腔(Cavity)，浇筑系统（流道） 好的，现在这个模具可以做镜片了，但是看起来确实不是很精确。每次我们扣上左右两面肯定都不是很准确，总会有一些偏移。这个可以用一些方法解决，比如我们在一个板子的四个角上做几个孔，另一个板子上做几个凸起，然后每次对准他们就可以保证每次对位都是一样了。这就是模具的导向机构。 看起来不错，每次我们扣上模具的两面就可以做出来一个镜片，可是这样还是很不经济，生产效率不高。可不可以一次做好多镜片呢？当然可以，我们可以加大模具的两侧，制作出来很多模穴，然后用流道将他们连接起来最后汇聚到一个口上，每次我们灌入塑料“液体”，都会流到所有穴中，冷却后就可以形成如下图所示的好多柄，每个上面都有一个小镜片。设计每次成型多少个合适呢？这取决成型机的锁模力，模具的大小，流道的长度（太长了的话，那可能流到所有穴里时间太长了，前面进去的塑料已经开始冷却了，可后面的还没流进去）等参数。直觉上，做一个流道对每个穴等长的设计不错。这样每个镜片成型的时间是一样的。 我们发现每次打开一侧模具的板子后，用手拿出来整个成型件好麻烦，而且从一侧拽下来有时会把我们的镜片给拽歪。我们可以在每个镜片靠近边缘的地方顶一下，把他们顶出来。我们只需要在模板上再钻一些孔，然后放进去长的金属条，然后把所有金属条固定在一个板子上，这就是顶出结构，这个板子叫顶出板。每次注塑冷却结束，打开一侧的模具（步骤1），然后顶出结构整体移动一下，整个成型件就被顶出来了（步骤2）。当然我们每次不希望成型件出来就掉地上，我们可以去接着它或者我们用一个机械手轻轻的抓住流道，然后把镜片移出（步骤3）。 不错，我们已经具备了一定的大规模生产能力，可以开个镜片作坊了。不过每次合上模具的两面，然后把塑料“液体”管子接上去，然后把塑料注入进去这个步骤看起来很麻烦。我们可以把注塑流道固定在一侧的板子上，穿过这边的模板，这样我们每次注入塑料都不需要反复连接这个管子了。不过有一个问题，现在管子不是在上面了，液体要往上面的穴流就流不进去了怎么办，这个很简单，我们给塑料“液体”加一些压力，等液体流满了，我们在注塑口那里设置一个小开关，把流道口堵上，这样塑料“液体”就不会回流回来了。同时，为了防止等待注入的塑料冷却，我们在模具流道口的注入设备这里加一个加热器（我们甚至开始设计注塑成型机了，下一章我们会看到注塑成型机是如何加热塑料和保保持温度的）。同时，我们固定右侧的模具，每次开关只移动左侧的模具，这样，模具的两边一个叫可动侧，一个叫固定侧。 客户给我们下订单了，生产8万片镜片，很不错，我们兴致勃勃的开始生产了。每次我们生产8个镜片，那我们一共需要注塑1万次，每注塑一次叫一个模次。每次注入到冷却到镜片拿出来需要5分钟，生产8万片我们每天开工24小时需要将近7天，要是冷却能快一些就好了。我们可以在模具中加工一些孔洞，然后让冷水在里面流动起来，这样就加快了冷却速度。我们每一模次速度一下子就快起来了，假设我们降低到15秒，很不错。41.6小时就可以完成工作了，每天工作8小时，这周我们稍微加一个多小时班就做出来了。大家都很开心，既完成了工作，又没加班。这就是模具的冷却系统，有些模具也可能需要热油/水在模具中流动，或者同时使用冷水和热水系统。 生产开始了，可是和我们的预期不同，生产过程中，我们发现塑料材料冷却后一小块粘在模具的穴上了，下一次注塑的镜片上面就会多一个凹坑。这样有一个镜片就不能要了，我们一次只能生产9个了。又过了一段时间，我们又在一个穴上发现了这个问题。我们决定停下生产，清洁一下我们的模穴，这就是模具维护。 维护好，重新生产了一段时间后，我们发现一个穴出产的镜片上开始有表面划痕了，看起来是我们的模穴磨损了。或者，我们在维护时，发现清除掉塑料小颗粒后，模穴表面也被压出来了一个小坑。这个模穴就彻底用不了了。因为我们加工的是凹坑，要是再抛光一下这个穴，那么这个穴生产出来的镜片的大小就会比别的镜片大了，我们只等丢弃这个穴不用了。可是生产中这种情况经常发生，损失一个穴可能还可以接受，可是要是损失4个穴，我们一下子效率就降低了到了一半。有什么办法能保证这个模具维护后总是能一次生产8个呢？其实很简单，我们可以把模具做成两部分，一部分是我们的模穴，做成一对一对的小圆柱体，上面是我们的凹穴（型腔），这就是模芯和模架。模具的其他部分上我们钻出大孔用来放置这些模芯，可能还有会衬套来套在模芯上。我们可以提前做好20对模芯，然后如果哪个模芯坏掉了，我们就替换掉它。这种方式还有很多优点：模芯加工需要高精度的单点金刚石车削加工，需要旋转加工件，一个小的模芯面型加工要比旋转整个模具容易多了，也容易保证精度。而这种方式，也保证了模架可以复用，比如下次我们如果要做一个小一些的镜片，我们可以替换小一些的模芯上去，而不需要重新制造模架。 除了这些部分，模具还会有排气系统，排气系统是为了将注射成型过程中型腔内的空气及塑胶融化所产生的气体排除到模具外而设立，排气不畅时制品表面会形成气痕（气纹）、烧焦等不良；塑胶模具的排气系统通常是在模具中开设的一种槽形出气口，用以排出原有型腔空气的及熔料带入的气体。有些模具还会有抽芯结构（比如圆珠笔杆），光学镜片的注塑一般不需要抽芯，但是镜筒的制造有些需要更复杂的结构，可能会有抽芯或者滑块结构。可以参考“塑胶模具七大系统”了解模具。 光学镜片模具设计和制造基本要求我们已经有了基本的一个现代化的模具，对于塑料模具来说，这些结构基本都是通用的。那光学注塑模具和普通塑料制品注塑模具有什么区别呢？ 答案是：非常高的精度和均一性要求。我们希望制造出来的镜片都有很高的精度；我们同时希望这些镜片越一样越好，这里指的一样是每个镜片越一样越好，我们不同穴制造的镜片都都一样的精度，不同模具生产出来的镜片也有一样的精度，随着生产时间的进行，我们的镜片精度也有保证。 模具重要参数光学模具实现高精度主要是靠高精度的模具设计和模具加工设备实现的。光学单镜片关心公差有很多，模具主要可以保证成形出来的镜片的面型精度，偏心以及表面光洁度。成型后光学镜片面型精度P-V可以达到±0.1到±0.5um，尺寸准确度和偏心可以达到&lt;2um。而模具本身的精度更高，比如对于模芯本身的尺寸精度会在&lt;0.5um。模芯表面光洁最高可以达到Ra0.2nm~0.3nm。模具的加工评价包括尺寸精确度，圆度，平行度，垂直度，偏心，平面度，表面粗糙度评价等。 下面几张图展示了相对简单的光学塑料镜片成型模具和成形出来的镜片的形态。模具主要部分有： 模芯：对于手机镜头大小的镜片，根据镜片大小的不同，有4，8，12，16，32等穴数。下图展示的是12穴的情况。 浇筑系统：从示意图可以看到主流道分出6条分流道，每个分流道上在末端再分出两个流道，最终成型12个镜片。可以看到分流道末端有冷料井，是在塑料注射成型模具中用来储存注射间隔期间产生的温度相对低的塑料的，这样可以保证这些塑料不会进入最终成型件。 料口设计：从示意图可以看到镜片和流道的连接处是很小的收缩料口，这是为了增加塑料进入的速度以及缩小剪切口的大小。 顶出方式：根据顶出方式的不同可以分成顶针顶出式和模芯顶出式模具，也有两种顶出方式同时使用的。对光学零部件的区别是顶针式顶出的镜片偏心控制好一些，模芯顶出式的镜片面型控制更好一些。但是这个不是绝对的，取决于具体生产的镜片和模具设计。可以在示意图中看到蓝色的标注出的顶出位置。 排气系统：下图最外圈的凹槽型结构就是模具的排气槽。 这张图展示了更精密的模具样式, a图展示了模芯的样式，b图展示了模具的两侧，我们可以看到模芯，流道，导向机构等，Link。 下图展示了模芯的样式，来自于台湾伯特光电 下图展示了实际模架的多层架构，包括可动侧，固定侧，支撑板，顶出板等。 镜筒模具镜筒的成型模具和镜片类似，主要由于镜筒的结构，模具会增加镶件，滑块等结构，同时由于镜筒较大，所以镜筒制造模穴数更多的是4或者8，并采用每个模穴多浇口来保证填充。综合而言，镜筒注塑比镜片模具精度要求略低，但是由于现在手机镜头越来越大，镜筒越做越大，镜筒壁越做越薄，难度也就越来越高。同时，镜筒承担着部分保证镜片间相对偏心位置的作用，精度要求也越来越高。 模流分析现代塑料成型的模具和成型参数设计都先使用计算机辅助设计来进行模流分析，如Autodesk Moldflow，MoldFlow Plastics Insight (MPI)，Moldex3D等。这些软件可以通过3D建模，然后输入成型注塑的速度温度等参数，然后分析塑料在模具内流动情况，填充情况（填充度，熔接痕），填充压力，填充时间，冷却时间，压力变化，锁模力需求，模具困气等。我们在下一章成型中再具体说明镜片成型的问题。 模具加工流程和设备光学模具的零部件加工主要有模芯预加工处理，模芯表面面型加工，模板切割，研磨，打孔，铣削等工序。 粗加工，预处理：模具流道和型腔要承受注塑成型的压力以及快速流过的塑料对于内壁的磨损；模具的两半是被成型机的压力装置牢固的压在一起，也要承受很大压力；而且光学模具要进行长时间的大规模生产，同时希望保持很好的精度，同时尽量降低维护周期。所以模具的重要部件都是经过预处理的。首先先对这些零部件进行粗加工，然后进行模具预处理，最再进行精加工。预处理包括淬火（加硬Harden）和热处理。加硬是通过把模具钢加热到一个温度后再快速冷却以提升模具硬度，热处理时先对模具进行升温然后缓慢降温（退火）以降低硬度，降低残余应力，稳定尺寸。 模架加工模架包括模板加工，成型流道加工，冷却水道加工等除了模芯以外的其他部分的加工。这部分的材料经过第一步的粗加工及预处理后，会进行进一步的精加工来最大化的保证精度。其中会使用各种高精密车床，铣床，磨床，电火花加工，电化学加工等多种加工方式。提供这些精密设备的公司有日本Shibaura，Makino，Seibu，Nachi，美国Moore等。 模芯加工模芯的面型加工使用超精密加工方式-单点金刚石车削加工(diamond turning machine，DTM)，如图所示，这种加工方式一面是旋转的被加工件，加工时一般向X或Y方向移动，一面是一个金刚石的刀头，以某个角度安装，同时整体可以在Z方向移动。 设备特点这种方式和普通车床没有什么本质不同，最大的特点就是极高的精度。实现高精度是整个系统的每个部分都充分考虑精度，比如整个设备采用大理石底座，采用高精密的移动系统，气浮轴承，流体静力轴承系统等。同时设备所在的环境也有严格的控制，首先设备在严格温控的环境下进行生产，温度甚至会控制在±0.5K内。设备也会严格控制震动，比如加工设备整体放置在特别浇灌的地基上，同时该部分地基和建筑的其他部分隔离开以降低建筑内其他部分的人员走动和震动的影响。超精密加工可以实现极高的表面的精度、重复性和光洁度。提供这些精密设备的公司有日本Shibaura, Makino, Seibu, Nachi, 美国Moore等。比如下图就展示了Shibaura（芝浦）公司的各种提供不同自由度的精密加工设备，最基础的可以加工旋转中心对称的模芯，而自由度更高的设备可以加工自由曲面模芯，但是有些时候，自由度高也可能会损失一些精度。 模芯镀镍由于模具的材料模具钢硬度很高，直接加工该材料对于DTM的金刚石加工刀头的磨损非常大。所以，模芯上表面首先都会镀一层镍-磷合金（Nickel-Phosphorus，NiP），该过程一般通过电解方式或者电化学方式完成。这一层镍-磷合金硬度远低于模具钢，极大地提升了模芯的可加工性和加工速度。一般模芯会先加工出光学基本面型，然后镀一定厚度的镍-磷合金，这个厚度取决于预制的面型，光学面的sag情况以及后期需要的补正次数决定，一般为几微米~几十微米，最大可至几百微米。 模芯检测和补正模芯按设计面型加工完成后，会组装进模具放入成型机进行成型试制，由于塑料成型的收缩问题，成型件和模具型腔面型会有差异。成形出来的镜片经过检测后，根据和设计面型对比，会进行补正计算，然后在模芯上再进行加工，补偿收缩的部分。通过迭代，让成型件一次一次更接近设计面型。我们会在下一章成型里更具体说明这个问题。 模具的表面处理抛光：模具有些时候需要抛光处理以降低成型件表面粗糙度， 粗糙处理：有些时候需要表面粗糙处理用以形成一些粗糙纹理，比如对于单镜片，法兰有些位置需要粗糙表面，来散射掉杂光的光路；镜筒的内侧要粗糙化等。这些粗糙化的表面处理方式有喷砂，放电处理， 模具检测模具加工过程中要进行多次检测，主要检测就是制造精度的测量。主要使用多种不同精度和行程的三坐标检测设备以及面型检测设备，如 原子力型轮廓仪：Panasonic UA3P，检测模芯面型 非接触式面型检测：Zygo Compass和Nexview（使用Coherence Scanning Interferometry, CSI方法） 接触式三坐标：Mitutoyo Legex系列（三坐标）,Taylor Hobson公司的三坐标检测设备，Zeiss公司的三坐标检测设备等，用于检测相对比较大的模具部件的精度。 模具维护如果多个模穴产品开始出现瑕疵，比如尺寸精度损失或者表面产生污迹等，模具就要进行维护，主要是处理损坏部分，清洁型腔以及重新组装调整精度。 模具成本模具部门的硬件资产是一个塑料光学镜头企业的核心资产之一，同时一个项目的模具本身也是镜头制造的重要成本组成部分。 资金成本：高精模具的成本很高，包括模具的原材料，模具的加工及检测设备等。 时间成本：模具设计，加工，组装，成型修模的迭代，模具维护都是很大的时间成本。 人力成本：模具部门的设计工程师，加工工程师，组装和维护人员。 一个塑料镜头制造企业的模具部的核心能力在于模具精度以及快速地设计以及制造模具。由于现代手机类塑胶镜头的大小基本相似，某些镜片面型非常类似（比如最后一片），模具部门可能会准备一些预加工模芯（完成镀镍磷合金的模芯）用于快速开发。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"塑料镜头制造","slug":"塑料镜头制造","permalink":"https://faster-than-light.net/categories/%E5%A1%91%E6%96%99%E9%95%9C%E5%A4%B4%E5%88%B6%E9%80%A0/"}],"tags":[{"name":"镜头","slug":"镜头","permalink":"https://faster-than-light.net/tags/%E9%95%9C%E5%A4%B4/"},{"name":"专题","slug":"专题","permalink":"https://faster-than-light.net/tags/%E4%B8%93%E9%A2%98/"}]},{"title":"Looking Glass Portrait背后的光学原理","slug":"Looking Glass Portrait背后的光学原理","date":"2021-05-20T18:00:00.000Z","updated":"2021-12-04T11:32:05.717Z","comments":true,"path":"TechReview_2_LookingGlass/","link":"","permalink":"https://faster-than-light.net/TechReview_2_LookingGlass/","excerpt":"去年12月Looking Glass Factory Inc.在Kickstarter上进行众筹，Looking Glass Portrait项目，全息显示相框产品，众筹早鸟价格199美元，虽然中间由于疫情导致产品所使用的Raspberry Pi缺货等原因延迟了一些，该产品5月第一批还是顺利发货。产品收到后第一时间点亮还是很惊艳的，看着三维的航天员在相框中缓慢的跑动，机械狗等demo，有一种赛博朋克2077的感觉，或者猫猫和狗狗的demo也很讨人喜欢。该款产品的宣传也可以直接通过公司官网的Portrait产品页面观看。这个小相框摆在桌面上，很容易让自己或者路过的人多看两眼。作为该公司第一款To C的电子消费品（该公司已有两款前期产品，Looking Glass 15.6”和Looking Glass 8K，都是相对更大的产品，光学方案可能不同），笔者认为该产品打磨的很好，产品交互很简单，内容制作相对容易。这篇文章主要只探索Looking Glass Portrait背后的光学方案。来看一下它是如何显示3D信息的。","text":"去年12月Looking Glass Factory Inc.在Kickstarter上进行众筹，Looking Glass Portrait项目，全息显示相框产品，众筹早鸟价格199美元，虽然中间由于疫情导致产品所使用的Raspberry Pi缺货等原因延迟了一些，该产品5月第一批还是顺利发货。产品收到后第一时间点亮还是很惊艳的，看着三维的航天员在相框中缓慢的跑动，机械狗等demo，有一种赛博朋克2077的感觉，或者猫猫和狗狗的demo也很讨人喜欢。该款产品的宣传也可以直接通过公司官网的Portrait产品页面观看。这个小相框摆在桌面上，很容易让自己或者路过的人多看两眼。作为该公司第一款To C的电子消费品（该公司已有两款前期产品，Looking Glass 15.6”和Looking Glass 8K，都是相对更大的产品，光学方案可能不同），笔者认为该产品打磨的很好，产品交互很简单，内容制作相对容易。这篇文章主要只探索Looking Glass Portrait背后的光学方案。来看一下它是如何显示3D信息的。 我们先看看Portrait的性能参数和它能显示何种3D 技术参数Viewing cone可视角度：58° No. of views可视的三维信息片：45-100 Input resolution输入分辨率：1536像素 x 2048像素 Aspect ratio长宽深比：4:3:2 显示屏：7.9”/20cm对角 显示屏：Advanced high precision lens and microlouvre array 高精密镜片和微百叶窗阵列(我们马上就会讨论这到底在说什么) 显示效果 不同角度看过去显示是不同的。 人的双眼看，是有深度信息的（视差）。 光学原理视差显示再加上一些细节观察，结合这些技术参数我们可以逐步破解Looking Glass Portrait背后的光学原理。打了一束光到设备上，发现反射光出现了一道条纹，角度一直是如图显示的，略微倾斜。 近距离观看，发现反光的条纹是一条条的结构自上而下有一个角度穿过整个显示屏。再结合技术参数里说的Advanced high precision lens and microlouvre array 高精密精品和微百叶窗阵列，第一个猜测就是这是用了柱镜光栅的原理（Lenticular lens） 对于柱镜光栅，我们其实都在生活中见过，就是常见的3D卡片。 柱透镜立体光栅实现立体成像原自于视差立体法，下图展示了两种视差立体法，一种是通过视差遮挡，一种是通过柱镜。视差遮挡法是用在显示图像前加上规律变化的遮挡条纹，让观察者在某个距离范围内，左眼只能看到一部分图像，右眼只能看到另一部分图像，这样就可以把有视差的两张图像分割成两组条纹图像（R和L）。柱镜立体法原理类似，形态如图所示。 下一个问题就很有趣了，Looking Glass Portrait是如何实现这么丝滑的立体显示的（我们小时候用的卡片图像变化都很快，然后也没有丝滑的连续的变化感觉）？为什么这个设备里的柱镜是倾斜的？ 通过查询Looking Glass Portrait的几个专利，发现在US20190268588A1里提到了使用Lenticular lens等方法产生视差，同时专利里提到了另一个专利描述了图像分割来实现期待的显示效果.（This technique is described further in U.S.Pat.No.6,064,424. Images licing or division(of light source 10 output) may be accomplished in any manner to achieve a desired viewing result.）。找到另一个专利，发现是飞利浦公司1997年的专利，主要描述了如何充分使用电子显示屏幕的相同的横向和纵向分辨率和柱镜结合来完成3D显示（该专利已于2017年过了专利保护期）。 我们先讨论柱镜3D显示的一个问题，是如果柱镜是竖直的，我们水平左右移动从不同不同角度就可以看到不同的视角（view），如果我们想看到很多视角，我们就可以横向去在一个柱镜里去添加更多的图像块（视角），如下图所示，展示了4个view如何构建，如果我们需要在在4度的观察视场角里，丝滑的观察图像，我们需要在一个柱镜的范围里添加4个view，让我们每一度里都有一个不同的角度的图像信息。如果我们的显示部分横向纵向分辨率是一样的，我们会发现，由于柱镜的存在，我们的横向分辨率比纵向分辨率低4倍。这个问题如果是使用打印的图像，很好解决，我们纵向上只需要降低4倍打印分辨率，这样我们横向和纵向分辨率就是1：1了。但如果我们用的是一个电子显示屏，我们如果这么做去把横向纵向分辨率调节成一样，我们就要不去显示纵向的一些像素点，那就白白损失掉了我们显示屏纵向的像素点的作用。当我们想在50度视场角里丝滑的显示50个view时，我们需要在一个柱镜里并列塞进去50个图像slice（view），这就出现了两个问题，第一个问题是我们刚才提到的（1：50的分辨率区别太大了，我们浪费掉了98%的像素），第二个问题是我们的柱镜可能要做的很宽，去塞下这些图像slice，对于一个300 PPI的显示屏，一个像素点（RGB）是85um，50个就是4.25mm，已经肉眼的一定距离可见柱镜了。 飞利浦提出的专利通过倾整个柱镜的面，让其和显示屏呈现一定角度，来利用其纵向的显示屏像素点。如专利的下图所示，16是柱镜，条状块是像素点。通过让柱镜面和显示屏呈现一个夹角，可以看到view 1最靠近柱镜左侧，然后依次是2，3，4，5，6。这样，每两排像素点会构成了一组全信息。 回到Looking Glass Potriat，产品信息里，输入分辨率是1536像素 x 2048像素，No. of Views是45-100，我们可以实际数一下到底有多少个柱镜。通过下图照片，简单数了一下，是大概横向250个左右，考虑横向像素点一共1536个，我们可以猜测一共大概有256个柱镜，正好是6倍的关系。那这样，横向每个柱镜就可以放入6个像素点，如果要达到产品信息的No. of Views的最低要求45，纵向我们需要8~16行像素。8应该是最合理的，因为这样还基本在一个正方向的空间内显示完整的48个view的信息。宏观分辨率是256 x 256（1536/6 = 256, 2048/8=256）。大概计算了一下产品中柱镜的角度，是8°左右，如果是柱镜的一侧边从上到下通过8个像素，从左到右通过1个像素，那么是7.12°。不过这只是大概观察，主要是为了说明原理。 我们尝试画一个图展示如何显示这48个像素点，每个像素点都在显示什么。Looking Glass Portrait的柱镜是向左倾斜，但是为了结合专利图示，我们的示意图按专利图示也向右倾斜。最终画出来的图如下图所示，我们想象成每一个黑色框中是一个空间信息pixel（我们叫它大pixel），每一个这样的pixel结合柱镜可以展示48个角度的图像信息。这样，Look Glass Portrait就成为了一个256 x 256像素的空间信息显示屏。 颜色显示如何处理颜色呢？我们知道每一个小像素点都是由RGB像素点组成的，可以显示各种颜色，但是如果简单的正常显示，对于1-48这些角度的信息，由于他们和柱镜的相对位置不同，造成显示时，亮度可能会有所不同（出射光角度，杂光等问题），同时由于不同角度的放大率不同，会造成色彩条纹的问题。飞利浦的专利提出了几种方式去解决色彩条纹的问题，而且我们可以从Looking Glass Portrait的显示中看到应用了类似的方法。飞利浦展示了一个7 view的系统，我们把每7个view叫做一个大像素。 第一种方法是使用第一个大像素的view 1显示红，第二个大像素的view 1显示绿，第三个大像素的view 1显示蓝，4A展示了这个概念，4B展示了大像素层面，rgb是如何现实的。这个方式的问题是彩色条纹还是会出现，会出现在对角（图4B，r练成了一条线）。所以飞利浦又提出了两种其他的方法去解决这个问题 方法二和方法三的概念相同，比如方法二，用第一个大像素的第一行所有view显示红，然后右下角的大像素的第一行所有view显示绿，然后这个大像素的再左下角的大像素的第一行所有view显示蓝，见图5A。在5B中，虚线类似梯形框起来的就是一个大号的色彩pixel，这种显示问题是会和下一个显示点的信息有cross talk，因为在这个虚线框里会有一个来自于另一个大号色彩pixel的g’。 我们看看Looking Glass Portrait是如何排布颜色的，通过放大镜拍摄像素点，这是一片宏观上（远看）显示为白色的区域，我们发现像素颜色是如图所示的，我们可以大胆假设一下可能的方式。竖向的倾斜线是柱镜的边界，可以看到纵向颜色的重复正好是8行，如果继续放大是可以看到方形的显示屏基础像素点的。观察这个像素点我们发现可能1-48view和我们的简单排布可能不太一样，看起来是个类似菱形，可能这些行之间有shift以构建完整的256x256pixel，让算法更方便（矩形排布在边角会有半个大pixel的情况）。然后就是颜色显示上，看起来每个大pixel上部分显示r，然后b，然后g的总体思路，但是实际上混色是一个比较复杂的组成而不是简单的某一行展示单色。个人认为可能这样做的原因应该是可以让显示效果更好，毕竟飞利浦提出专利后显示屏技术也发展了20年，而且Looking Glass Portrait的每个大像素里像素多得多，也小的多。如果有更好的放大设备，我们可以一探究竟。 总结上面的分析当然都是基于表面上看到的信息得出的，不过如果真的是如分析所说，Looking Glass Portrait并不是像产品介绍中一样使用了“next generation holographic display technology”（下一代的全息显示技术），相反，它使用了“last generation technology”（上一代的技术，飞利浦的专利是1997年的）。不过，作为一种产品宣传策略这可以理解。而且，这并不妨碍我认为这是一款好产品，无论是从显示效果，产品形态上，还是价格上，都可以说是一款85分以上的作品。 需要探索的问题还有很多，比如产品宣传里所说的45-100view，我们分析了48view的情况，如果100view，Looking Glass Portrait是如何实现的？而且这种连续的分view是否能在软件端实现？还是这种说法只是产品宣传？个人认为可能是为了避免技术上的猜测，实际的变化范围可能是48-96view。 对这个产品的分析过程有一种侦探探案的感觉，也确实是拿着一个放大镜还有开着闪光灯去仔细观察这个产品，格物，致知。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"技术评论","slug":"技术评论","permalink":"https://faster-than-light.net/categories/%E6%8A%80%E6%9C%AF%E8%AF%84%E8%AE%BA/"}],"tags":[{"name":"技术评论","slug":"技术评论","permalink":"https://faster-than-light.net/tags/%E6%8A%80%E6%9C%AF%E8%AF%84%E8%AE%BA/"}]},{"title":"塑料镜头制造 第二章：材料","slug":"塑料镜头制造 第二章：材料","date":"2021-05-19T13:00:00.000Z","updated":"2023-02-06T14:33:43.623Z","comments":true,"path":"LensMaking_C2/","link":"","permalink":"https://faster-than-light.net/LensMaking_C2/","excerpt":"手机镜头使用塑料材料的最重要的原因就是可注塑成型的大规模生产性，同时，塑料镜片的高度自由的变化面型也是其优点之一。随着这些年的手机镜头发展，高精密玻璃材质镜片也开始出现在高端镜头上。塑料材料和注塑成型是小型化手机镜头实现的基础。本章会按上一章简单介绍过的镜头的结构来针对塑料镜头的每一部分说明他们的材料选择和特性，分别为镜片材料，镜筒/镜座/隔圈/遮光片/压圈材料。","text":"手机镜头使用塑料材料的最重要的原因就是可注塑成型的大规模生产性，同时，塑料镜片的高度自由的变化面型也是其优点之一。随着这些年的手机镜头发展，高精密玻璃材质镜片也开始出现在高端镜头上。塑料材料和注塑成型是小型化手机镜头实现的基础。本章会按上一章简单介绍过的镜头的结构来针对塑料镜头的每一部分说明他们的材料选择和特性，分别为镜片材料，镜筒/镜座/隔圈/遮光片/压圈材料。 镜片材料塑料材料基底塑料镜头的镜片材料主要有几种类型，本质上都是塑料（高分子聚合物）。他们都是热塑性塑料，是加热后软化、可塑，冷却后硬化，再加热后又会软化的塑料。运用加热及冷却，使其产生液态与固态之间的可逆变化的物理变化。有些材料发明时间较早，有些相对新一些。有些是通用应用塑料，有些材料是专门开发的光学塑料材料，更专门的用于一些光学领域。在光学设计中，我们可能会看到各个公司的材料牌号，如EP8000, K26R, APL5015, OKP-1等等。他们都属于某个塑料材料类型，其中以下几种类型比较常见，我们按他们的出现时间进行一个先后排序： PMMA/Acrylic: Poly(methyl methacrylate)，聚甲基丙烯酸甲酯（有机玻璃，亚克力）。由于其便宜的价格和高透过率，高机械强度的特性，PMMA是生活中最常见的玻璃替代品，大部分的透明塑料都是PMMA制造的，比如透明板，透明勺子，Led上的小镜头等等。PMMA在1930年代就开始大规模生产。 PS: Polystyrene，聚苯乙烯，是无色透明的热塑性塑料，也是一种工程塑料，在1930年代开始大规模生产。我们生活中常见的白色泡沫盒子，餐盒等很多都是PS材料。 PC: Polycarbonate，聚碳酸酯，也是一种无色透明的无定性热塑性，也是通用型塑料，1960年代开始才工业化生产。PC材料的抗冲击性很好，常见的应用有饮水机的水桶，护目镜等。 COP &amp; COC: Cyclic olefin Polymer(COP), 环烯烃聚合物; Cyclic olefin copolymer(COC) 环烯烃共聚物，是一种具有环状结构的非晶性透明高分子材料，具有环内碳碳双键的环状烃，由环烯烃单体通过自聚（COP）或与其他分子（如乙烯）共聚（COC）制成 ，COP和COC特性几乎是一样的。这种材料相对较新，最开始发明出来的时候就主要是考虑一些光学相关应用，现今广泛应用于薄膜，光学镜片，显示屏，医疗（包装瓶）行业。COP 1990年左右完成工业化生产，COC 在2000年前完成工业化生产。 O-PET：Optical polyester 光学聚酯纤维，O-PET是Osaka 在2010年代开始商业化。 当分析一种光学材料时，我们主要关注他们的光学特性和机械特性。 光学特性1：折射率&amp;色散从SPIE Field Guide to Molded Optics里这张总结图可见，不同光学塑料材料基本上落到了两个区间：一组是高折射率，高色散 ；一组是低折射率，低色散。对比起玻璃材料可选的折射率和色散范围，我们会发现塑料材料的折射率可选范围很窄，所有光学塑料材料都是相对较低的折射率。总体而言，塑料材料可选范围更窄，商用的材料牌号只有10~20种左右，很大程度上从材料上限制了光学设计的自由度。 折射率随波长变化：光学塑料材料折射率随波长增加，折射率略微下降，整体相对稳定。 折射率随温度变化Dn/DT：光学塑料的折射率温度系数比玻璃要大6倍到50倍，为负值，意味着随着温度的升高，折射率下降。比如对于546nm波长，-20°C到40°C，塑料材料的dn/dT数值在-8到-15X10^–5/°C，而对比起来，玻璃材料NBK7数值在3X10^–6/°C 光学特性2：透过率参考GS Optics这张图，大部分的光学塑料都在可见光波段有着90%以上的透过率；对于电子消费品常见的红外波段850nm和940nm，也有着很好的透过率。塑料材料的透过率随着时间也会有一定程度的下降。主要原因是塑料吸收了阳光中的紫外线，分子链断发生了降解与交联，导致了物理及化学性质变化，最明显的宏观表现就是塑料材料发黄。 光学特性3：应力双折射应力双折射（Birefringence）是材料的一种光学性质，材料的折射率和入射光的偏振状态和传播方向相关。对于不同偏振态，材料显现出的折射率不同。对于一些系统来说，这种折射率偏差很小，对于系统并没有非常大的影响，但是对于一些特别的光学系统来说，这种偏差已经足以导致系统性能的严重下降。 塑料材料本身并不具有各项异性的特点，但是对于塑料的注塑成型会引入应力双折射。主要产生原因就是在注塑成型时引入的应力和冷却后塑料大分子的排列方式。应力一般集中在注塑料口附近，如下图所示。一般的设计生产原则是让光学有效面内的应力双折射尽量小，这需要合理的设计镜片结构，注塑成型的模具和生产参数。几种材料中，PC材料更容易产生应力双折射（比PMMA材料大10倍左右），COP、COC、PMMA材料有更低的应力双折射。 机械特性1：玻璃转化温度塑料材料的玻璃转化温度Tg，这个词从名字上看就知道是来源自玻璃。对于非晶聚物，对它施加恒定的力，观察它发生的形变与温度的关系，通常特称为温度形变曲线或热机械曲线。非晶聚物有三种力学状态，它们是玻璃态、高弹态和粘流态。在温度较低时，材料为刚性固体状，与玻璃相似，在外力作用下只会发生非常小的形变，此状态即为玻璃态：当温度继续升高到一定范围后，材料的形变明显地增加，并在随后的一定温度区间形变相对稳定，此状态即为高弹态，温度继续升高形变量又逐渐增大，材料逐渐变成粘性的流体，此时形变不可能恢复，此状态即为粘流态。我们通常把玻璃态与高弹态之间的转变，称为玻璃化转变，它所对应的转变温度即是玻璃化转变温度Tg，或是玻璃化温度。Tg一般定义为玻璃转化开始的温度，既材料非晶聚部分开始移动的温度。常见的光学镜片用塑料的Tg在120~160℃间。这也保证了至少在手机里的极端温度下（85°C），塑料镜头依然可以保持一定的热稳定性。室温是非晶态热塑性塑料使用的上限温度，但却是橡胶使用的下限温度（橡胶在室温处于高弹态）。 机械特性2：热膨胀系数热膨胀系数（CTE）是衡量一个材料随温度变化而产生的大小的变化的参数。光学用塑料材料的热膨胀系数CTE大概都在(5-10)*10^-5 /℃左右，对比玻璃材料(5-10)*10^-6/℃，基本相差一个数量级。如果一个塑料材料的CTE是6*10^-5 /℃，那么对于一个直径10mm的塑料镜片，10°C的变化就会造成大概0.01 x 6 x 10^-5 = 6 x 10^-6 m = 6um的长度变化。 机械特性3：吸水性COP和COC的吸水率都&lt;0.01%，PS材料吸水性0.03%，PMMA吸水性0.2%，PMMA吸水性0.3%。吸水率一般的测定方法是把完全干燥过被测材料，浸入23℃的水中，24小时后取出擦干测量重量的变化，（参考Water Absorption ASTM D570）。由于COP和COC非常低的吸水性，所以COP和COC材料也常用来作为药品的包装瓶。塑料材料吸水性越强，就越容易受到温度和湿度的影响，造成镜片的面型改变，或者造成镜片之间的受力变化。由于塑料较强的吸水性，在注塑成型前，都会对塑料材料颗粒进行干燥处理，否则，塑料里的水分会影响塑料的粘滞性，影响成型过程，也可能对最终产品的外观造成影响。塑料镜头受吸水性的影响主要要通过高温高湿信赖性试验来确定，信赖性相关内容我们可以在第七章：评测中涉及。 机械特性4：成型收缩率热塑型材料的成型后会收缩，收缩率的测定时基于一定的方法，对于光学塑料这几种镜头材料基底，一般为0.5%~1.2%，测定方法的定义可能每家公司是不同的。 其他特性塑料材料的其他特性有：强度，雾度，电气性能，耐化学品和药剂性等。 镜片塑料材料牌号以下列出了一部分常用的手机塑料镜头常用塑料材料，可以看到，材料特性基本由基底决定。这些塑胶原材料都是由化工企业制造，光学镜头塑料只是这些公司塑料业务的一部分。我们也可以用这个表格进行材料基底的比较。对于各个塑料光学镜头制造企业，可能会有自己的材料喜好（比如对于某种材料成型控制经验更足）。 参考链接： Mitsubishi Gas Chemical三菱瓦斯化学, Lupizeta(TM) EP系列 OSAKA GAS Chemical大阪瓦斯化学, OKP系列 Zeon Chemicals瑞翁化学, Zeonex系列 Mitsui Chemicals三井化学株式会社, APEL系列 材料形态大部分光学塑料原材料都以颗粒形式存在 镜筒/镜座/隔圈/遮光片/压圈材料镜筒，镜座，压圈等主要是作为结构件存在，主要材料有PC，金属（黄铜）等。我们文章前面提到PC的特性之一就是机械强度高，热稳定好，所以很适合作为光学机械件。隔片的主要作为为遮光，材料为薄膜类材料。 镜筒及镜座白物镜片都会组装进镜筒，主要材料为PC。对于非一体式镜头，镜筒和镜座是通过螺纹组装在一起的，镜座负责一面和传感器结合，一面和镜筒结合。镜座材料也多为PC。 隔圈隔圈（Spacer）负责在镜头中提供精确地镜片间距，主要是PC或者金属材料，金属材料能提供更好的强度，常用的金属隔圈材料为黄铜。使用黄铜的原因主要是黄铜热稳定好，同时黄铜不会被磁化，不影响带有AF功能的模组的音圈马达VCM工作。 遮光片同时镜片间会插入遮光片用于遮挡杂光或者作为光阑，塑胶镜头大部分都会使用黑色薄膜类的隔片完成这项工作，主要是两种材料牌号，分别为Kimoto公司生产的Carbon feather，一种是Somar公司生产的Soma Black R Film。隔片的厚度很多都是一些标准厚度，35um或者105um等，也可以定制。Acktar公司也提供类似的片材。 Kimoto（株式会社）的产品：Carbon Feather Carbon Feather设计就是用于遮挡和吸收光学设备和系统中的杂光，这种材料是在PET薄膜上下表面进行碳化镀膜（也有不镀膜的）实现的。根据公司官网介绍：Carbon feather薄膜有非常高的吸光度(OD&gt;6)，低机械摩擦力和热膨胀。所以这种材料可以用于照相机的光阑和遮光片。 Somar（株式会社）的产品：SomaBlack薄膜 SOMABLACK材料是Somar公司生产的用于光学系统遮光的材料，这种材料主要是聚酯纤维混入碳制成的，表面处理会做成雾面化。 这两种原材料都是卷材形式，由模切厂模切形成环状遮光片形态。 压圈压圈一般在最后一个镜片外，提供额外的支撑力。有些镜头的最后一片镜片直接点胶和镜筒壁粘合在一起，但是有些设计或者应用中，这种直接点胶的方式提供的黏合力不够，镜头可能会无法通过信赖性测试，所以会使用压圈。压圈的材料主要是PC或者金属（黄铜）。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"塑料镜头制造","slug":"塑料镜头制造","permalink":"https://faster-than-light.net/categories/%E5%A1%91%E6%96%99%E9%95%9C%E5%A4%B4%E5%88%B6%E9%80%A0/"}],"tags":[{"name":"镜头","slug":"镜头","permalink":"https://faster-than-light.net/tags/%E9%95%9C%E5%A4%B4/"},{"name":"专题","slug":"专题","permalink":"https://faster-than-light.net/tags/%E4%B8%93%E9%A2%98/"}]},{"title":"塑料镜头制造 第一章：综述","slug":"塑料镜头制造 第一章：综述","date":"2021-05-18T13:00:00.000Z","updated":"2022-07-31T06:18:27.547Z","comments":true,"path":"LensMaking_C1/","link":"","permalink":"https://faster-than-light.net/LensMaking_C1/","excerpt":"近20年的手机及电子消费品高速发展，带动了手机照相机的快速发展。从世界上第一款拍照手机，夏普在2000年推出的J-SH04， 11万像素相机，到现在动辄1亿像素照的手机摄像头模组；从一颗镜头到双摄三摄四摄像，广角，长焦，多种传感融合；从手机的一个附属功能，变成现在发布会的主要亮点；从单纯的2D图像的获取，到现在视频流，深度信息，以及计算摄影和结合，手机摄像头一直给我们带来各种各样的惊喜。这个发展也催生了一大批相关企业和从业人员，其中精密光学塑料镜头作为一个重要部件在近10年来经历了快速的发展。本系列文章希望能给在校学生和行业内的从业者提供一些塑胶镜头制造和设计的基础理解，尝试补充课本上平常不怎么涉及的工程相关方法，并尝试尽量结合理论内容，可以作为深入了解塑胶镜头的起点。计划用几篇文章详细介绍塑胶镜头的结构，注塑成型材料，模具，注塑成型，镀膜，组装，评测及设计相关的内容。","text":"近20年的手机及电子消费品高速发展，带动了手机照相机的快速发展。从世界上第一款拍照手机，夏普在2000年推出的J-SH04， 11万像素相机，到现在动辄1亿像素照的手机摄像头模组；从一颗镜头到双摄三摄四摄像，广角，长焦，多种传感融合；从手机的一个附属功能，变成现在发布会的主要亮点；从单纯的2D图像的获取，到现在视频流，深度信息，以及计算摄影和结合，手机摄像头一直给我们带来各种各样的惊喜。这个发展也催生了一大批相关企业和从业人员，其中精密光学塑料镜头作为一个重要部件在近10年来经历了快速的发展。本系列文章希望能给在校学生和行业内的从业者提供一些塑胶镜头制造和设计的基础理解，尝试补充课本上平常不怎么涉及的工程相关方法，并尝试尽量结合理论内容，可以作为深入了解塑胶镜头的起点。计划用几篇文章详细介绍塑胶镜头的结构，注塑成型材料，模具，注塑成型，镀膜，组装，评测及设计相关的内容。 照相机模组的基本结构照相机模组（Camera Module）是由镜头（Lens），图像传感器（Image sensor），PCB电路基板，音圈马达VCM（Voice Coil Motor），滤光片（Filter），连接线（Flex）和B2B接口(Board to Board connector)等组成的光电系统。最终照相机模组连接到主板或者图像信号处理器ISP（Image Signal Processor）上和操作系统软件或者图像处理软件进行交互。这些元器件里，图像传感器会占物料成本的40%左右，镜头会占30%左右，是最重要的两个零部件。 以下几张图展示了手机照相机单个模组，多摄模组（多个模组固定在支架上）的形态，在手机上的位置，以及模组的基本结构等。可以看到，大部分模组都是封装成最终出来一个B2B接口。如果想更多的了解手机模组在手机里是如何连接和分布的可以多看一些手机分析及拆解视频。 照相机模组产业链在手机的生产中，照相机模组是作为一个模块元件（module）生产的，它的制造流程分工是产业链发展的结果，由于各零部件的技术特性和制造方式不同，各种零部件由相应的制造企业生产，最终由模组厂组装和测试完成，最终送至富士康，和硕等代工厂进行最后的组装。下图展示了整个相机模组供应链中比较有代表性的一些企业。 虽然本系列文章重点不在市场行情，不过我们还是要了解到底我们面对的何种体量的生产。下图展示了2017年-2021年（预测）的全球手机镜头出货量，可以看到2021年预期出货量是50亿颗镜头。而这些镜头大部分都是由几家企业生产的：大立光学，舜宇光学，玉晶光学，瑞声科技SEKONIX（世高光），关东辰美，三星电机等。对于单家企业，根据舜宇光学发布的信息，2021年2月，手机镜头出货量为1.297亿件，这几乎是行业内的最大产量了，既一个月生产近1.3亿颗镜头（当然生产一个4P镜头算一颗和一颗7P镜头也算一颗）。通过这些数字，想让读者思考的是在这种规模的需求下，设计和生产是如何进行的？产品是如何迭代的？创新又是如何进行的？如果对具体的企业和市场感兴趣，读者可以去看一些行业研报获取信息。 塑料镜头的基本结构镜头是相机模组的重要组成部分，电子消费品的所有模组都有小型化和价格便宜的需求，所以相机模组的镜头大部分都采用塑料树脂材料制成。下图是Sony Xperia 1 III的宣传图，展示了模组和塑料镜头的一些基本结构。但是塑料镜头的结构在这种宣传视频里简化了很多。 三星电机官网的这张图更具体的展示了塑料镜头的实际复杂结构，包括镜筒（黑色），镜片（彩色），隔圈（深灰色），遮光隔片（浅灰色薄片）等。同时，有些镜头还有镜座，压圈，滤光片，以及胶水（经常被忽略，但是十分重要）等结构。 根据下图，我们来简单介绍一下各个零部件的作用： 镜筒：整个镜头的基础机械结构，承载其他的零部件。 镜片：通过不同面型和材料的镜片搭配，实现光学功能。在塑料镜头中，镜片本身的非光学部分也承担着机械结构的作用。 隔圈：提供镜片到镜片的间隔。 遮光片：用于放置在镜片和镜片间遮挡杂光或者作为光阑。 压圈：有些镜头有，用于压住最后整个在镜筒中的所有其他部件（会和镜筒点胶固定在一起） 镜座：有些镜头会使用镜座（下图的支架），镜座的作用是连接镜头（通过螺纹）以及传感器底座（通过胶水）。配合镜座使用的镜筒会有螺纹。现在大部分的手机镜头都不使用镜座，如果是有AF（自动对焦）或者OIS（光学防抖）功能的相机模组，镜头的镜筒会和音圈马达组装在一起，通过胶水连接。如果是FF（固定焦距）的相机模组（比如手机的前摄镜头），大部分会采用一体式镜头镜座，既镜头前端是圆形的，镜头的末端是矩形用于和芯片底座进行点胶连接。 滤光片：有一些手机镜头滤光片会装载镜头的末端，但是现在大部分的滤光片都在模组厂进行组装，组装在传感器的上面。大部分滤光片都是IRCF（红外截止滤光片），用于阻挡红外光线进入传感器。不过近期由于各种红外应用的兴起，红外镜头的滤光片是红外通过可见光截止。 塑料镜头的生产基本流程 镜头制造是一项系统工程，塑料镜头的大规模生产是科学和生产经验的结合，也是性能品质和生产效率及成本的平衡。在系列文章中，我们会更强调说明制造型企业的工程师们是如何结合这些科学方法和经验进行这种平衡的。 核心点：又快又便宜的把镜头做的又好又一样。（大规模生产） 镜头制造的流程简单来说如下图所示，这也是我们这一系列文章会涉及的内容。略有不同的是，我们将会首先从光学镜头的基础材料说起，然后讨论注塑模具和注射成型，然后我们讨论镀膜，零部件组装和品质检测。了解了整个的制造的流程后，最后一章我们再回过头来讨论光学镜头的设计，我们会看到在最初设计阶段，是如何把后续所有制造流程统一起来的。 下图展示了更具体的制造流程，我们后面的一系列文章会去具体的说明这些流程，这里我们可以说明的是镜头（或者其他大规模生产的元器件）都会经历类似的流程或者方法论，既设计阶段，工程验证阶段（验证设计是否实现功能，验证可量产性），开发验证阶段（优化性能和可量产性），生产验证阶段（扩大生产），量产。通过这张图可以看到，设计和生产流程包括了具体的各种零部件，技术部门，营销市场部门的交流协作。如今的镜头制造型企业除了技术实力的比拼外，流程的标准化，各部门之间的耦合效率等也都是一个企业实力的重要部分。同时一个镜头制造型企业里会有多工种的工程师及生产人员，包括产品经理，项目经理，市场经理，营销人员，光学工程师，结构工程师，模具设计工程师，模具加工工程师，成型工艺工程师，镀膜工艺工程师，组立工艺工程师，自动化工程师，设备工程师，品质工程师，模组厂驻厂工程师，FA工程师，采购人员，以及数量众多的生产和品质检测人员。 推荐视频：造物说：一共分几步 第一集，视频里10：36-14：00的部分展示了部分镜头和模组的生产过程，可以先建立一个感性的理解。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"塑料镜头制造","slug":"塑料镜头制造","permalink":"https://faster-than-light.net/categories/%E5%A1%91%E6%96%99%E9%95%9C%E5%A4%B4%E5%88%B6%E9%80%A0/"}],"tags":[{"name":"镜头","slug":"镜头","permalink":"https://faster-than-light.net/tags/%E9%95%9C%E5%A4%B4/"},{"name":"专题","slug":"专题","permalink":"https://faster-than-light.net/tags/%E4%B8%93%E9%A2%98/"}]},{"title":"Sony Xperia 1&5 Mark III变焦镜头","slug":"Sony Xperia变焦镜头","date":"2021-05-15T16:05:00.000Z","updated":"2021-12-04T11:32:05.725Z","comments":true,"path":"TechReview_1_SonyXperiaLens/","link":"","permalink":"https://faster-than-light.net/TechReview_1_SonyXperiaLens/","excerpt":"Sony 近期推出了自己的Xperia 1和Xperia 5 Mark III手机，里面很有意思的是一款变焦镜头。说变焦可能不太准确，因为这款镜头并是不连续变焦镜头，而是一款只实现两个焦段70mm和105mm的潜望式镜头，不过确实焦距变了，叫变焦也无可厚非。所有70mm~105mm中间的焦距都靠数字变焦实现。这次的三颗摄影镜头的参数如下。","text":"Sony 近期推出了自己的Xperia 1和Xperia 5 Mark III手机，里面很有意思的是一款变焦镜头。说变焦可能不太准确，因为这款镜头并是不连续变焦镜头，而是一款只实现两个焦段70mm和105mm的潜望式镜头，不过确实焦距变了，叫变焦也无可厚非。所有70mm~105mm中间的焦距都靠数字变焦实现。这次的三颗摄影镜头的参数如下。 等效焦距 F/# 图像传感器 图像传感器大小 16mm F2.2 12MP, Dual-PD 1/2.6” 24mm F1.7 12MP, Dual-PD 1/1.7” 70, 105mm F2.3, F2.8 12MP, Dual-PD 1/2.9” 通过索尼的视频宣传可以看到，实现这两个焦段主要是靠三组镜头，通过移动后两组来实现。 虽然以前有几款手机实现了连续变焦，有很多手机型号实现潜望式，但是索尼是第一次采用这种折中的方式：在潜望式中实现部分的变焦功能。连续变焦模组应用在手机里的有Asus Zenfone Zoom，是用了Hoya的Hoya CUBE lens unit (2013)，该模组是实现28mm-84mm的等效焦距的连续变焦（F/2.7-F/4.8)，但是看真机图也能看出来这个模组还是很占空间的。索尼这次提供的70mm-105mm(F/2.3-F2.8)，看比例，可能索尼在甚至更小的模组空间里实现了比Hoya模组更高的光学性能（两者芯片大小几乎相同）。从产品角度考虑，普通消费者确实不是很关心是否是连续变焦，甚至不关心是否可以变焦，单一焦段的潜望式普通消费者用着也很好。这次采用这种方案更像是Sony的一次创新性尝试和市场卖点。不过模组的实现上，还是有很多有趣的地方的。 Sony说该项技术的难点是让驱动器（accurator）实现高精度的镜组移动和相对位置。Sony说理论上他们可以实现连续变焦，只是在这款产品上选择不去使用。这句话可能指的是光学上可以，只需要更改机械结构来实现连续变焦。也可能指的是他们的机械结构已经有了这个能力，但是考虑到对焦精度，速度，信赖性，算法等多方面问题，决定不使用。既然Sony提到了Accurator，可能指的是第二种意思，那就意味着Sony可能是使用了类似Hoya模组内镜组的移动方式。参考Hoya专利 , Hoya使用的是两个滑竿的结构（见下图）。 这种变焦模组的生产方式在镜头厂制造方式： 第一种可能是镜头厂是做出三组镜头然后单独测试，最后在模组厂进行组装。这种方式镜头生产相对容易。 第二种可能是在镜头厂是三组镜片的搭配好，出货时是整组出货。这种方式测试如何进行是个问题。 在模组厂的制造方式： 组装后需要通过校准算法确认镜组在不同焦段的位置，写入模组的驱动器。这就需要第一个可移动镜组移动到一个位置，然后第二个可移动镜组移动到图像最清晰位置，记录位置，然后重复此过程。如果每1mm焦距一个移动位置记录，就需要35次测试。在实际应用中，可能模组还会进行对焦后的微调来补偿驱动器的漂移等问题。 这样生产中最终的生产效率可能不会很高，但是考虑到Sony这两款产品的实际出货量，就算该模组UPH低一些贵一些也没什么问题😂。可能产品端还是考虑的对焦速度和准确性以及图像质量问题，没有选择使用连续对焦。很有意思的是，在宣传视频中，出现变焦这部分下面一行小字“The Feather require software update, roll out time may vary by market and/or opertor”，看起来连续变焦的特性等软件更新可以实现。那这么看，更多的是软件上和校准上的问题导致现在只有两个焦段。 这些现在也都只是猜测，更具体的信息估计要等实际拆解后可能能看出端倪。以后有更多信息后再去更新该文章。 版权声明: 感谢您的阅读，本文由超光版权所有。如若转载，请注明出处。","categories":[{"name":"技术评论","slug":"技术评论","permalink":"https://faster-than-light.net/categories/%E6%8A%80%E6%9C%AF%E8%AF%84%E8%AE%BA/"}],"tags":[{"name":"技术评论","slug":"技术评论","permalink":"https://faster-than-light.net/tags/%E6%8A%80%E6%9C%AF%E8%AF%84%E8%AE%BA/"},{"name":"镜头","slug":"镜头","permalink":"https://faster-than-light.net/tags/%E9%95%9C%E5%A4%B4/"}]}],"categories":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/categories/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"},{"name":"光谱学","slug":"光谱学","permalink":"https://faster-than-light.net/categories/%E5%85%89%E8%B0%B1%E5%AD%A6/"},{"name":"TOF系统","slug":"TOF系统","permalink":"https://faster-than-light.net/categories/TOF%E7%B3%BB%E7%BB%9F/"},{"name":"塑料镜头制造","slug":"塑料镜头制造","permalink":"https://faster-than-light.net/categories/%E5%A1%91%E6%96%99%E9%95%9C%E5%A4%B4%E5%88%B6%E9%80%A0/"},{"name":"技术评论","slug":"技术评论","permalink":"https://faster-than-light.net/categories/%E6%8A%80%E6%9C%AF%E8%AF%84%E8%AE%BA/"}],"tags":[{"name":"光学新闻","slug":"光学新闻","permalink":"https://faster-than-light.net/tags/%E5%85%89%E5%AD%A6%E6%96%B0%E9%97%BB/"},{"name":"专题","slug":"专题","permalink":"https://faster-than-light.net/tags/%E4%B8%93%E9%A2%98/"},{"name":"光谱学","slug":"光谱学","permalink":"https://faster-than-light.net/tags/%E5%85%89%E8%B0%B1%E5%AD%A6/"},{"name":"TOF","slug":"TOF","permalink":"https://faster-than-light.net/tags/TOF/"},{"name":"镜头","slug":"镜头","permalink":"https://faster-than-light.net/tags/%E9%95%9C%E5%A4%B4/"},{"name":"技术评论","slug":"技术评论","permalink":"https://faster-than-light.net/tags/%E6%8A%80%E6%9C%AF%E8%AF%84%E8%AE%BA/"}]}